{
  "id": "01c83ae8-f188-4d97-99bc-2b138664e866",
  "rawText": "Proyecto CIUDAD SELFIE \nPropuesta de Desarrollo \n1. Resumen Ejecutivo \nCiudad Selfie es una plataforma digital que combina experiencia turística, \ntecnología y participación ciudadana. \nSu objetivo es fomentar el turismo, la cultura y el comercio local en la Ciudad de \nBuenos Aires mediante una dinámica interactiva: los usuarios recorren distintos \npuntos emblemáticos, escanean los QR de los tótems, suben su selfie y obtienen \npuntos, logros y beneficios que pueden canjear en locales adheridos. \nLa propuesta busca revitalizar el turismo interno, conectar a los visitantes con los \nbarrios porteños y fortalecer la identidad cultural de la ciudad a través de una \nexperiencia moderna, gamificada y accesible. \n2. Descripción General del Proyecto \n2.1 Descripción general \nEl proyecto consiste en una plataforma web accesible desde cualquier dispositivo \nmóvil. \nContará con dos modalidades: \n● Modo visitante: libre acceso para explorar lugares, leer información y \ndescubrir circuitos turísticos. \n \n● Modo usuario (autenticado con Google): registro de visitas, logros, desafíos, \nrankings y recompensas. \n \nLa app solicitará permiso de ubicación únicamente al validar un logro, \nasegurando que el usuario se encuentre efectivamente en el punto visitado. \n \n \n \nCiudad Selfie - Propuesta de Desarrollo                                  \n1\n \n\n \n \n2.2 Dinámica de uso \nCada punto turístico contará con un tótem selfie con código QR. \nEl proceso de experiencia es el siguiente: \n1. El visitante llega al punto, posiciona su dispositivo en el soporte del tótem y \nse toma una selfie \n2. Escanea el QR del tótem e ingresa a la plataforma. \n \n3. La app válida su ubicación y le otorga puntos base. \n \n4. Se desbloquea una trivia cultural del lugar visitado. \n \n5. Si el usuario sube su selfie en el punto, gana puntos adicionales. \n \n6. La app le propone un challenge que incluye: \n \n○ Un punto turístico (tótem). \n \n○ Un local gastronómico cercano. \n \n○ Un emprendimiento o tienda local. \n \n7. Al completar el circuito, obtiene un logro, que va a poder ver en su \npasaporte digital,  y puntos, que va a poder canjear por beneficios en los \ncomercios asociados. \n \n \n2.3 Personalización \nLa plataforma seleccionará los locales adheridos de cada circuito en función de: \n● Preferencias y comportamiento previo del usuario. \n \n● Calificaciones de otros visitantes. \n \n● Balance de afluencia para evitar concentraciones de público. \n \n \n \n \nCiudad Selfie - Propuesta de Desarrollo                                  \n2\n \n\n \n \n2.4 Diseño y estructura \nLa experiencia se centrará en un pasaporte digital, con diseño visual inspirado en \nun pasaporte o álbum de figuritas. \nCada lugar visitado genera un sello visual y se muestra en un mapa interactivo \ncon fotos, ratings y comentarios de otros usuarios. \nEl sistema incluirá: \n● Rachas: visitas consecutivas cada 15 días para multiplicar puntos. \n \n● Niveles de usuario: categorías como Explorador, Aventurero y Leyenda (que \nle van a permitir acceder a beneficios exclusivos). \n \n● Canje de puntos: sección de descuentos y beneficios exclusivos. \n \n2.5 Backoffice administrativo \nHabrá un panel de control para: \n● Alta de locales adheridos y gestión de beneficios. \n \n● Visualización de métricas: usuarios activos, zonas más visitadas, ratings y \ncantidad de canjes. \n \n● Análisis del impacto turístico y comercial del programa. \n \n2.6 Etapas futuras \n● Incorporación de dispositivos NFC en los locales para simular el “sellado” \ndel pasaporte. \n \n● Eventos especiales con mayor puntaje (por ejemplo, “Ruta del Tango”, \n“Sabores Porteños”). \n \n● Challenges patrocinados por marcas con logros personalizados y premios \nexclusivos. \n \n \n \nCiudad Selfie - Propuesta de Desarrollo                                  \n3\n \n\n \n \n3. Beneficios \nPara la Ciudad de Buenos Aires \n● Promueve el turismo interno y la circulación entre barrios. \n \n● Fomenta la difusión cultural y patrimonial. \n \n● Proporciona métricas en tiempo real sobre flujo turístico. \n \n● Refuerza la marca ciudad a través de innovación y participación. \n \nPara los Comercios y Emprendedores \n● Aumento del tráfico de visitantes y potenciales clientes. \n \n● Mayor visibilidad dentro del circuito turístico. \n \n● Posibilidad de promociones segmentadas por zona o tipo de usuario. \n \nPara los Usuarios \n● Experiencia divertida, gamificada y social. \n \n● Descubrimiento de lugares nuevos con recompensas reales. \n \n● Pertenencia a una comunidad activa de exploradores urbanos. \n \n \n \n \n \n \n \nCiudad Selfie - Propuesta de Desarrollo                                  \n4",
  "requirements": {
    "projectName": "CIUDAD SELFIE",
    "summary": "Ciudad Selfie es una plataforma digital que fomenta el turismo, la cultura y el comercio local en Buenos Aires a través de una experiencia interactiva y gamificada. Los usuarios visitan puntos emblemáticos, escanean QRs, suben selfies y obtienen puntos y beneficios canjeables.",
    "goals": [
      "Fomentar el turismo, la cultura y el comercio local en Buenos Aires",
      "Conectar a los visitantes con los barrios porteños y fortalecer la identidad cultural",
      "Ofrecer una experiencia moderna, gamificada y accesible"
    ],
    "constraints": [],
    "features": [
      "Modo visitante para explorar lugares y circuitos turísticos",
      "Modo usuario autenticado para registro de visitas, logros, desafíos, rankings y recompensas",
      "Permiso de ubicación al validar un logro",
      "Dinámica de uso con tótems selfie y códigos QR",
      "Trivia cultural y challenges por punto turístico",
      "Pasaporte digital para visualizar logros y puntos",
      "Personalización de circuitos basada en preferencias y comportamiento del usuario",
      "Pasaporte digital con diseño visual inspirado en pasaportes reales",
      "Sistema de rachas, niveles de usuario y canje de puntos",
      "Backoffice administrativo para gestión de locales y análisis de métricas",
      "Incorporación futura de dispositivos NFC y eventos especiales"
    ],
    "stakeholders": [
      "Usuarios de la plataforma",
      "Comercios y emprendedores locales",
      "Administradores del sistema"
    ],
    "techHints": [
      "Plataforma web accesible desde dispositivos móviles",
      "Autenticación con Google",
      "Uso de códigos QR",
      "Sistema de ubicación para validación de logros"
    ]
  },
  "clarifications": [
    "What is the project budget or cost constraint? (e.g., $X/month for hosting, $Y total budget)",
    "What is the target timeline or deadline for this project? (e.g., launch in 6 weeks, MVP in 3 months)",
    "What is the expected user scale or traffic? (e.g., 100 users, 10K daily active users, 1M page views/month)"
  ],
  "answers": {},
  "tickets": [
    {
      "id": "TICKET-001",
      "title": "Set up project repository",
      "description": "Create a central repository for the Ciudad Selfie platform to enable collaborative development and version control. This is essential for organizing the codebase, tracking changes, and facilitating CI/CD processes.",
      "acceptanceCriteria": [
        "Repository exists on GitHub or similar platform",
        "README file exists with basic project information",
        "Main branches (main, develop) are created and protected"
      ],
      "effortPoints": 1,
      "useCase": "Project Setup",
      "priority": "P1",
      "labels": [
        "infrastructure"
      ],
      "dependencies": []
    },
    {
      "id": "TICKET-002",
      "title": "Implement user authentication via Google",
      "description": "Enable user authentication using Google to allow users to sign in or sign up, providing a seamless and secure way to access their accounts and personalize their experience.",
      "acceptanceCriteria": [
        "Given user chooses to sign in, When user selects Google auth, Then user is authenticated and logged into the system",
        "User can sign out"
      ],
      "effortPoints": 5,
      "useCase": "User Authentication",
      "priority": "P1",
      "labels": [
        "backend",
        "authentication",
        "security"
      ],
      "dependencies": [
        "TICKET-001"
      ]
    },
    {
      "id": "TICKET-003",
      "title": "Design and implement the database schema",
      "description": "Create a database schema that supports user profiles, locations, QR codes, achievements, and administrative data. This schema will serve as the backbone for storing and retrieving all platform-related data efficiently.",
      "acceptanceCriteria": [
        "Schema supports all required entities and relationships",
        "Database is normalized to prevent data redundancy",
        "Indexes are created for frequently queried fields"
      ],
      "effortPoints": 8,
      "useCase": "Data Storage",
      "priority": "P1",
      "labels": [
        "backend",
        "database"
      ],
      "dependencies": [
        "TICKET-001"
      ]
    },
    {
      "id": "TICKET-004",
      "title": "Implement location permission and validation",
      "description": "Develop a feature that requests users' location permission and validates their location when they attempt to log an achievement. This is crucial for ensuring that achievements are earned genuinely at the designated locations.",
      "acceptanceCriteria": [
        "Given user attempts to log an achievement, When user grants location permission, Then system validates the location against the achievement's coordinates",
        "User receives feedback on the validation result"
      ],
      "effortPoints": 5,
      "useCase": "Location Validation",
      "priority": "P1",
      "labels": [
        "frontend",
        "backend",
        "location"
      ],
      "dependencies": [
        "TICKET-002"
      ]
    },
    {
      "id": "TICKET-005",
      "title": "Develop visitor and authenticated user modes",
      "description": "Create distinct user experiences for visitors and authenticated users. Visitors can explore locations and circuits, while authenticated users can additionally log visits, complete challenges, and earn rewards.",
      "acceptanceCriteria": [
        "Given user is not logged in, When they access the platform, Then they can explore locations and circuits",
        "Given user is logged in, When they access the platform, Then they can log visits, complete challenges, and view their progress"
      ],
      "effortPoints": 8,
      "useCase": "User Experience",
      "priority": "P1",
      "labels": [
        "frontend",
        "backend",
        "user experience"
      ],
      "dependencies": [
        "TICKET-002",
        "TICKET-003"
      ]
    },
    {
      "id": "TICKET-006",
      "title": "Implement QR code scanning and selfie upload feature",
      "description": "Enable users to scan QR codes at tourist points and upload selfies as proof of visit. This feature is key to the interactive and gamified experience, allowing users to collect points and achievements.",
      "acceptanceCriteria": [
        "Given user scans a QR code at a tourist point, When the code is validated, Then user can upload a selfie",
        "Selfie upload updates user's achievements and points"
      ],
      "effortPoints": 5,
      "useCase": "User Interaction",
      "priority": "P1",
      "labels": [
        "frontend",
        "backend",
        "media"
      ],
      "dependencies": [
        "TICKET-004",
        "TICKET-005"
      ]
    },
    {
      "id": "TICKET-007",
      "title": "Create digital passport UI",
      "description": "Design and implement the user interface for the digital passport, inspired by real passports. This will visually display users' achievements, points, and travel history within the platform.",
      "acceptanceCriteria": [
        "Digital passport UI resembles a real passport",
        "Users can view their achievements, points, and visited locations",
        "UI is responsive and accessible on mobile devices"
      ],
      "effortPoints": 3,
      "useCase": "User Interface",
      "priority": "P2",
      "labels": [
        "frontend",
        "design"
      ],
      "dependencies": [
        "TICKET-005"
      ]
    },
    {
      "id": "TICKET-008",
      "title": "Develop backoffice for administrative tasks",
      "description": "Build a backoffice interface for system administrators to manage locations, view metrics, and handle user issues. This tool is essential for the ongoing maintenance and analysis of the platform's performance.",
      "acceptanceCriteria": [
        "Admins can add, edit, or remove locations",
        "Admins can view platform usage metrics",
        "Admins can manage user issues"
      ],
      "effortPoints": 8,
      "useCase": "Administration",
      "priority": "P2",
      "labels": [
        "backend",
        "admin"
      ],
      "dependencies": [
        "TICKET-003"
      ]
    }
  ],
  "justification": {
    "pros": [
      "Breaking down the project into manageable tickets ensures clarity and focus for development teams.",
      "Prioritizing tickets helps in delivering the most critical features first, aligning with business goals.",
      "Dependencies between tickets guide the development flow, ensuring prerequisites are met before moving on to dependent features.",
      "Effort points help in sprint planning and resource allocation, promoting efficient project management."
    ],
    "cons": [
      "Estimating effort points accurately can be challenging and may require adjustments as work progresses.",
      "Dependencies might lead to bottlenecks if certain tickets take longer than expected to complete.",
      "Balancing priorities across a diverse set of features can be complex, especially when new requirements emerge."
    ],
    "alternatives": [
      "Kanban approach for continuous delivery without fixed sprints, allowing more flexibility but potentially less predictability.",
      "Feature-driven development, focusing on delivering complete features one at a time, which can simplify prioritization but may delay the release of interconnected features."
    ]
  },
  "cost": {
    "tokensIn": 0,
    "tokensOut": 0,
    "usd": 0
  },
  "createdAt": "2025-11-11T17:10:52.440Z",
  "updatedAt": "2025-11-11T17:10:52.440Z"
}