{
  "id": "a48a0e48-e01c-47d1-8816-32b218528655",
  "rawText": "Proyecto CIUDAD SELFIE \nPropuesta de Desarrollo \n1. Resumen Ejecutivo \nCiudad Selfie es una plataforma digital que combina experiencia turística, \ntecnología y participación ciudadana. \nSu objetivo es fomentar el turismo, la cultura y el comercio local en la Ciudad de \nBuenos Aires mediante una dinámica interactiva: los usuarios recorren distintos \npuntos emblemáticos, escanean los QR de los tótems, suben su selfie y obtienen \npuntos, logros y beneficios que pueden canjear en locales adheridos. \nLa propuesta busca revitalizar el turismo interno, conectar a los visitantes con los \nbarrios porteños y fortalecer la identidad cultural de la ciudad a través de una \nexperiencia moderna, gamificada y accesible. \n2. Descripción General del Proyecto \n2.1 Descripción general \nEl proyecto consiste en una plataforma web accesible desde cualquier dispositivo \nmóvil. \nContará con dos modalidades: \n● Modo visitante: libre acceso para explorar lugares, leer información y \ndescubrir circuitos turísticos. \n \n● Modo usuario (autenticado con Google): registro de visitas, logros, desafíos, \nrankings y recompensas. \n \nLa app solicitará permiso de ubicación únicamente al validar un logro, \nasegurando que el usuario se encuentre efectivamente en el punto visitado. \n \n \n \nCiudad Selfie - Propuesta de Desarrollo                                  \n1\n \n\n \n \n2.2 Dinámica de uso \nCada punto turístico contará con un tótem selfie con código QR. \nEl proceso de experiencia es el siguiente: \n1. El visitante llega al punto, posiciona su dispositivo en el soporte del tótem y \nse toma una selfie \n2. Escanea el QR del tótem e ingresa a la plataforma. \n \n3. La app válida su ubicación y le otorga puntos base. \n \n4. Se desbloquea una trivia cultural del lugar visitado. \n \n5. Si el usuario sube su selfie en el punto, gana puntos adicionales. \n \n6. La app le propone un challenge que incluye: \n \n○ Un punto turístico (tótem). \n \n○ Un local gastronómico cercano. \n \n○ Un emprendimiento o tienda local. \n \n7. Al completar el circuito, obtiene un logro, que va a poder ver en su \npasaporte digital,  y puntos, que va a poder canjear por beneficios en los \ncomercios asociados. \n \n \n2.3 Personalización \nLa plataforma seleccionará los locales adheridos de cada circuito en función de: \n● Preferencias y comportamiento previo del usuario. \n \n● Calificaciones de otros visitantes. \n \n● Balance de afluencia para evitar concentraciones de público. \n \n \n \n \nCiudad Selfie - Propuesta de Desarrollo                                  \n2\n \n\n \n \n2.4 Diseño y estructura \nLa experiencia se centrará en un pasaporte digital, con diseño visual inspirado en \nun pasaporte o álbum de figuritas. \nCada lugar visitado genera un sello visual y se muestra en un mapa interactivo \ncon fotos, ratings y comentarios de otros usuarios. \nEl sistema incluirá: \n● Rachas: visitas consecutivas cada 15 días para multiplicar puntos. \n \n● Niveles de usuario: categorías como Explorador, Aventurero y Leyenda (que \nle van a permitir acceder a beneficios exclusivos). \n \n● Canje de puntos: sección de descuentos y beneficios exclusivos. \n \n2.5 Backoffice administrativo \nHabrá un panel de control para: \n● Alta de locales adheridos y gestión de beneficios. \n \n● Visualización de métricas: usuarios activos, zonas más visitadas, ratings y \ncantidad de canjes. \n \n● Análisis del impacto turístico y comercial del programa. \n \n2.6 Etapas futuras \n● Incorporación de dispositivos NFC en los locales para simular el “sellado” \ndel pasaporte. \n \n● Eventos especiales con mayor puntaje (por ejemplo, “Ruta del Tango”, \n“Sabores Porteños”). \n \n● Challenges patrocinados por marcas con logros personalizados y premios \nexclusivos. \n \n \n \nCiudad Selfie - Propuesta de Desarrollo                                  \n3\n \n\n \n \n3. Beneficios \nPara la Ciudad de Buenos Aires \n● Promueve el turismo interno y la circulación entre barrios. \n \n● Fomenta la difusión cultural y patrimonial. \n \n● Proporciona métricas en tiempo real sobre flujo turístico. \n \n● Refuerza la marca ciudad a través de innovación y participación. \n \nPara los Comercios y Emprendedores \n● Aumento del tráfico de visitantes y potenciales clientes. \n \n● Mayor visibilidad dentro del circuito turístico. \n \n● Posibilidad de promociones segmentadas por zona o tipo de usuario. \n \nPara los Usuarios \n● Experiencia divertida, gamificada y social. \n \n● Descubrimiento de lugares nuevos con recompensas reales. \n \n● Pertenencia a una comunidad activa de exploradores urbanos. \n \n \n \n \n \n \n \nCiudad Selfie - Propuesta de Desarrollo                                  \n4",
  "clarifications": [],
  "answers": {},
  "tickets": [],
  "cost": {
    "tokensIn": 0,
    "tokensOut": 0,
    "usd": 0
  },
  "createdAt": "2025-11-11T16:42:41.198Z",
  "updatedAt": "2025-11-11T16:42:41.198Z"
}