{
  "id": "f5923a1d-8ee3-4e3e-af7d-c70655990c7c",
  "rawText": "Índice \nWeb Administrador 5\n \n1. Autenticación 5\n \n1.1 Iniciar Sesión 5\n \n1.2 Recuperar contraseña 6\n \n2. Home Screen 6\n \n2.1 Gráficos de Reservas 6\n \n3. Mi Cuenta 7\n \n3.1 Visualizar Perfil 7\n \n3.2 Modificar Perfil 8\n \n3.3 Cambiar Contraseña 9\n \n4. Toma de reserva 10\n \n4.1 Ingresar Datos Principales 10\n \n4.2 Ingresar Pasajeros 11\n \n4.3 Ingresar Origen 12\n \n4.4 Ingresar Destino o Múltiples Destinos 13\n \n4.5 Cargar Atributos Extras y Adicionales 14\n \n4.6 Agregar Observaciones Generales 15\n \n4.7 Realizar Cotización 16\n \n4.8 Ver Mapa 17\n \n4.9 Creación de la reserva 18\n \n4.10 Programar Reserva 18\n \n4.11 Envío de correo con confirmación de reserva 19\n \n5. Despacho 20\n \n5.1 Ordenar por columna 20\n \n5.2 Filtrar y buscar por columna 21\n \n5.3 Ver listado de reservas 22\n \n5.4 Configurar Tablero 22\n \n5.5 Asignación de Vehículos 23\n \n5.6 Ver Reserva 24\n \n5.7 Editar Reserva 25\n \n5.8 Agregar Comentarios 26\n \n5.9 Agregar Adicionales 27\n \n5.10 Agregar Reclamos 28\n \n5.11 Agregar, Ver, Modificar y Eliminar Normas Operativas 29\n \n5.12 Agregar, Ver, Modificar y Eliminar Particularidades 29\n \n5.13 Auditoría 30\n \n5.14 Ver Mapa 31\n \n \n\n5.15 Ver Trayecto 32\n \n5.16 Ver Firma 32\n \n5.17 Programar Vuelta 33\n \n5.18 Anular Reserva 34\n \n5.19 Agenda Conductor 35\n \n5.20 Ver Vehículos en Mapa 36\n \n5.21 Gestión de Móviles 36\n \n6. Mensajes 37\n \n6.1 Listar Mensajes 37\n \n6.2 Enviar Nuevo Mensaje 38\n \n7. Reportes 39\n \n7.1 Listar Reservas 39\n \n7.2 Exportar Reporte 40\n \n7.3 Gestionar Reportes 40\n \n8. ABM’s 41\n \n8.1 Agregar, Leer, Actualizar y Borrar Clientes 41\n \n8.2 Agregar, Leer, Actualizar y Borrar Grupo de Clientes 42\n \n8.3 Agregar, Leer, Actualizar y Borrar Usuarios Administradores 43\n \n8.4 Agregar, Leer, Actualizar y Borrar Grupos de Usuarios 44\n \n8.5 Agregar, Leer, Actualizar y Borrar Tipo de Pago 45\n \n8.6 Agregar, Leer, Actualizar y Borrar Comisión 45\n \n8.7 Agregar, Leer, Actualizar y Borrar Tipo de Cambio 46\n \n8.8 Agregar, Leer, Actualizar y Borrar Centro de Costo 47\n \n8.9 Agregar, Leer, Actualizar y Borrar Lista de Precios 48\n \n8.10 Copiar Lista de Precios 49\n \n8.11 Actualizar Precios Masivamente 49\n \n8.12 Agregar Puntos Predefinidos 50\n \n8.13 Agregar, Leer, Actualizar y Borrar Pasajeros 51\n \n8.14 Agregar, Leer, Actualizar y Borrar Conductores y Titulares 52\n \n8.15 Agregar, Leer, Actualizar y Borrar Grupo de Conductores 53\n \n8.16 Agregar, Leer, Actualizar y Borrar Vehículos 54\n \n8.17 Agregar, Leer, Actualizar y Borrar Color de Vehículos 54\n \n8.18 Agregar, Leer, Actualizar y Borrar Dispositivos 55\n \n8.19 Agregar, Leer, Actualizar y Borrar Categorías 56\n \n8.20 Agregar, Leer, Actualizar y Borrar Adicionales 57\n \n8.21 Agregar, Leer, Actualizar y Borrar Atributos 57\n \n9. Liquidaciones 58\n \n9.1 Listar Clientes 58\n \n9.2 Generar Liquidación 59\n \n1 \n\n9.3 Generar Liquidación Masiva 60\n \n9.4 Enviar Archivo de Liquidación 61\n \n9.5 Enviar Archivo de Liquidación Automáticamente 61\n \n9.6 Listar por Vehículo 62\n \n9.7 Marcar Liquidaciones de Conductores como Pagadas 63\n \nClientes 65\n \n1. Autenticación 65\n \n1.1 Iniciar Sesión 65\n \n1.2 Recuperar contraseña 66\n \n1.3 Registro 66\n \n2. Home 67\n \n2.1 Visualizar viajes activos y solicitados 67\n \n2.3 Valorar Viaje 68\n \n2.4 Chat con conductor 69\n \n3. Solicitar Servicio 70\n \n3.1 Solicitar servicio 70\n \n3.2 Lista de servicios 71\n \n3.3 Elegir pasajeros 72\n \n3.4 Crear pasajeros 73\n \n3.5 Obtener ubicación de origen 74\n \n3.6 Historial de ubicación 74\n \n3.7 Carga manual de domicilio de origen 75\n \n3.8 Carga manual de domicilio de destino 76\n \n3.9 Visualización del recorrido 77\n \n3.10 Agregar observaciones 77\n \n3.11 Resumen de viaje 78\n \n4. Mis servicios 79\n \n4.1 Lista de viajes 79\n \n5. Mi cuenta 79\n \n5.1 Actualizar Mis Datos 79\n \n5.2 Agregar, Ver, Modificar y Eliminar Mis Lugares 80\n \n5.3 Cambiar contraseña 81\n \n5.4 Preferencias 82\n \n5.5 Visualizar formas de pago 83\n \n5.6 Seleccionar forma de pago 83\n \n5.7 Accesibilidad 84\n \n5.8 Cerrar sesión 85\n \n6. Realizar viaje 85\n \n6.1 Visualizar estado 85\n \n2 \n\n6.2 Datos del conductor 86\n \n6.3 Contacto a soporte 87\n \n6.3 Detalles finales del viaje 87\n \n6.4 Integración Mercado Pago 88\n \n7. Notificaciones 89\n \n7.1 Visualizar Notificaciones 89\n \n7.2 Notificaciones push 90\n \nConductor 91\n \n1. Autenticación 91\n \n1.1 Iniciar Sesión 91\n \n1.2 Recuperar contraseña 92\n \n1.3 Registro 92\n \n2. Home 93\n \n2.1 Visualizar Viajes a realizar 93\n \n2.2 Agregar Vehículo Activo 94\n \n2.3 Remover Vehículo Activo 95\n \n3. Mensajes 96\n \n3.1 Ver Mensajes 96\n \n3.2 Marcar como leído los Mensajes 96\n \n3.3 Notificaciones push 97\n \n4. Viaje 98\n \n4.1 Aceptar Viaje 98\n \n4.2 Rechazar Viaje 98\n \n4.3 Ver Detalles del Viaje a realizar 99\n \n4.4 Chat con el Pasajero 100\n \n4.5 Iniciar Viaje 100\n \n4.6 Finalizar el Viaje Automáticamente 101\n \n4.7 Finalización del Viaje 102\n \n4.8 Agregar gastos adicionales al Viaje 102\n \n4.9 Seguimiento en tiempo real 103\n \n5. Liquidación 104\n \n5.1 Visualizar Liquidación 104\n \n5.2 Servicios Sin Liquidar 105\n \n5.3 Filtrar y Ordenar Servicios Sin Liquidar 105\n \n5.4 Detalles de liquidación 106\n \n6. Mi cuenta 107\n \n6.1 Actualizar Mis Datos 107\n \n6.2 Agregar fecha e imagen de documentos solicitados 108\n \n6.3 Visualizar Mis Vehículos 109\n \n3 \n\n6.4 Cambiar contraseña 109\n \n6.5 Solicitar Alta de vehículo 110\n \nOtros Requerimientos 111\n \n1 Protección de datos personales 111\n \n2 Migración de datos históricos 112\n \n3 Documentación de usuario 113\n \n4 Despliegue en plataformas digitales 114\n \n5 Respaldo y restauración de datos 115\n \n \n4 \n\nWeb Administrador \n1. Autenticación \n1.1 Iniciar Sesión \n1.1.1 Descripción \nEl usuario administrador debe iniciar sesión para acceder a las \nfuncionalidades de la aplicación. \n1.1.2 Input \nCorreo Electrónico: El identificador único del usuario administrador. \n \nContraseña: La clave secreta asociada al nombre de usuario del \nadministrador. \n1.1.3 Procesamiento \nI. El sistema valida que el correo electrónico y la contraseña \ncorrespondan a un usuario administrador registrado. \nII. Se verifica que la combinación de usuario y contraseña sea \ncorrecta. \nIII. Se comprueba si el usuario tiene permisos de administrador para \nacceder a las funcionalidades de la aplicación. \n1.1.4 Salida \nAcceso concedido: Si las credenciales son correctas y el usuario tiene \nlos permisos necesarios, se le redirige a la página principal del panel de \nadministración. \n \nError de autenticación: Si las credenciales son incorrectas o el usuario \nno tiene permisos de administrador, se muestra un mensaje de error \nindicando el problema y se le solicita que intente nuevamente. \n \n5 \n\n1.2 Recuperar contraseña \n1.2.1 Descripción \nEl usuario administrador puede recuperar la contraseña en caso de \nhaberla olvidado. \n1.2.2 Input \nCorreo electrónico: La dirección de correo electrónico asociada a la \ncuenta del usuario administrador. \n1.2.3 Procesamiento \nI. El sistema verifica que el correo electrónico ingresado esté \nasociado a una cuenta de usuario administrador existente. \nII. Si el correo es válido, el sistema genera un enlace de \nrestablecimiento de contraseña y lo envía al correo electrónico \nasociado. \nIII. El enlace contiene un token único y seguro que permite al \nusuario restablecer su contraseña dentro de un periodo limitado. \n1.2.4 Salida \nCorreo de recuperación enviado: Si el correo electrónico corresponde a \nun usuario administrador, se muestra un mensaje indicando que el \ncorreo de recuperación ha sido enviado. \n2. Home Screen \n2.1 Gráficos de Reservas \n2.1.1 Descripción \nEl usuario administrador puede visualizar en formato de tabla y gráfico \nel total de reservas por categorías (con filtrado por fecha), el total de \nreservas por cierre de operador (con filtrado por fecha) y las reservas \npendientes (con reserva por categoría, cliente, operador y estado). \n2.1.2 Input \nRango de fechas: Período para el cual el usuario desea ver las reservas. \n \n6 \n\nCategoría: Opción para filtrar las reservas según la categoría de \nproductos o servicios. \n \nOperador: Identificación del operador para ver las reservas gestionadas \npor este. \n \nEstado de reserva: Estado actual de las reservas para filtrar (pendientes, \nconfirmadas, canceladas, etc.). \n2.1.3 Procesamiento \nI. El sistema recopila los datos de las reservas de la base de datos \nsegún los filtros aplicados (fecha, categoría, operador y estado). \nII. Se calcula el total de reservas por categoría y por operador dentro \ndel rango de fechas seleccionado. \nIII. Se identifican y cuentan las reservas pendientes agrupándolas \npor categoría, cliente, operador y estado. \nIV. Los datos se procesan para generar representaciones gráficas y \ntabulares. \n2.1.4 Salida \nGráficos y tablas de reservas: Visualización de gráficos y tablas que \nmuestran el total de reservas por categoría y por operador, así como las \nreservas pendientes, con la capacidad de aplicar filtrado por fecha, \ncategoría, operador y estado. Esto permite al administrador tener una \nvista clara del rendimiento y las actividades de reserva en el sistema. \n \n3. Mi Cuenta \n3.1 Visualizar Perfil \n3.1.1 Descripción \nEl usuario puede visualizar sus datos registrados en la cuenta. Estos \nestán conformados por: imagen de perfil, nombre y apellido, y correo \nelectrónico. \n7 \n\n3.1.2 Input \nAcceso al perfil: El usuario autenticado selecciona la opción para \nvisualizar su perfil en la aplicación. \nIdentificador de usuario: El usuario autenticado envía el identificador \npara obtener los datos de su perfil. \n3.1.3 Procesamiento \nI. Al seleccionar la opción de perfil, el sistema recupera los datos del \nusuario desde la base de datos, incluyendo la imagen de perfil, \nnombre, apellido y correo electrónico. \nII. Se asegura que la información esté actualizada y corresponda al \nusuario que ha iniciado sesión. \n3.1.4 Salida \nPágina de perfil: Una página que muestra la imagen de perfil del \nusuario, su nombre y apellido, y correo electrónico. Esta vista permite al \nusuario confirmar y visualizar su información personal registrada en el \nsistema. \n3.2 Modificar Perfil \n3.2.1 Descripción \nEl usuario puede modificar sus datos registrados en la cuenta. Estos \nestán conformados por: imagen de perfil, nombre y apellido, y correo \nelectrónico. \n3.2.2 Input \nDatos modificables: El usuario autenticado selecciona y edita la \ninformación que desea cambiar: imagen de perfil, nombre, apellido, y \ncorreo electrónico. \n3.2.3 Procesamiento \nI. Verificar que el usuario está autenticado y tiene permiso para \nmodificar su perfil. \nII. Recibir los nuevos datos ingresados por el usuario para su perfil. \nIII. Validar los datos modificados (por ejemplo, formato de correo \nelectrónico, restricciones de tamaño para la imagen de perfil). \n8 \n\nIV. Actualizar la información en la base de datos con los nuevos \ndatos proporcionados. \n3.2.4 Salida \nConfirmación de cambios: Mensaje de éxito indicando que los datos \ndel perfil se han actualizado correctamente. \n \nPerfil actualizado: La interfaz muestra la información actualizada del \nperfil del usuario, incluyendo la nueva imagen de perfil, nombre y \napellido, y correo electrónico. \n \n3.3 Cambiar Contraseña \n3.3.1 Descripción \nEl usuario puede cambiar su contraseña de ingreso. Para eso debe \ningresar su contraseña actual, la nueva contraseña y una confirmación \nde la contraseña para evitar errores. \n3.3.2 Input \nContraseña actual: El usuario ingresa su contraseña actual para validar \nsu identidad. \n \nNueva contraseña: El usuario ingresa la nueva contraseña que desea \nestablecer. \n \nConfirmación de la nueva contraseña: El usuario ingresa nuevamente \nla nueva contraseña para confirmar que no hay errores de tipeo. \n3.3.3 Procesamiento \nI. Verificar que el usuario está autenticado y tiene acceso para \ncambiar su contraseña. \nII. Validar que la contraseña actual ingresada por el usuario coincida \ncon la registrada en el sistema. \nIII. Comprobar que la nueva contraseña y su confirmación coinciden \npara evitar errores de tipeo. \nIV. Verificar que la nueva contraseña cumpla con las políticas de \nseguridad (longitud, complejidad, etc.). \n9 \n\nV. Actualizar la contraseña del usuario en la base de datos con la \nnueva contraseña proporcionada. \n3.3.4 Salida \nConfirmación de cambio de contraseña: Mensaje de éxito indicando \nque la contraseña se ha cambiado correctamente. \n4. Toma de reserva \n4.1 Ingresar Datos Principales \n4.1.1 Descripción \nTodo aquel usuario administrador que tenga permisos para realizar la \ntoma, puede ingresar datos para la reserva. \n4.1.2 Input \nPrecondiciones: El operador debe estar autenticado y tener los \npermisos necesarios para realizar reservas. \n \nFuente de la reserva: Cómo se originó la reserva (por ejemplo, en línea, \ntelefónica, por correo electrónico). \n \nCliente: Información del cliente que realiza la reserva. \n \nCategoría: Tipo de servicio reservado. \n \nLista de precios: Precios aplicables según la categoría y condiciones de \nla reserva. \n \nTipo de pago: Método de pago que utilizará el cliente (por ejemplo, \ntarjeta de crédito o por contrato). \n \nUnidad de negocios: El tipo de vehículo requerido. \n \nSolicitante: Identificación de la persona que solicita la reserva. \n \nCentro de costos: Código o identificación del centro de costos dentro \ndel cliente asociado a la reserva. \n10 \n\n4.1.3 Procesamiento \nI. Verificar la autenticación y permisos del operador. \nII. Recopilar y validar los datos ingresados para asegurar que estén \ncompletos y sean correctos. \nIII. Registrar la información de la reserva en el sistema, asociando los \ndatos ingresados con la reserva creada. \nIV. Generar un registro de la reserva que incluya todos los datos \nprincipales ingresados. \n4.1.4 Salida \nInformación registrada: Formulario de la reserva con la información \nque ha sido ingresada en el sistema con éxito, incluyendo un resumen \nde los datos principales de la reserva. \n4.2 Ingresar Pasajeros \n4.2.1 Descripción \nEl operador que realiza la toma, debe ingresar al menos un pasajero que \ntomará el servicio. Se pueden agregar tantos pasajeros como capacidad \ntenga el vehículo de la categoría seleccionada. \n4.2.2 Input \nPrecondiciones: Debe existir una reserva previamente comenzada y el \noperador debe tener los permisos necesarios para ingresar pasajeros en \nla reserva. \n \nInformación del pasajero: Datos personales de cada pasajero, como \nnombre, apellido, número de identificación y contacto. \n \nCantidad de pasajeros: Número de pasajeros que se agregarán a la \nreserva, que no debe exceder la capacidad del vehículo asignado para el \nservicio. \n4.2.3 Procesamiento \nI. Verificar que la reserva esté comenzada y que el operador tenga \nlos permisos para añadir pasajeros. \n11 \n\nII. Validar la información de cada pasajero ingresada y asegurar que \nno se supere la capacidad máxima del vehículo de la categoría \nseleccionada. \nIII. Asociar cada pasajero con la reserva correspondiente. \nIV. Actualizar la reserva con el número total de pasajeros y asegurar \nque todos los pasajeros ingresados estén correctamente \nañadidos. \n4.2.4 Salida \nInformación registrada: Formulario de la reserva con la información de \nlos pasajeros ingresada en el sistema con éxito, incluyendo un resumen \nparcial de los datos de la reserva. \n4.3 Ingresar Origen \n4.3.1 Descripción \nEl operador debe ingresar los datos correspondientes al origen. Esto \nincluye fecha y horario, dirección, puntos predefinidos, datos extras y \nobservaciones. \n4.3.2 Input \nPrecondiciones: Debe existir una reserva comenzada y el operador \ndebe tener los permisos necesarios para ingresar o modificar el origen \nde la reserva. \n \nFecha y horario: Momento específico en que se debe iniciar el servicio. \n \nDirección: Ubicación exacta de donde se originará el servicio. \n \nPuntos predefinidos: Selección de lugares comunes o frecuentes como \npuntos de origen. Suelen coincidir con municipios o localidades. \n \nDatos extras: Información adicional relevante para el origen del servicio. \n \nObservaciones: Notas o comentarios específicos relacionados con el \norigen que puedan ser útiles para la ejecución del servicio. \n12 \n\n4.3.3 Procesamiento \nI. Verificar que la reserva exista y que el operador tenga los \npermisos para modificar los detalles del origen. \nII. Validar los datos ingresados, asegurando que la fecha, horario y \ndirección sean coherentes y completos. La dirección debe \nautocompletarse con la API de Google Maps. \nIII. Registrar en el sistema la información del origen para la reserva, \nincluyendo todos los detalles proporcionados por el operador. \nIV. Actualizar la reserva con la nueva información de origen, \nasegurando que quede correctamente asociada y accesible. \n4.3.4 Salida \nInformación registrada: Formulario de la reserva con el origen \ningresado en el sistema con éxito, incluyendo un resumen parcial de los \ndatos de la reserva. \n4.4 Ingresar Destino o Múltiples Destinos \n4.4.1 Descripción \nEl operador debe ingresar los datos de uno o múltiples destinos. Esto \nincluye fecha y horario, dirección, puntos predefinidos, datos extras y \nobservaciones. \n4.4.2 Input \nPrecondiciones: Debe existir una reserva comenzada y el operador \ndebe tener los permisos necesarios para añadir destinos a la reserva. \n \nFecha y horario: Fecha y hora específicas para cada destino en la \nreserva. \n \nDirección: Ubicación exacta de cada destino. \n \nPuntos predefinidos: Selección de lugares comunes o frecuentes como \ndestinos. \n \nDatos extras: Información adicional relevante para cada destino. \n \n13 \n\nObservaciones: Notas o comentarios específicos relacionados con los \ndestinos que puedan ser útiles para la ejecución del servicio. \n4.4.3 Procesamiento \nI. Confirmar que la reserva exista y que el operador tenga permisos \npara añadir o modificar los destinos. \n \nII. Validar los datos ingresados para cada destino, asegurando que la \nfecha, horario y dirección sean coherentes y completos. La \ndirección debe ser autocompletada con la API de Google Maps. \n \nIII. Registrar en el sistema la información de cada destino para la \nreserva, incluyendo todos los detalles proporcionados. \n \nIV. Actualizar la reserva con los nuevos datos de los destinos, \nasegurando que estén correctamente asociados y organizados. \n4.4.4 Salida \nInformación registrada: Formulario de la reserva con el o los destinos \ningresados en el sistema con éxito, incluyendo un resumen parcial de \nlos datos de la reserva. \n4.5 Cargar Atributos Extras y Adicionales \n4.5.1 Descripción \nEl operador puede ingresar atributos extras y adicionales en el servicio, \njunto a la cantidad de los mismos. \n4.5.2 Input \nPrecondiciones: Debe existir una reserva activa y el operador debe \ntener los permisos necesarios para añadir atributos extras y adicionales. \n \nAtributos extras y adicionales: Lista de elementos o servicios \nadicionales que se pueden incluir en la reserva. \n \nCantidad de cada atributo: Número de veces que cada elemento o \nservicio adicional se añade a la reserva. \n \n14 \n\n4.5.3 Procesamiento \nI. Verificar que exista una reserva comenzada y que el operador \ntenga permisos para modificarla. \n \nII. Validar la información y la disponibilidad de los atributos extras y \nadicionales solicitados. \n \nIII. Añadir los atributos extras y adicionales a la reserva, incluyendo la \ncantidad especificada de cada uno. \n \nIV. Actualizar la reserva para reflejar la inclusión de estos atributos \nadicionales, ajustando el costo total si es necesario. \n4.5.4 Salida \nInformación registrada: Formulario de la reserva con el o los atributos \nadicionales ingresados en el sistema con éxito, incluyendo un resumen \nparcial de los datos de la reserva. \n4.6 Agregar Observaciones Generales \n4.6.1 Descripción \nEl operador puede ingresar observaciones generales relacionadas al \nservicio. \n4.6.2 Input \nPrecondiciones: Debe existir una reserva activa y el operador debe \ntener los permisos necesarios para añadir observaciones. \n \nObservaciones generales: Comentarios o notas adicionales que el \noperador quiere registrar relacionados con la reserva o el servicio en \ngeneral. \n4.6.3 Procesamiento \nI. Verificar que la reserva esté comenzada y que el operador tenga \nlos permisos para añadir observaciones. \n \nII. Registrar las observaciones generales en el sistema, asociándolas \ncon la reserva correspondiente. \n \n15 \n\nIII. Asegurar que las observaciones sean accesibles y visibles para \notros usuarios o departamentos que gestionen o ejecuten el \nservicio. \n4.6.4 Salida \nInformación registrada: Formulario de la reserva con las observaciones \ningresadas en el sistema con éxito, incluyendo un resumen parcial de \nlos datos de la reserva. \n4.7 Realizar Cotización \n4.7.1 Descripción \nEl operador debe realizar la cotización del servicio. Esto puede realizarse \nde manera manual o automática, por kilómetros o zonas predefinidas. \n4.7.2 Input \nPrecondiciones: Debe existir una reserva activa y el operador debe \ntener los permisos necesarios para realizar cotizaciones. \n \nMétodo de cotización: Seleccionar entre una cotización manual o \nautomática. \n \nDatos para la cotización: Incluir kilómetros a recorrer, zonas \npredefinidas, categoría del servicio, y cualquier atributo extra o \nadicional. \n4.7.3 Procesamiento \nI. Verificar que la reserva exista y validar los permisos del operador \npara realizar la cotización. \n \nII. Dependiendo del método seleccionado (manual o automático), \ncalcular el costo del servicio basándose en los parámetros \ningresados, como kilómetros, zonas, categoría, y atributos extras. \n \nIII. En el caso de la cotización automática, utilizar algoritmos o tablas \nde precios predefinidos (a definir con el cliente) para determinar \nel costo. \n \nIV. Para la cotización manual, el operador deberá introducir el costo \nbasándose en su criterio y las políticas de la empresa. \n16 \n\n4.7.4 Salida \nCotización del servicio: Presentar un desglose detallado de la \ncotización, incluyendo todos los componentes del costo y el total a \npagar. Confirmación de que la cotización ha sido calculada y registrada \ncorrectamente en el sistema. \n4.8 Ver Mapa \n4.8.1 Descripción \nEl operador puede visualizar el mapa, el cual contiene los puntos de \norígenes y destinos, junto a las rutas sugeridas. Asimismo, se puede \nrealizar acciones como acercar, alejar y desplazar la vista. \n4.8.2 Input \nPrecondiciones: Debe existir una reserva activa con origen y destino \ndefinidos. \n \nAcción de visualización: El operador selecciona la opción para ver el \nmapa dentro de la interfaz de la reserva. \n4.8.3 Procesamiento \nI. Verificar que existan datos de origen y destino válidos en la \nreserva. \n \nII. Utilizar sistemas de mapeo geográfico para calcular y mostrar la \nruta entre el punto de origen y el destino o los múltiples destinos. \n \nIII. Generar un mapa interactivo que muestre la ubicación de los \npuntos de origen y destino, así como las rutas sugeridas. \n4.8.4 Salida \nMapa interactivo: Un mapa que muestra los puntos de origen y destino, \ncon rutas sugeridas que pueden ser visualizadas por el operador. Esta \nvisualización ayuda a entender la geografía del servicio y a planificar \nmejor el itinerario. \n17 \n\n4.9 Creación de la reserva \n4.9.1 Descripción \nEste proceso implica el registro de una nueva reserva en el sistema, \ndonde se captura toda la información cargada en el formulario. \n4.9.2 Input \nPrecondiciones: Acceso al sistema de reservas. \n \nDatos necesarios para la reserva: Fecha y hora del servicio, información \nde origen y destino, tipo de vehículo o categoría, número de pasajeros, \ninformación de contacto del cliente y atributos adicionales. \n4.9.3 Procesamiento \nI. Capturar y validar la información proporcionada por el usuario. \nII. Registrar la nueva reserva en el sistema. \n4.9.4 Salida \nConfirmación de Reserva: Un registro completo de la reserva con \nidentificador único en el sistema, que incluye todos los detalles del \nservicio programado y una confirmación que se puede enviar al cliente, \nasegurando que todos los requisitos se han capturado y que el servicio \nestá correctamente planificado y reservado. \n4.10 Programar Reserva \n4.10.1 Descripción \nEl operador puede repetir la reserva en un lapso de tiempo \ndeterminado y conlleva la generación de un nuevo código de reserva \npara cada viaje. \n4.10.2 Input \nPrecondiciones: Debe existir una reserva activa que se desea \nprogramar para repetición.  \n \nFrecuencia de repetición: Cómo de a menudo se repetirá la reserva \n(diaria, semanal, mensual, etc.). \n \n18 \n\nDuración del período de repetición: Hasta cuándo se repetirá la \nreserva (fecha de finalización o repeticiones). \n \nDetalles de la reserva: Confirmar o modificar los detalles de la reserva \npara las repeticiones, incluyendo origen, destino, hora, fecha, y cualquier \natributo extra o adicional. \n4.10.3 Procesamiento \nI. Confirmar que la reserva original sea correcta para la \nprogramación de repeticiones. \nII. Validar la frecuencia y la duración del período de repetición \ningresados por el operador. \nIII. Generar nuevas reservas en el sistema para cada fecha de \nrepetición, asignando un nuevo código de reserva a cada una. \nIV. Asegurar que los detalles de cada reserva programada sean \nconsistentes con la reserva original o modificados según lo \nespecificado. \n4.10.4 Salida \nReservas programadas: Confirmación de que las repeticiones de la \nreserva se han programado correctamente, incluyendo un listado de las \nfechas y códigos de reserva generados para cada viaje programado. \n4.11 Envío de correo con confirmación de reserva \n4.11.1 Descripción \nUna vez realizada la reserva, se envía automáticamente una \nconfirmación con información de la misma al operador, el o los \npasajeros y otros interesados, definidos previamente. \n4.11.2 Input \nPrecondiciones: La reserva debe haber sido completada y confirmada \nen el sistema. \n \nDirecciones de correo electrónico: Correos del operador, pasajeros y \notros interesados. \n \n19 \n\nInformación de la reserva: Detalles completos de la reserva, incluyendo \nfecha, hora, origen, destino, pasajeros, y cualquier detalle relevante. \n4.11.3 Procesamiento \nI. Verificar que la reserva esté finalizada y confirmada. \nII. Compilar la información de la reserva en un formato adecuado \npara el correo electrónico. \nIII. Generar el correo de confirmación incluyendo todos los detalles \nde la reserva. \nIV. Enviar el correo electrónico a las direcciones previamente \ndefinidas, asegurando que cada parte reciba la confirmación. \n4.11.4 Salida \nCorreo de confirmación enviado: Mensaje de éxito que indica que el \ncorreo con la confirmación de la reserva ha sido enviado a todas las \npartes relevantes, asegurando que todos los involucrados estén \ninformados sobre los detalles de la reserva. \n5. Despacho \n5.1 Ordenar por columna \n5.1.1 Descripción \nEn la tabla de Despacho, donde se encuentran todas las reservas, el \nusuario puede ordenar la lista de reservas según diferentes columnas \ncomo fecha, estado, operador, cliente, para facilitar la búsqueda y el \nanálisis de la información. \n5.1.2 Input \nPrecondiciones: La tabla de Despacho debe estar accesible y contener \nreservas. \n \nColumna seleccionada para ordenar: El usuario elige la columna por la \ncual desea ordenar las reservas. \n5.1.3 Procesamiento \nI. Detectar la selección de la columna por parte del usuario. \n20 \n\n \nII. Ordenar las entradas de la tabla de Despacho basándose en la \ncolumna seleccionada, pudiendo ser en orden ascendente o \ndescendente según el criterio establecido. \n5.1.4 Salida \nTabla de Despacho ordenada: La tabla se actualiza mostrando las \nreservas ordenadas según la columna seleccionada, facilitando al \nusuario la visualización y gestión de las reservas de acuerdo a su criterio \nde ordenamiento. \n5.2 Filtrar y buscar por columna \n5.2.1 Descripción \nLos usuarios pueden filtrar y buscar reservas en la tabla de Despacho \npor diferentes columnas, como fecha, estado, operador, cliente, para \nlocalizar rápidamente la información específica. \n5.2.2 Input \nPrecondiciones: Debe haber reservas listadas en la tabla de Despacho. \n \nCriterios de filtro y búsqueda: El usuario define los parámetros \nespecíficos en las columnas (por ejemplo, rango de fechas, estado de la \nreserva, cliente). \n5.2.3 Procesamiento \nI. Recibir los criterios de filtro y búsqueda especificados por el \nusuario. \nII. Aplicar los filtros a la tabla de Despacho, mostrando solo las \nreservas que coinciden con los criterios establecidos. \nIII. Si se realiza una búsqueda, el sistema debe buscar en la tabla las \ncoincidencias exactas o parciales con los términos de búsqueda \ningresados. \n5.2.4 Salida \nTabla de Despacho filtrada y/o buscada: Muestra los resultados que \ncoinciden con los criterios de filtro y búsqueda aplicados, permitiendo al \nusuario acceder rápidamente a las reservas específicas de interés. \n21 \n\n5.3 Ver listado de reservas \n5.3.1 Descripción \nPermite al usuario visualizar las reservas de ayer, hoy, mañana y todas. \nEsta funcionalidad se utiliza para revisar el estado actual de las reservas \ny planificar las actividades relacionadas con ellas. \n5.3.2 Input \nPrecondiciones: La tabla de Despacho debe estar accesible y contener \nlas reservas. \n \nSelección de fecha: El usuario elige entre ver las reservas de ayer, hoy o \nmañana. \n5.3.3 Procesamiento \nI. Determinar la fecha actual y calcular las fechas para ayer, hoy y \nmañana. También se puede seleccionar para visualizar todas. \nII. Filtrar las reservas en la tabla de Despacho basándose en la \nselección de fecha del usuario. \nIII. Extraer y mostrar la información relevante de las reservas para el \ndía seleccionado, incluyendo el estado de cada reserva. \n5.3.4 Salida \nListado de reservas para el período seleccionado: Muestra las reservas \ncorrespondientes a la fecha seleccionada (ayer, hoy o mañana), \npermitiendo al usuario visualizar y evaluar el estado actual de las \nreservas y realizar cualquier acción de seguimiento necesaria. \n5.4 Configurar Tablero \n5.4.1 Descripción \nEsta funcionalidad permite a los usuarios personalizar su tablero, \najustando la visualización de la lista de registros según sus necesidades. \nLos usuarios pueden determinar la cantidad de registros a mostrar, \naplicar filtros por fecha, ordenar los datos, mostrar más o menos \ndetalles, seleccionar las categorías y estados visibles, así como \npersonalizar las columnas que desean ver. \n22 \n\n5.4.2 Input \nPrecondiciones: Acceso al tablero de control del sistema. \n \nConfiguración deseada: Cantidad de registros por página, filtros de \nfecha, criterios de ordenación, detalles a mostrar, categorías y estados a \nvisualizar, y selección de columnas. \n5.4.3 Procesamiento \nI. Recoger los parámetros de configuración especificados por el \nusuario. \nII. Aplicar los ajustes al tablero para personalizar la visualización de \nacuerdo con las preferencias del usuario, incluyendo la filtración, \nordenación y selección de columnas y categorías. \n5.4.4 Salida \nTablero Personalizado: Un tablero configurado según las \nespecificaciones del usuario, mostrando la información de manera \norganizada y adaptada a sus necesidades, mejorando la experiencia de \nusuario y la eficiencia en el análisis de los datos. \n5.5 Asignación de Vehículos \n5.6.1 Descripción \nLa asignación de vehículos es un proceso manual que implica \nseleccionar el vehículo y conductor más adecuados para una reserva \nespecífica. Se presenta una lista de conductores potenciales con un \nporcentaje que indica cuán bien cumplen con los requisitos de la \nreserva, basados en disponibilidad, adicionales seleccionados, \ncalificación y experiencias pasadas con los pasajeros. Este proceso \nasegura que las reservas se manejen de manera eficiente y se asignen a \nlos conductores más calificados. Los vehículos se pueden asignar a \nmodo de borrador, el cual no realiza ninguna acción para el conductor. \n5.5.2 Input \nPrecondiciones: Acceso al sistema de gestión de reservas. \n \nDatos necesarios: Información sobre las reservas activas, disponibilidad \nde vehículos, y calificaciones de conductores. \n23 \n\nCriterios de selección: Requisitos específicos de la reserva que deben \ncoincidir con las habilidades y disponibilidad del conductor. \n5.5.3 Procesamiento \nI. Listar conductores disponibles junto con un porcentaje de \ncoincidencia basado en cuánto cumplen con los requisitos de la \nreserva. \n \nII. Proporcionar opciones de filtrado y ordenamiento para facilitar la \nselección del conductor adecuado. \n \nIII. Permitir la asignación manual de vehículos a conductores a \ntravés de un botón de asignación. \n5.5.4 Salida \nAsignación confirmada: Registro de la asignación de vehículos a los \nconductores seleccionados, con detalles completos sobre la reserva y la \nasignación efectuada. Esto garantiza que el vehículo adecuado y el \nconductor estén preparados para cumplir con la reserva en la fecha y \nhora especificadas. \n5.6 Ver Reserva \n5.6.1 Descripción \nAl visualizar una reserva, se pueden consultar detalles como cliente, \noperador, solicitante, pasajeros, y se pueden revisar los puntos de origen \ny destino, la categoría, el ingreso y la zona. Además, es posible reenviar \nlos correos de confirmación y ver las observaciones vinculadas a la \nreserva. \n5.6.2 Input \nPrecondiciones: Acceso a la reserva específica dentro del sistema. \n \nInformación de la reserva: Detalles como cliente, operador, solicitante, \npasajeros, origen y destino, categoría, ingreso, y zona. \n5.6.3 Procesamiento \nI. Recuperar y mostrar la información detallada de la reserva \nseleccionada. \n24 \n\nII. Proporcionar funcionalidades para visualizar cada elemento de la \nreserva, incluyendo los datos de los pasajeros, origen y destino, \ncategoría, ingreso y zona. \nIII. Permitir la opción de reenviar los correos de confirmación si es \nnecesario, para asegurar que todas las partes tengan los detalles \nactualizados de la reserva. \n5.6.4 Salida \nDetalle de la reserva: Muestra completa de toda la información \nrelacionada con la reserva seleccionada, permitiendo al usuario \ncomprender todos los aspectos y detalles específicos de la reserva. \n5.7 Editar Reserva \n5.7.1 Descripción \nLos administradores pueden editar los detalles de una reserva, \nincluyendo cambios en el cliente, operador, solicitante, y pasajeros. \nPueden agregar personas, modificar el día y horario, actualizar o \neliminar puntos de origen y destino, cambiar la cotización, agregar \nnuevos puntos al recorrido, y editar la categoría, el ingreso y la zona. \nAdemás, pueden enviar correos de confirmación y ver o añadir \nobservaciones. \n5.7.2 Input \nPrecondiciones: Acceso a una reserva específica que se desea editar. \n \nDatos modificables: Cliente, operador, solicitante, pasajeros, fecha y \nhora, origen y destino, cotización, categoría, ingreso, zona, y la \nposibilidad de agregar puntos en el recorrido. \n5.7.3 Procesamiento \nI. Recuperar los detalles actuales de la reserva para edición. \nII. Permitir al administrador realizar cambios en los campos \nseleccionados, como editar los datos del cliente o pasajero, \nmodificar el itinerario, ajustar la cotización, y cambiar otros \naspectos relevantes de la reserva. \nIII. Guardar los cambios en el sistema, asegurando que la reserva se \nactualice correctamente. \n25 \n\nIV. Enviar notificaciones, como correos de confirmación de alta de \nservicio, alertas al conductor y al cliente si se agregan nuevos \npuntos al recorrido. \n5.7.4 Salida \nReserva actualizada: La reserva refleja todos los cambios realizados, \ncon confirmación de que las modificaciones se han guardado \ncorrectamente en el sistema. Se envían las notificaciones necesarias a \ntodas las partes implicadas para informar sobre las actualizaciones en la \nreserva. \n5.8 Agregar Comentarios \n5.8.1 Descripción \nLos administradores pueden agregar comentarios en las reservas, los \ncuales son permanentes y tienen un límite de caracteres. Estos \ncomentarios son exclusivos para uso administrativo y están diseñados \npara proporcionar información adicional o aclaraciones, evitando la \nnecesidad de consultar la sección de Auditoría para cambios u otras \neventualidades. \n5.8.2 Input \nPrecondiciones: El usuario debe tener privilegios de administrador para \nagregar comentarios en la reserva. \n \nComentario: Texto del comentario que el administrador desea agregar \na la reserva, sujeto a un límite de caracteres. \n5.8.3 Procesamiento \nI. Verificar que el usuario tenga los permisos necesarios para \nagregar comentarios. \nII. Asegurar que el comentario no exceda el límite de caracteres \nestablecido. \nIII. Registrar el comentario en el sistema junto con la reserva \ncorrespondiente, asegurando que quede documentado de \nmanera permanente. \n26 \n\n5.8.4 Salida \nComentario agregado: Confirmación de que el comentario ha sido \nañadido exitosamente a la reserva, quedando registrado \npermanentemente para consulta futura por los administradores. \n5.9 Agregar Adicionales \n5.9.1 Descripción \nLos adicionales permiten adjuntar tickets de gastos relacionados con el \nviaje, como peajes, tiempos de espera, estacionamientos y desvíos. \nTanto los conductores como los administradores tienen la capacidad de \ncargar estos gastos desde sus respectivas aplicaciones, y ambos pueden \nconsultarlos posteriormente. \n5.9.2 Input \nPrecondiciones: Debe existir una reserva activa asociada a los gastos \nadicionales. \n \nLista de adicionales: Especificar el tipo de gasto adicional (peajes, \nesperas, estacionamientos, desvíos). \n \nCarga de cantidad: Indicar la cantidad o costo asociado a cada \nadicional. \n \nSubir archivo de validación: Adjuntar documentos o recibos que \nvaliden el gasto realizado. \n5.9.3 Procesamiento \nI. Verificar los permisos del usuario para agregar gastos adicionales \na la reserva. \nII. Registrar en el sistema cada adicional junto con su cantidad o \ncosto especificado. \nIII. Almacenar los archivos de validación subidos en el sistema, \nasociándolos con el gasto adicional correspondiente. \nIV. Actualizar la reserva con la información de los gastos adicionales \nregistrados. \n27 \n\n5.9.4 Salida \nAdicionales registrados: Confirmación de que los gastos adicionales \nhan sido añadidos correctamente a la reserva, con una visualización \ndisponible tanto para el conductor como para el administrador. \n5.10 Agregar Reclamos \n5.10.1 Descripción \nLos reclamos son registros de las quejas o problemas informados por los \nclientes. Estos pueden ser documentados y descargados en un reporte \nposteriormente. Los usuarios encargados de la calidad tienen la \ncapacidad de ingresar estos reclamos en el sistema mediante texto \nlibre. \n5.10.2 Input \nPrecondiciones: El usuario debe tener permisos para registrar reclamos \nen el sistema. \n \nTexto del reclamo: Descripción detallada del reclamo proporcionado \npor el cliente. \n5.10.3 Procesamiento \nI. Verificar que el usuario tenga los permisos necesarios para \ningresar reclamos. \n \nII. Capturar y registrar la descripción del reclamo en el sistema. \n \nIII. Asociar el reclamo con la reserva o servicio correspondiente para \nfuturas referencias y acciones de seguimiento. \n5.10.4 Salida \nReclamo registrado: Confirmación de que el reclamo ha sido ingresado \ncorrectamente en el sistema, quedando disponible para consulta y para \nincluir en reportes de calidad y servicio al cliente. \n \n28 \n\n5.11 Agregar, Ver, Modificar y Eliminar Normas Operativas \n5.11.1 Descripción \nLas normas operativas reflejan los acuerdos establecidos en el contrato \ncon el cliente. Estas normas pueden ser visualizadas, agregadas, \nactualizadas o eliminadas en el sistema, permitiendo a los \nadministradores gestionar los términos operativos acordados con los \nclientes. \n5.11.2 Input \nPrecondiciones: El usuario debe tener permisos para gestionar las \nnormas operativas. \n \nNormas operativas: Texto que detalla los acuerdos operativos con el \ncliente. \n5.11.3 Procesamiento \nI. Verificar los permisos del usuario para añadir o modificar las \nnormas operativas. \nII. Registrar nuevas normas operativas en el sistema o actualizar las \nexistentes según sea necesario. \nIII. Asociar las normas operativas con el contrato o cliente \ncorrespondiente dentro del sistema. \n5.11.4 Salida \nNormas operativas actualizadas: Confirmación de que las normas \noperativas han sido agregadas o modificadas correctamente, reflejando \nlos acuerdos contractuales con el cliente en el sistema. \n5.12 Agregar, Ver, Modificar y Eliminar Particularidades \n5.12.1 Descripción \nLas particularidades se refieren a requerimientos o preferencias \nespecíficas relacionadas con el pasajero. Estos detalles se pueden \nagregar, visualizar, modificar y eliminar en el sistema, permitiendo una \npersonalización detallada del servicio para el cliente. \n29 \n\n5.12.2 Input \nPrecondiciones: El usuario debe tener permisos para gestionar las \nparticularidades de las reservas. \n \nDetalle de la particularidad: Descripción específica de la preferencia o \nrequerimiento del pasajero. \n5.12.3 Procesamiento \nI. Verificar los permisos del usuario para añadir o modificar \nparticularidades. \nII. Capturar y registrar la particularidad en el sistema asociada a la \nreserva o pasajero correspondiente. \nIII. Permitir la gestión de estas particularidades, incluyendo su \nadición, visualización o eliminación. \n5.12.4 Salida \nParticularidades registradas: Confirmación de que las particularidades \nhan sido correctamente agregadas o actualizadas en la reserva, \nreflejando los requerimientos específicos del pasajero. \n5.13 Auditoría \n5.13.1 Descripción \nLa auditoría es un registro completo de todos los cambios realizados en \nel sistema, que proporciona una trazabilidad detallada y no se puede \neditar. Incluye funcionalidades para la búsqueda y el filtrado de \nentradas, permitiendo a los usuarios revisar las acciones específicas \nrealizadas. \n5.13.2 Input \nPrecondiciones: Acceso al sistema de auditoría, generalmente \nrestringido a usuarios con permisos administrativos. \n \nCriterios de búsqueda y filtrado: Parámetros como fecha, tipo de \ncambio, usuario que realizó el cambio. \n30 \n\n5.13.3 Procesamiento \nI. Recuperar el registro completo de cambios del sistema \nbasándose en los criterios de búsqueda y filtrado especificados. \nII. Organizar y presentar los datos de auditoría de manera coherente \ny legible, manteniendo la integridad del registro. \n5.13.4 Salida \nRegistro de auditoría: Visualización de las entradas de auditoría que \ncoinciden con los criterios de búsqueda y filtrado, proporcionando un \nhistorial detallado de las acciones y cambios realizados en el sistema. \n5.14 Ver Mapa \n5.14.1 Descripción \nLa función de mapa permite visualizar los puntos de origen y destino o \ndestinos de las reservas en un mapa. Esta herramienta ayuda a tener \nuna visión geográfica clara de los trayectos planificados para las \nreservas. \n5.14.2 Input \nPrecondiciones: Debe existir una reserva con origen y destino \ndefinidos. \n \nSelección de reserva: El usuario elige una reserva para visualizar en el \nmapa. \n5.14.3 Procesamiento \nI. Recuperar las ubicaciones de origen y destino de la reserva \nseleccionada. \nII. Generar un mapa que muestre las ubicaciones, trazando la ruta \nprevista entre ellas. Este debe utilizar mapas de Google Maps. \n5.14.4 Salida \nMapa con rutas: Visualización del mapa que muestra los puntos de \norigen y destino junto con la ruta sugerida, proporcionando una \nherramienta útil para la planificación y gestión de las reservas. \n31 \n\n5.15 Ver Trayecto \n5.15.1 Descripción \nEsta función permite a los usuarios visualizar el trayecto completo de un \nvehículo específico, incluyendo la velocidad promedio en distintas \npartes del recorrido. Esta visualización ayuda a monitorear y analizar la \neficiencia del viaje, las prácticas de conducción y la adherencia a los \nhorarios estimados. \n5.15.2 Input \nPrecondiciones: Debe existir un viaje realizado en el sistema para el \nvehículo en cuestión. \n5.15.3 Procesamiento \nI. Recuperar datos del recorrido del vehículo desde el sistema, \nincluyendo tiempos de inicio y fin, puntos de ruta, y velocidades \nregistradas. \n \nII. Calcular la velocidad promedio en diferentes segmentos del \ntrayecto. \n \nIII. Generar un mapa o representación gráfica del trayecto que \nmuestre las velocidades promedio y el trayecto recorrido. \n5.15.4 Salida \nVisualización del Trayecto: Un mapa o gráfico detallado del trayecto \ncompleto del vehículo, incluyendo indicadores de velocidad promedio \nen distintas partes del recorrido. Esta información permite a los usuarios \nevaluar la eficiencia del viaje y la conformidad con los estándares de \nconducción y seguridad. \n5.16 Ver Firma \n5.16.1 Descripción \nLa firma es un consentimiento del pasajero que valida la correcta \nprestación del servicio y la aceptación de los costos asociados. Esta \nfirma se puede recoger a través de la aplicación del cliente o del \nconductor y luego visualizarse en el sistema para confirmar el acuerdo. \n32 \n\n5.16.2 Input \nPrecondiciones: Debe existir una reserva o servicio completado que \nrequiera validación. \n \nAcción de carga de firma: El pasajero o el conductor firma en la \naplicación correspondiente como validación del servicio y costos. \n5.16.3 Procesamiento \nI. Capturar y almacenar la firma digital en el sistema una vez que se \nrealiza a través de la aplicación. \n \nII. Asociar la firma con la reserva o servicio correspondiente para \nasegurar la trazabilidad y validación. \n5.16.4 Salida \nVisualización de la firma: Confirmación de que la firma ha sido cargada \ny almacenada correctamente en el sistema, proporcionando un registro \nvisual de la validación del pasajero para el servicio y los costos asociados. \n5.17 Programar Vuelta \n5.17.1 Descripción \nEsta función permite programar el viaje facilitando la planificación y \ngestión de la reserva de acuerdo con las necesidades del pasajero. \n5.17.2 Input \nPrecondiciones: Debe estar creando o editando una reserva. \n \nSelección de tipo de viaje: El usuario selecciona la reserva para la \nvuelta. \n5.17.3 Procesamiento \nI. Capturar la selección del usuario respecto al tipo de viaje. \nII. Generar una nueva reserva en el sistema para el viaje de vuelta, \nasignando un nuevo código de reserva a cada una. \nIII. Asegurar que los detalles de cada reserva programada sean \nconsistentes con la reserva original o modificados según lo \nespecificado. \n33 \n\n5.17.4 Salida \nReservas programadas: Confirmación de que las vuelta de la reserva se \nhan programado correctamente, y códigos de reserva generados para \ncada viaje programado. \n \n5.18 Anular Reserva \n5.18.1 Descripción \nEsta función permite anular una reserva existente. Al anular, se presenta \nun modal que requiere la indicación del motivo de la anulación, \nintroducido en un campo de texto libre. Posteriormente, es posible \nrevisar y, si se requiere, reactivar las reservas anuladas. \n5.18.2 Input \nPrecondiciones: Debe existir una reserva seleccionada para la \nanulación. \n \nMotivo de la anulación: El usuario debe ingresar en un campo de texto \nlibre el motivo por el cual la reserva se está anulando. \n5.18.3 Procesamiento \nI. Verificar que el usuario tenga los permisos necesarios para anular \nla reserva. \nII. Presentar un modal para que el usuario confirme la anulación e \ningrese el motivo. \nIII. Capturar y registrar el motivo de la anulación en el sistema. \nIV. Marcar la reserva como anulada, guardando el registro \ncorrespondiente. \n5.18.4 Salida \nReserva anulada: Confirmación de que la reserva ha sido anulada con \néxito, con el motivo de la anulación registrado en el sistema. Esto \npermite un seguimiento adecuado y la posibilidad de revisar o reactivar \nla reserva en el futuro si es necesario. \nNotificación: Una notificación será enviada al usuario y/o al conductor \n(en caso de que ya esté asignado) La notificación incluirá detalles como \nel identificador de la reserva, la fecha y hora de la anulación. Esto \n34 \n\nasegura que todas las partes relevantes estén informadas de los \ncambios y puedan tomar acciones correspondientes si es necesario. \n \n5.19 Agenda Conductor \n5.19.1 Descripción \nLa Agenda del Conductor es una herramienta que muestra y permite la \nactualización de las actividades del conductor, tales como vacaciones, \ndías libres y turnos de taller. Esta agenda se presenta en forma de tabla, \nincluyendo detalles como código, descripción (nombre del conductor), \nobservaciones y acciones, donde se puede escribir o actualizar \nobservaciones. \n5.19.2 Input \nPrecondiciones: El usuario debe tener acceso a la agenda del \nconductor. \n \nDatos a visualizar o modificar: Código, nombre del conductor y \nselección de observaciones que corresponde a la agenda. Dichas \nopciones de observaciones son limitadas. \n5.19.3 Procesamiento \nI. Recuperar los datos actuales de la agenda del conductor del \nsistema. \nII. Mostrar la información en una tabla donde los usuarios pueden \nver y editar las observaciones. \nIII. Permitir a los usuarios añadir nuevas observaciones o modificar \nlas existentes para cada entrada correspondiente a un conductor. \n5.19.4 Salida \nAgenda actualizada del conductor: La tabla muestra los datos \nactualizados con las observaciones modificadas o añadidas, \npermitiendo un seguimiento eficaz de las actividades y disponibilidad \nde los conductores. \n35 \n\n5.20 Ver Vehículos en Mapa \n5.20.1 Descripción \nEsta funcionalidad permite visualizar en un mapa la ubicación en \ntiempo real de los conductores de la flota, mediante GPS del celular por \nla aplicación móvil. Los usuarios pueden filtrar la visualización por \nequipo y por estado (libre, en servicio, equipo no logueado), con los \nvehículos activos marcados en verde y los inactivos en rojo. \n5.20.2 Input \nPrecondiciones: Debe existir una interfaz de mapa interactivo (zoom y \ndesplazamiento) con acceso a los datos de ubicación de los vehículos. \n \nFiltros de búsqueda: Equipo específico y estado del vehículo (libre, en \nservicio, equipo no logueado). \n5.20.3 Procesamiento \nI. Recuperar los datos de ubicación de los vehículos desde el \nsistema de seguimiento en tiempo real. \nII. Aplicar los filtros especificados para seleccionar vehículos \nespecíficos o estados de vehículos. \nIII. Mostrar en el mapa las ubicaciones de los vehículos filtrados, \nutilizando colores diferentes para indicar su estado actual. \n5.20.4 Salida \nMapa con ubicaciones de vehículos: Visualización en tiempo real de la \nubicación de los vehículos, con marcas en verde para los autos activos y \nen rojo para los inactivos, facilitando la gestión y coordinación de la flota. \n5.21 Gestión de Móviles \n5.21.1 Descripción \nLa gestión de equipos permite a los usuarios visualizar y administrar los \ndatos de los vehículos y sus conductores, incluyendo la cantidad de \nservicios asignados en el día, el estado del GPS, el estado operativo del \nequipo y la facturación asociada. Esta función facilita el control de la \nflota, permitiendo acciones como pausar o finalizar la operación de un \nequipo. \n36 \n\n5.21.2 Input \nPrecondiciones: El usuario debe tener acceso al sistema de gestión de \nequipos. \n \nAcciones disponibles: Visualización de la lista de conductores activos, \npausar equipo, finalizar equipo, buscar y ordenar la información por \ncolumna. \n5.21.3 Procesamiento \nI. Recuperar la información actualizada de los vehículos y \nconductores desde el sistema. \nII. Aplicar los filtros y criterios de búsqueda especificados para \nmostrar los datos relevantes. \nIII. Permitir la interacción con el sistema para pausar o finalizar la \nactividad de los equipos según se requiera. \n5.21.4 Salida \nInformación de gestión de equipos: Muestra la lista actualizada de los \nequipos con sus detalles operativos, permitiendo la gestión directa de \nlos estados y la revisión de la información crítica para la operación diaria. \n6. Mensajes \n6.1 Listar Mensajes \n6.1.1 Descripción \nEsta función permite listar los mensajes enviados desde la plataforma \nUniversal a los conductores, mostrando detalles como la fecha de envío, \nfecha de lectura, estado de lectura, remitente, destinatario, asunto y \ncontenido del mensaje. Los usuarios pueden ordenar la lista por \ncolumnas, cargar y navegar a través de un sistema de paginación. \n6.1.2 Input \nAcciones disponibles: Ordenar los mensajes por las columnas \ndeseadas, recargar la lista de mensajes, paginar para ver mensajes \nadicionales. \n37 \n\n6.1.3 Procesamiento \nI. Recuperar los mensajes del sistema, incluyendo todos los detalles \nrelevantes. \nII. Aplicar cualquier criterio de ordenación seleccionado por el \nusuario para la lista de mensajes. \nIII. Proporcionar una funcionalidad de recarga para actualizar la lista \ny un sistema de paginación para navegar a través de los \nmensajes. \n6.1.4 Salida \nLista de mensajes: Una lista detallada y organizada de los mensajes \nenviados, que incluye todas las especificaciones mencionadas y permite \nal usuario gestionar y revisar la comunicación de manera eficiente. \n6.2 Enviar Nuevo Mensaje \n6.2.1 Descripción \nEsta función permite enviar nuevos mensajes desde la plataforma a los \nconductores o clientes. Se ofrece un modal donde se puede seleccionar \nuno o más destinatarios, incluyendo la opción de seleccionar a todos los \nconductores. También se requiere definir el asunto del mensaje y \nescribir el contenido en un campo de texto libre. \n6.2.2 Input \nPrecondiciones: Acceso al sistema de mensajería para enviar mensajes. \n \nDestinatario/s: Seleccionar uno o más conductores/clientes o la opción \nde \"Todos los conductores/clientes\". \n \nAsunto del mensaje: Definir el tema o asunto del mensaje. \n \nCuerpo del mensaje: Escribir el contenido del mensaje en un campo de \ntexto libre. \n6.2.3 Procesamiento \nI. Capturar los detalles proporcionados para el nuevo mensaje, \nincluyendo destinatarios, asunto y contenido. \n38 \n\nII. Enviar el mensaje a través del sistema de mensajería a los \ndestinatarios seleccionados. \nIII. Registrar el envío del mensaje para seguimiento y auditoría. \n6.2.4 Salida \nConfirmación de envío: Mensaje de confirmación indicando que el \nmensaje ha sido enviado exitosamente a los destinatarios \nseleccionados. \n7. Reportes \n7.1 Listar Reservas \n7.1.1 Descripción \nLa función de listar reservas permite visualizar un listado detallado de \ntodas las reservas pasadas y actuales. Los usuarios pueden filtrar este \nlistado por número de reserva, pasajero, fecha, cliente y estado. El \nlistado mostrará información detallada como número de reserva, \ncliente, categoría, estado, fechas, solicitante, pasajero, origen y destino, \nvehículo y conductor asignado, centro de costo, lista de precios, tipo de \npago, observaciones, importes y subtotales. \n7.1.2 Input \nPrecondiciones: Acceso al sistema de reportes de reservas. \n \nCriterios de filtro: Número de reserva, fecha, cliente, estado. \n \nBúsqueda y orden: Posibilidad de buscar y ordenar la información por \ncada columna. \n7.1.3 Procesamiento \nI. Recuperar los datos de las reservas del sistema basándose en los \ncriterios de filtro y búsqueda especificados. \nII. Aplicar los filtros y ordenar los datos según los parámetros \nseleccionados por el usuario. \nIII. Calcular los subtotales y desglosar los importes según las \ncategorías de interés si se requiere. \n39 \n\n7.1.4 Salida \nListado detallado de reservas: Una visualización completa de las \nreservas que cumplen con los criterios de filtro, mostrando todos los \ndetalles relevantes para permitir un análisis exhaustivo y una gestión \nefectiva de las reservas. \n7.2 Exportar Reporte \n7.2.1 Descripción \nEsta función permite a los usuarios exportar los datos de reservas o \ncualquier otro tipo de reporte a un archivo de Excel (XLS), facilitando el \nanálisis fuera del sistema y la integración con otras herramientas de \ngestión o reporte. \n7.2.2 Input \nPrecondiciones: Debe haber un listado de reservas o datos generados \nque el usuario desea exportar. \n \nSelección de datos: El usuario elige los datos o el reporte que desea \nexportar. \n7.2.3 Procesamiento \nI. Preparar los datos seleccionados en un formato compatible con \nExcel. \nII. Generar el archivo XLS con los datos organizados \nadecuadamente para su visualización y análisis en una hoja de \ncálculo. \n7.2.4 Salida \nArchivo XLS exportado: Un archivo de Excel que contiene los datos del \nreporte seleccionado, listo para ser descargado y utilizado por el usuario \npara sus necesidades de análisis o presentación. \n7.3 Gestionar Reportes \n7.3.1 Descripción \nLa gestión de reportes centraliza todos los informes disponibles en el \nsistema, permitiendo al área de Calidad y Seguridad y a otros usuarios \ngestionar aspectos como reclamos y otros datos relevantes. Esta función \n40 \n\nfacilita la descarga de informes en formatos Excel o PDF, adaptándose a \nlas necesidades de análisis y presentación de la información. \n7.3.2 Input \nPrecondiciones: Acceso a la plataforma de gestión de reportes. \n \nSelección de informes: El usuario elige los informes que desea \ngestionar o descargar. \n7.3.3 Procesamiento \nI. Recopilar y organizar los datos de los informes seleccionados. \n \nII. Preparar los informes para su descarga en los formatos de Excel o \nPDF, según la elección del usuario. \n \nIII. Asegurar que los informes incluyan toda la información relevante, \ncomo detalles de reclamos y otros datos de interés. \n7.3.4 Salida \nInformes gestionados y descargables: Los informes seleccionados \nestán disponibles para descargar en los formatos de Excel o PDF, \nproporcionando a los usuarios un acceso eficiente a la información \nconsolidada y detallada para su revisión y análisis. \n8. ABM’s \n8.1 Agregar, Leer, Actualizar y Borrar Clientes \n8.1.1 Descripción \nEsta función permite gestionar la información de los clientes en el \nsistema. Los usuarios pueden agregar nuevos clientes, leer y actualizar \nlos detalles existentes, y borrar clientes si es necesario. La lista de \nclientes muestra el nombre, la razón social y permite realizar acciones \ncomo editar o borrar. Además, se puede filtrar la lista para mostrar \nclientes activos o inactivos. \n8.1.2 Input \nPrecondiciones: Acceso al módulo de gestión de clientes. \n \n41 \n\nDatos de cliente: Para agregar o actualizar incluyen nombre, razón \nsocial y estado (activo o inactivo). \n \nAcción seleccionada: Agregar, leer, actualizar o borrar un cliente. \n8.1.3 Procesamiento \nI. Capturar y validar la información ingresada o modificada para el \ncliente. \nII. Ejecutar la acción correspondiente en la base de datos, ya sea \nagregar un nuevo registro, actualizar uno existente o eliminar un \ncliente. \nIII. Filtrar la lista de clientes según el estado seleccionado para \nvisualizar los clientes activos o inactivos. \n8.1.4 Salida \nLista actualizada de clientes: Refleja los cambios realizados, \nmostrando la información actualizada de los clientes en el sistema, y \npermitiendo una gestión eficiente de los datos de los clientes. \n8.2 Agregar, Leer, Actualizar y Borrar Grupo de Clientes \n8.2.1 Descripción \nEsta función gestiona grupos de clientes dentro del sistema, \npermitiendo a los usuarios crear nuevos grupos, ver y actualizar los \ndetalles de grupos existentes, o eliminar grupos cuando sea necesario. \nLa lista muestra el código, la descripción y las acciones posibles para \ncada grupo, como editar o borrar. \n8.2.2 Input \nPrecondiciones: Acceso al módulo de gestión de grupos de clientes. \n \nDatos del grupo de clientes: Incluye código y descripción del grupo. \n \nAcción seleccionada: Agregar, leer, actualizar o borrar un grupo de \nclientes \n8.2.3 Procesamiento \nI. Recibir y validar la información ingresada o modificada para el \ngrupo de clientes. \n42 \n\nII. Realizar la acción correspondiente en la base de datos: agregar \nun nuevo grupo, actualizar un grupo existente o eliminar un \ngrupo. \nIII. Mantener la lista de grupos de clientes actualizada con los \ncambios realizados. \n8.2.4 Salida \nLista actualizada de grupos de clientes: Muestra los cambios \nrealizados, con la información de los grupos de clientes actualizada en el \nsistema, facilitando la gestión organizada de los clientes en categorías o \nsegmentos específicos. \n8.3 Agregar, Leer, Actualizar y Borrar Usuarios \nAdministradores \n8.3.1 Descripción \nEsta funcionalidad permite la gestión de usuarios dentro del sistema, \nincluyendo la creación de nuevos usuarios con asignación de usuario y \ncontraseña, y la edición o eliminación de usuarios existentes. La lista de \nusuarios muestra nombre, usuario, email, última actividad, última IP, \nperfil y acciones disponibles. Además, se pueden asignar usuarios a \ngrupos para definir roles y agregar roles extras según sea necesario. \n8.3.2 Input \nPrecondiciones: Acceso al módulo de gestión de usuarios. \n \nDatos de usuario: Nombre, usuario, email, contraseña, grupo de \nusuarios y roles extras. \n \nAcción seleccionada: Crear, leer, actualizar o borrar un usuario. \n8.3.3 Procesamiento \nI. Capturar y validar los datos ingresados o modificados del usuario. \nII. Realizar la acción correspondiente: agregar un nuevo usuario, \nactualizar la información de un usuario existente, o eliminar un \nusuario del sistema. \nIII. Asignar el usuario a un grupo específico y agregar roles extras si \nse requiere. \n43 \n\n8.3.4 Salida \nLista actualizada de usuarios: Refleja los cambios realizados, \nmostrando la información actualizada de los usuarios en el sistema, \npermitiendo una administración eficaz de los accesos y roles dentro de \nla plataforma. \n8.4 Agregar, Leer, Actualizar y Borrar Grupos de Usuarios \n8.4.1 Descripción \nEsta función gestiona los grupos de usuarios en el sistema, permitiendo \nla adición o remoción de permisos a grupos específicos. Los grupos de \nusuarios organizan a los usuarios registrados bajo conjuntos que \ncomparten permisos y roles comunes, facilitando la administración de \naccesos y responsabilidades. \n8.4.2 Input \nPrecondiciones: Acceso al módulo de gestión de grupos de usuarios. \n \nDatos del grupo: Información del grupo de usuarios, incluyendo los \npermisos a agregar o borrar. \n8.4.3 Procesamiento \nI. Recibir y validar la información proporcionada para el grupo de \nusuarios. \nII. Realizar la acción correspondiente: crear un nuevo grupo de \nusuarios, actualizar los permisos de un grupo existente, o eliminar \nun grupo. \nIII. Asignar o quitar permisos a los grupos según las necesidades \nadministrativas. \n8.4.4 Salida \nLista actualizada de grupos de usuarios: Muestra los grupos con sus \npermisos actualizados, reflejando los cambios realizados y permitiendo \nuna gestión efectiva de los roles y accesos dentro del sistema. \n44 \n\n8.5 Agregar, Leer, Actualizar y Borrar Tipo de Pago \n8.5.1 Descripción \nEsta funcionalidad permite administrar los tipos de pago en el sistema. \nIncluye una lista con el nombre de cada tipo de pago y acciones \nposibles, como editar o borrar. También permite crear nuevos tipos de \npago, adaptando el sistema a las necesidades financieras y de cobro de \nla organización. \n8.5.2 Input \nPrecondiciones: Acceso al módulo de gestión de tipos de pago. \n \nDatos del tipo de pago: Nombre del tipo de pago y tipo de pago \n(tarjeta, cuenta corriente, efectivo) \n \nAcción seleccionada: Crear, leer, actualizar o borrar un tipo de pago. \n8.5.3 Procesamiento \nI. Recopilar y validar la información ingresada para el tipo de pago. \nII. Realizar la acción correspondiente en la base de datos: agregar \nun nuevo tipo de pago, actualizar la información de un tipo de \npago existente o eliminar un tipo de pago. \n8.5.4 Salida \nLista actualizada de tipos de pago: Refleja los cambios realizados, \nmostrando la información actualizada de los tipos de pago disponibles \nen el sistema, facilitando su gestión y adecuación a las operaciones de \ncobro y transacciones financieras. \n8.6 Agregar, Leer, Actualizar y Borrar Comisión \n8.6.1 Descripción \nEsta función permite gestionar los tipos de comisión en el sistema, \nincluyendo la creación de nuevos tipos de comisión y la edición o \neliminación de los existentes. Se pueden establecer parámetros como el \nvalor porcentaje y valor comisión para cada tipo, facilitando el cálculo y \nla asignación de comisiones en transacciones o servicios. \n45 \n\n8.6.2 Input \nPrecondiciones: Acceso al módulo de gestión de comisiones. \n \nDatos del tipo de comisión: Nombre, valor porcentaje, y valor comisión. \n \nAcción seleccionada: Crear, leer, actualizar o borrar un tipo de \ncomisión. \n8.6.3 Procesamiento \nI. Recibir y validar los datos ingresados o modificados para el tipo \nde comisión. \nII. Realizar la acción correspondiente en la base de datos: añadir un \nnuevo tipo de comisión, actualizar un tipo existente o eliminar un \ntipo de comisión. \n8.6.4 Salida \nLista actualizada de tipos de comisión: Muestra los cambios \nrealizados, proporcionando una vista actualizada de los tipos de \ncomisión disponibles en el sistema, lo cual es esencial para la gestión \nfinanciera y la asignación correcta de comisiones en las transacciones. \n8.7 Agregar, Leer, Actualizar y Borrar Tipo de Cambio \n8.7.1 Descripción \nEsta funcionalidad permite gestionar los tipos de cambio dentro del \nsistema, incluyendo la capacidad de crear nuevos tipos de cambio, \neditar o borrar los existentes. La lista muestra el nombre (tipo de \nmoneda), el valor del tipo de cambio y las acciones posibles, como \neditar o borrar. Es útil para ajustar los valores de conversión monetaria \nsegún las fluctuaciones del mercado. \n8.7.2 Input \nPrecondiciones: Acceso al módulo de gestión de tipos de cambio. \n \nDatos del tipo de cambio: Tipo de moneda y su valor de cambio \ncorrespondiente. \n \nAcción seleccionada: Crear, leer, actualizar o borrar un tipo de cambio. \n46 \n\n8.7.3 Procesamiento \nI. Recopilar y validar los datos ingresados para el tipo de cambio. \nII. Realizar la acción correspondiente en la base de datos: agregar \nun nuevo tipo de cambio, actualizar un tipo existente o eliminar \nun tipo de cambio. \n8.7.4 Salida \nLista actualizada de tipos de cambio: Muestra los cambios efectuados, \nproporcionando una visión actualizada de los tipos de cambio \ndisponibles en el sistema, lo cual es crucial para las operaciones \nfinancieras internacionales y la conversión de monedas. \n8.8 Agregar, Leer, Actualizar y Borrar Centro de Costo \n8.8.1 Descripción \nEsta funcionalidad gestiona los centros de costo dentro de la \norganización. Permite crear nuevos centros de costo, editar o eliminar \nlos existentes. La lista muestra el nombre de cada centro de costo junto \ncon las acciones posibles para editar o borrar. Estos centros de costo son \nfundamentales para el seguimiento de los gastos y la asignación de \ncostos en diferentes áreas o proyectos de la empresa. \n8.8.2 Input \nPrecondiciones: Acceso al módulo de gestión de centros de costo. \n \nDatos del centro de costo: Nombre del centro de costo. \n \nAcción seleccionada: Crear, leer, actualizar o borrar un centro de costo. \n8.8.3 Procesamiento \nRecibir y validar los datos proporcionados para el centro de costo. \n \nRealizar la acción correspondiente en la base de datos: añadir un nuevo \ncentro de costo, actualizar uno existente o eliminar uno. \n8.8.4 Salida \nLista actualizada de centros de costo: Refleja los cambios realizados, \nmostrando la información actualizada de los centros de costo en el \n47 \n\nsistema, lo cual es esencial para la administración financiera y el control \npresupuestario de la empresa. \n8.9 Agregar, Leer, Actualizar y Borrar Lista de Precios \n8.9.1 Descripción \nEsta función permite gestionar la lista de precios en el sistema, \nfacilitando la edición, eliminación o creación de nuevos tipos de lista de \nprecios. La lista incluye el nombre y acciones posibles para cada entrada. \nAl crear un nuevo tipo de lista de precios, se establece el nombre y, si es \nnecesario, el tipo de cambio asociado. \n8.9.2 Input \nPrecondiciones: Acceso al módulo de gestión de listas de precios. \n \nDatos de la lista de precios: Nombre de la lista y, opcionalmente, el tipo \nde cambio asociado. \n \nAcción seleccionada: Crear, leer, actualizar o borrar una lista de precios. \n8.9.3 Procesamiento \nI. Recopilar y validar la información proporcionada para la lista de \nprecios. \nII. Realizar la acción correspondiente en la base de datos: añadir una \nnueva lista de precios, actualizar una lista existente o eliminar \nuna. \n8.9.4 Salida \nLista actualizada de precios: Muestra los cambios efectuados, \nproporcionando una visión actualizada de las listas de precios \ndisponibles en el sistema, esencial para la gestión financiera y la \nfacturación de servicios y productos. \n8.10 Copiar Lista de Precios \n8.10.1 Descripción \nLa funcionalidad de copiar lista de precios permite duplicar la \ninformación de una lista de precios existente a otra, facilitando la \ncreación o actualización de listas de precios en el sistema. Mediante un \n48 \n\nmodal, los usuarios pueden seleccionar la lista de precios de origen y la \nlista de precios de destino para copiar los datos. \n8.10.2 Input \nPrecondiciones: Debe existir al menos una lista de precios de origen y \nla posibilidad de seleccionar o crear una lista de destino. \n \nLista de precios de origen: Seleccionar la lista de precios que se desea \ncopiar. \n \nLista de precios de destino: Seleccionar o crear la lista de precios \ndonde se copiarán los datos. \n8.10.3 Procesamiento \nI. Recopilar los datos de la lista de precios de origen seleccionada. \nII. Copiar estos datos a la lista de precios de destino especificada. \nIII. Actualizar la base de datos para reflejar la nueva configuración de \nla lista de precios de destino. \n8.10.4 Salida \nLista de precios actualizada: La lista de precios de destino se actualiza \ncon la información copiada de la lista de origen, reflejando los cambios y \nasegurando que los precios estén al día según las necesidades del \nnegocio. \n8.11 Actualizar Precios Masivamente \n8.11.1 Descripción \nEl actualizador de precios masivo permite realizar cambios en los \nprecios de una lista de precios seleccionada, aplicando un porcentaje de \najuste a la categoría especificada, ya sea en el precio de venta, costo, o \nambos. Esta herramienta facilita la actualización rápida y eficiente de los \nprecios sin necesidad de ajustar cada entrada manualmente. \n8.11.2 Input \nPrecondiciones: Acceso al modal de actualización de precios masiva. \n \nLista de precios seleccionada: La lista de precios a la que se aplicarán \nlos cambios. \n49 \n\n \nCategoría: La categoría de productos o servicios cuyos precios se \nactualizarán. \n \nPorcentaje: El porcentaje de ajuste a aplicar. \n \nTipo de precio: Especificar si el ajuste se aplica al precio de venta, al \ncosto o a ambos. \n8.11.3 Procesamiento \nI. Seleccionar los datos relevantes de la lista de precios y categoría \nespecificadas. \nII. Calcular el nuevo precio aplicando el porcentaje de ajuste al \nprecio de venta, costo o ambos. \nIII. Actualizar la lista de precios en la base de datos con los nuevos \nvalores calculados. \n8.11.4 Salida \nPrecios actualizados: Confirmación de que los precios en la lista \nseleccionada han sido actualizados masivamente según el porcentaje y \nel tipo de precio especificado, simplificando la gestión de cambios en \nlos precios y manteniendo la competitividad y rentabilidad del negocio. \n8.12 Agregar Puntos Predefinidos \n8.12.1 Descripción \nEsta funcionalidad permite agregar puntos predefinidos en el sistema, \nfacilitando la asignación de ubicaciones comunes o frecuentes en la \nplanificación de servicios o rutas. A través de un formulario, los usuarios \npueden ingresar los parámetros necesarios para crear un nuevo punto \npredefinido. \n8.12.2 Input \nPrecondiciones: Acceso al sistema donde se pueden definir puntos \npredefinidos. \n \nDatos del punto predefinido: Nombre del punto, ubicación geográfica, \ndescripción y cualquier otro parámetro relevante para su identificación y \nuso. \n50 \n\n8.12.3 Procesamiento \nI. Recibir y validar la información proporcionada para el nuevo \npunto predefinido. \nII. Registrar el punto predefinido en el sistema, asegurando que \nesté correctamente mapeado y accesible para su uso futuro en la \nplanificación de rutas o servicios. \n8.12.4 Salida \nPunto predefinido agregado: Confirmación de que el punto \npredefinido ha sido creado con éxito en el sistema, aumentando la \neficiencia en la gestión de rutas y servicios al proporcionar ubicaciones \nrápidamente seleccionables y reconocibles. \n8.13 Agregar, Leer, Actualizar y Borrar Pasajeros \n8.13.1 Descripción \nLa funcionalidad de gestionar pasajeros en el sistema permite visualizar \ny modificar una lista que incluye información como nombre, apellido, \nemail, teléfono, usuario de aplicación y última actividad. Se pueden \naplicar filtros por nombre, número de documento, email, teléfono y \ncliente para facilitar la búsqueda. Además, es posible editar los detalles \nde un pasajero existente o añadir un nuevo pasajero, especificando a \nqué cliente pertenece y otros datos relevantes. \n8.13.2 Input \nPrecondiciones: Acceso a la sección de pasajeros en el sistema. \n \nDatos para filtrar: Nombre, número de documento, email, teléfono, \ncliente. \n \nDatos del pasajero: Para crear o actualizar, incluyen nombre, apellido, \nemail, teléfono, usuario de aplicación, cliente, entre otros. \n8.13.3 Procesamiento \nI. Aplicar los filtros de búsqueda para encontrar pasajeros \nespecíficos dentro de la lista. \nII. Crear un nuevo pasajero o actualizar la información de un \npasajero existente, validando y registrando los datos \nproporcionados. \n51 \n\nIII. Eliminar un pasajero de la lista si es necesario. \n8.13.4 Salida \nLista actualizada de pasajeros: Refleja los cambios realizados, \nmostrando información precisa y actualizada de los pasajeros, con \ncapacidades para filtrar, agregar, editar y eliminar registros, facilitando la \nadministración y el seguimiento de los pasajeros dentro del sistema. \n8.14 Agregar, Leer, Actualizar y Borrar Conductores y Titulares \n8.14.1 Descripción \nLa gestión de conductores y titulares en el sistema incluye una lista con \ncódigo, nombre y acciones posibles, como editar o eliminar registros. Se \npueden crear nuevos conductores o titulares, definiendo parámetros \nespecíficos, incluyendo credenciales y roles. La lista permite filtrar por \nestado (activo o inactivo) y distinguir entre conductores y titulares. \n8.14.2 Input \nPrecondiciones: Acceso a la sección de conductores/titulares en el \nsistema. \n \nDatos del conductor/titular: Nombre, usuario, contraseña, y \nespecificación si es conductor o titular. \n \nFiltro de búsqueda: Estado (activo o inactivo) y tipo (conductor o \ntitular). \n8.14.3 Procesamiento \nI. Aplicar filtros para localizar conductores o titulares específicos. \nII. Crear un nuevo registro de conductor o titular, validando y \nregistrando los datos ingresados. \nIII. Actualizar o eliminar información de conductores o titulares \nexistentes según las necesidades. \n8.14.4 Salida \nLista actualizada de conductores/titulares: Muestra los cambios \nrealizados, proporcionando una vista detallada y actualizada de los \nconductores y titulares, con opciones para gestionar sus datos \neficientemente en el sistema. \n52 \n\n8.15 Agregar, Leer, Actualizar y Borrar Grupo de Conductores \n8.15.1 Descripción \nEsta funcionalidad administra los grupos de conductores dentro de un \nsistema, donde cada grupo está identificado por un código y una \ndescripción. Los usuarios pueden editar o eliminar los grupos existentes, \nasí como crear nuevos grupos de conductores, lo que facilita la \norganización y gestión de los recursos humanos, especialmente en \nempresas de transporte o logística. \n8.15.2 Input \nPrecondiciones: Acceso al módulo de gestión de grupos de \nconductores en el sistema. \n \nDatos necesarios: Para la creación o edición de un grupo se necesita el \ncódigo, la descripción y las acciones específicas a realizar (agregar, \neditar, borrar). \n8.15.3 Procesamiento \nI. Validar y procesar la entrada para asegurar la integridad de los \ndatos. \nII. Ejecutar las acciones seleccionadas como agregar un nuevo \ngrupo, actualizar los detalles de un grupo existente, o eliminar un \ngrupo de conductores de la base de datos. \n8.15.4 Salida \nLista actualizada de grupos de conductores: Refleja los cambios \nrealizados en el sistema, mostrando los grupos de conductores con sus \ncódigos y descripciones actualizados, facilitando así la gestión eficiente \ndel personal de conducción. \n8.16 Agregar, Leer, Actualizar y Borrar Vehículos \n8.16.1 Descripción \nEsta función gestiona la información de los vehículos en el sistema. \nIncluye una lista con detalles como el vehículo, patente y acciones \ndisponibles, permitiendo la edición o eliminación de vehículos y sus \natributos. También se pueden agregar nuevos vehículos, especificando \n53 \n\ncaracterísticas como propiedad, descripción, patente, fechas de \nvencimiento, tipo de combustible, color, categoría, año y seguro. \n8.16.2 Input \nPrecondiciones: Acceso al módulo de gestión de vehículos. \n \nDatos del vehículo: Incluye si es vehículo propio o no, descripción, \npatente, fechas de vencimiento, tipo de combustible, color, categoría, \naño, seguro, entre otros. \n8.16.3 Procesamiento \nI. Validar y procesar la información proporcionada para cada \nvehículo. \nII. Ejecutar las acciones requeridas: agregar un nuevo vehículo al \nsistema, actualizar la información de un vehículo existente o \neliminar un vehículo de la base de datos. \n8.16.4 Salida \nLista actualizada de vehículos: Refleja los cambios realizados, \nmostrando la información actualizada de los vehículos en el sistema, lo \nque facilita la gestión y el mantenimiento de la flota de vehículos. \n8.17 Agregar, Leer, Actualizar y Borrar Color de Vehículos \n8.17.1 Descripción \nLa funcionalidad de gestionar el color de los vehículos permite a los \nusuarios mantener una lista de colores disponibles para clasificar y \norganizar los vehículos. Esta lista incluye la descripción y el color, con \nopciones para editar o eliminar colores existentes, así como la capacidad \nde agregar nuevos colores, definiendo su nombre/descripción y \nseleccionando el color correspondiente. \n8.17.2 Input \nPrecondiciones: Acceso al módulo de gestión de colores de vehículos. \n \nDatos del color: Incluyen la descripción o nombre del color y la \nselección del color. \n54 \n\n8.17.3 Procesamiento \nI. Recopilar y validar los datos ingresados para el color de vehículo. \nII. Realizar las acciones requeridas: agregar un nuevo color al \nsistema, actualizar los detalles de un color existente o eliminar un \ncolor de la base de datos. \n8.17.4 Salida \nLista actualizada de colores de vehículos: Muestra los cambios \nefectuados, proporcionando un registro actualizado de los colores \ndisponibles para los vehículos en el sistema, facilitando la gestión y la \nidentificación visual de la flota. \n8.18 Agregar, Leer, Actualizar y Borrar Dispositivos \n8.18.1 Descripción \nEsta funcionalidad administra los dispositivos utilizados en el sistema, \ncomo pueden ser dispositivos GPS para vehículos, tablets o \nsmartphones para conductores. La lista incluye descripción o nombre, \nnúmero de serie o número de teléfono, IMEI y acciones disponibles para \ncada dispositivo, permitiendo la edición de sus detalles, principalmente \nel número asociado al dispositivo. \n8.18.2 Input \nPrecondiciones: Acceso al módulo de gestión de dispositivos. \n \nDatos del dispositivo: Descripción o nombre, número de serie o \nteléfono, IMEI. \n8.18.3 Procesamiento \nI. Recopilar y validar la información del dispositivo ingresada o \nmodificada. \nII. Realizar la acción correspondiente: actualizar los detalles del \ndispositivo, agregar un nuevo dispositivo o eliminar un dispositivo \nexistente de la base de datos. \n8.18.4 Salida \nLista actualizada de dispositivos: Refleja los cambios realizados, \nmostrando la información actualizada de los dispositivos en el sistema, \n55 \n\nlo que facilita la gestión y el seguimiento de los equipos utilizados en la \noperación de la empresa. \n8.19 Agregar, Leer, Actualizar y Borrar Categorías \n8.19.1 Descripción \nEsta función permite gestionar las categorías dentro del sistema, que \npueden referirse a tipos de servicios, productos o clasificaciones de \nvehículos. La lista de categorías incluye descripción, descripción \nabreviada, color asociado, tolerancia y acciones para la edición o \neliminación. Además, se permite la creación de nuevas categorías. \n8.19.2 Input \nPrecondiciones: Acceso al módulo de gestión de categorías. \n \nDatos de la categoría: Descripción, descripción abreviada, color, \ntolerancia y cualquier otro parámetro relevante. \n8.19.3 Procesamiento \nI. Recopilar y validar la información proporcionada para la \ncategoría. \nII. Realizar las acciones necesarias: agregar una nueva categoría, \nactualizar los detalles de una categoría existente o eliminar una \ncategoría de la base de datos. \n8.19.4 Salida \nLista actualizada de categorías: Muestra los cambios realizados, con \ninformación actualizada de las categorías disponibles en el sistema, \nfacilitando la gestión y clasificación precisa de servicios, productos o \nvehículos. \n8.20 Agregar, Leer, Actualizar y Borrar Adicionales \n8.20.1 Descripción \nLa funcionalidad de \"Adicionales\" permite gestionar servicios o \nproductos adicionales que pueden agregarse a las reservas o servicios \nprincipales. La lista incluye código, nombre, precio y acciones posibles \ncomo editar o eliminar cada adicional. También se ofrece la posibilidad \nde crear nuevos adicionales. \n56 \n\n8.20.2 Input \nPrecondiciones: Acceso al módulo de gestión de adicionales. \n \nDatos del adicional: Código, nombre, precio y cualquier otro detalle \nrelevante. \n8.20.3 Procesamiento \nI. Recoger y validar la información proporcionada para el adicional. \nII. Ejecutar la acción requerida: añadir un nuevo adicional al \nsistema, actualizar los detalles de un adicional existente o \neliminar un adicional de la base de datos. \n8.20.4 Salida \nLista actualizada de adicionales: Muestra los cambios efectuados, con \nla información actualizada de los adicionales disponibles en el sistema, \npermitiendo una gestión efectiva de estos servicios o productos \nadicionales. \n8.21 Agregar, Leer, Actualizar y Borrar Atributos \n8.21.1 Descripción \nEsta funcionalidad permite administrar los atributos en el sistema, los \ncuales pueden ser características o propiedades específicas asociadas al \nconductor, el vehículo o el servicio. La lista de atributos incluye la \ndescripción y las acciones disponibles, como editar o vincular con un \nadicional, y la capacidad de crear nuevos atributos. \n8.21.2 Input \nPrecondiciones: Acceso al módulo de gestión de atributos. \n \nDatos del atributo: Descripción del atributo y, si aplicable, el adicional al \nque se vinculará. \n \nAcción seleccionada: Crear un nuevo atributo, leer los detalles de \natributos existentes, actualizar la información de un atributo o eliminar \nun atributo. \n \n57 \n\n8.21.3 Procesamiento \nI. Validar y procesar la información proporcionada para cada \natributo. \nII. Realizar la acción necesaria, ya sea agregar un nuevo atributo al \nsistema, actualizar los detalles de un atributo existente, vincularlo \ncon un adicional, o eliminar un atributo. \n8.21.4 Salida \nLista actualizada de atributos: Refleja los cambios realizados, \nmostrando los detalles actualizados de los atributos en el sistema, \nfacilitando su gestión y la asignación correcta a servicios, productos o \nadicionales. \n9. Liquidaciones \n9.1 Listar Clientes \n9.1.1 Descripción \nEsta función permite visualizar una lista de clientes con detalles \nfinancieros y administrativos relevantes, como número de liquidación, \nfecha de liquidación, estado de la factura, grupo de clientes, cliente \nindividual, centro de costos, total de servicios, total de adicionales, total \nde gastos de chofer, y el estado general de la cuenta o servicio. Además, \nofrece opciones para filtrar, buscar y ordenar los datos en la lista por \ndiversas columnas. \n9.1.2 Input \nPrecondiciones: Acceso al módulo de listado de clientes en el sistema. \n \nCriterios de filtrado y búsqueda: Número de liquidación, fecha, estado \nde factura, grupo de clientes, entre otros. \n9.1.3 Procesamiento \nI. Aplicar los filtros y términos de búsqueda especificados por el \nusuario para seleccionar la información relevante. \nII. Ordenar los datos según la columna seleccionada para facilitar la \nrevisión y análisis. \n58 \n\n9.1.4 Salida \nLista detallada de clientes: Un resumen completo que incluye la \ninformación financiera y administrativa de los clientes, con herramientas \npara filtrar, buscar y ordenar, facilitando el seguimiento y la gestión de \nlas cuentas y servicios. \n9.2 Generar Liquidación \n9.2.1 Descripción \nEsta funcionalidad se enfoca en generar liquidaciones financieras para \nclientes, integrándose con la aplicación financiera Xubio. Permite \nconsolidar todos los cargos de servicios, adicionales, y cualquier otro \ngasto relacionado en un periodo determinado, resultando en la \ngeneración de una factura o estado de cuenta para el cliente. \n9.2.2 Input \nPrecondiciones: Acceso a los registros de servicios y transacciones \nfinancieras de los clientes que se puedan integrar con Xubio. \n \nDatos necesarios para la liquidación: Identificación del cliente, periodo \nde liquidación, y detalles de los servicios y adicionales consumidos. \n9.2.3 Procesamiento \nI. Recopilar los detalles de todos los servicios y adicionales \nutilizados por el cliente en el periodo especificado. \nII. Calcular el total a liquidar, incluyendo todos los servicios, \nadicionales, y gastos asociados al cliente. \nIII. Generar la liquidación en el sistema y sincronizarla con Xubio \npara la emisión de la factura o estado de cuenta correspondiente. \n9.2.4 Salida \nLiquidación generada para el cliente: Un documento detallado o \nfactura generada en Xubio que refleja el total de cargos acumulados por \nel cliente durante el periodo establecido, listo para su revisión, \naprobación y procesamiento de pago. \n59 \n\n9.3 Generar Liquidación Masiva \n9.3.1 Descripción \nEsta función permite la generación de liquidaciones de forma masiva \npara un grupo de clientes, facilitando la consolidación y el \nprocesamiento simultáneo de las cuentas a pagar. Ideal para cuando se \nrequiere liquidar a varios clientes que pertenecen a un mismo grupo o \ncategoría en un periodo específico. \n9.3.2 Input \nPrecondiciones: Acceso a los registros de servicios y transacciones \nfinancieras que se pueden agrupar por cliente o categoría. \n \nSelección de grupo de clientes: Identificación del grupo o categoría de \nclientes para los cuales se generarán las liquidaciones. \n9.3.3 Procesamiento \nI. Identificar y agrupar los servicios y adicionales consumidos por \nlos clientes del grupo seleccionado durante el periodo de \nliquidación. \nII. Calcular el total de la liquidación para cada cliente dentro del \ngrupo, asegurando que todos los cargos y créditos estén \nincluidos. \nIII. Generar las liquidaciones correspondientes para cada cliente de \nforma masiva, optimizando el tiempo y recursos administrativos. \n9.3.4 Salida \nLiquidaciones masivas generadas: Documentos de liquidación para \ncada cliente dentro del grupo seleccionado, listos para revisión y \nprocesamiento de pago, mejorando la eficiencia en la gestión financiera \ny la contabilidad. \n9.4 Enviar Archivo de Liquidación \n9.4.1 Descripción \nEste proceso permite enviar archivos de liquidación a los clientes o \ngrupos de clientes seleccionados. El sistema automatiza el envío de \nestos archivos, que pueden incluir detalles de los servicios prestados, \n60 \n\nadicionales, y totales a pagar. Tras la selección de los destinatarios y la \nconfirmación del envío, el sistema procesa y completa la operación en \nunos minutos, notificando al usuario una vez finalizado el envío. \n9.4.2 Input \nPrecondiciones: Los archivos de liquidación deben estar generados y \nlistos para ser enviados. \n \nSelección de destinatarios: Identificación de los clientes o grupos de \nclientes a quienes se enviarán los archivos de liquidación. \n9.4.3 Procesamiento \nI. Preparar los archivos de liquidación correspondientes para los \ndestinatarios seleccionados. \nII. Iniciar el proceso de envío en el sistema, que automáticamente \ndistribuirá los archivos a los clientes o grupos indicados. \nIII. Monitorear el proceso hasta su completitud, asegurando que \ntodos los archivos sean enviados correctamente. \n9.4.4 Salida \nNotificación de envío completado: Un aviso o confirmación generada \npor el sistema que indica que los archivos de liquidación han sido \nenviados exitosamente a todos los destinatarios seleccionados. \n9.5 Enviar Archivo de Liquidación Automáticamente \n9.5.1 Descripción \nEste proceso automatizado envía los archivos de liquidación a los \nclientes automáticamente al momento de liquidar. Para los grupos de \nclientes marcados como \"AUTOMÁTICOS\", el sistema genera y envía las \nliquidaciones a Xubio, donde se procesan y convierten en facturas. \nLuego, el sistema recibe las facturas adjuntas de Xubio y \nautomáticamente las envía a los clientes por correo electrónico, \nincluyendo el detalle y la factura. \n9.5.2 Input \nPrecondiciones: Configuración de los grupos de clientes como \n\"AUTOMÁTICOS\" para la liquidación y envío automático. \n \n61 \n\nDatos necesarios: Información de liquidación que se enviará a Xubio y \nluego al cliente. \n9.5.3 Procesamiento \nI. Al momento de liquidar, el sistema identifica los grupos de \nclientes automáticos y genera las liquidaciones correspondientes. \nII. Envía las liquidaciones a Xubio para procesarlas y convertirlas en \nfacturas oficiales. \nIII. Recibe las facturas de Xubio y prepara los documentos para el \nenvío por correo electrónico. \nIV. Envía automáticamente las facturas y detalles de liquidación a los \ncorreos electrónicos de los clientes, completando el proceso en \netapas sucesivas con minutos de diferencia. \n9.5.4 Salida \nFacturas y detalles enviados automáticamente: Los clientes reciben \npor correo electrónico las facturas y detalles de liquidación, asegurando \nun proceso eficiente y sin intervención manual, mejorando la velocidad \ny la precisión en la gestión de cobros y comunicaciones. \n9.6 Listar por Vehículo \n9.6.1 Descripción \nEsta funcionalidad permite listar las reservas y liquidaciones asociadas a \ncada vehículo específico. Es útil para la gestión de ingresos y costos \nrelacionados con cada vehículo en la flota, permitiendo un seguimiento \ndetallado y la liquidación financiera por vehículo. \n9.6.2 Input \nPrecondiciones: Debe haber reservas asociadas a los vehículos en el \nsistema. \n \nSelección de vehículo: Identificación del vehículo para el cual se \ndesean listar las reservas y liquidaciones. \n9.6.3 Procesamiento \nI. Identificar todas las reservas asociadas al vehículo seleccionado. \n62 \n\nII. Compilar los detalles financieros y operativos de estas reservas \npara preparar la liquidación por vehículo. \nIII. Agrupar la información necesaria para reflejar el rendimiento y \nlos ingresos generados por el vehículo específico. \n9.6.4 Salida \nListado de reservas por vehículo: Un resumen detallado de todas las \nreservas y liquidaciones asociadas al vehículo seleccionado, \nproporcionando una visión clara del uso del vehículo y su contribución \nfinanciera. \n9.7 Marcar Liquidaciones de Conductores como Pagadas \n9.7.1 Descripción \nEste proceso implica actualizar el estado de las liquidaciones de los \nconductores en el sistema, marcándolas como pagadas una vez que se \nha completado el pago correspondiente. Esto es esencial para llevar un \nregistro preciso de las transacciones financieras y asegurar que se \nmantenga la contabilidad actualizada respecto a los pagos a los \nconductores. \n9.7.2 Input \nPrecondiciones: Deben existir liquidaciones generadas para los \nconductores que están pendientes de pago. \n \nSelección de liquidaciones: Identificación de las liquidaciones \nespecíficas de conductores que se han pagado y necesitan ser \nactualizadas como tales en el sistema. \n9.7.3 Procesamiento \nI. Verificar que los pagos correspondientes a las liquidaciones \nseleccionadas se hayan recibido o procesado. \nII. Actualizar el estado de las liquidaciones seleccionadas en el \nsistema a “pagado”. \nIII. Registrar la fecha de pago y cualquier otro detalle relevante para \nmantener un historial de transacciones. \n63 \n\n9.7.4 Salida \nLiquidaciones Actualizadas como Pagadas: Confirmación en el \nsistema de que las liquidaciones seleccionadas han sido marcadas \ncomo pagadas, reflejando de manera precisa el estado actual de las \nfinanzas y asegurando la transparencia en el proceso de pagos. \n \n \n64 \n\nClientes \n1. Autenticación \n1.1 Iniciar Sesión \n1.1.1 Descripción \nEl usuario cliente debe iniciar sesión para acceder a las funcionalidades \nde la aplicación. \n1.1.2 Input \nCorreo Electrónico: El identificador único del usuario cliente. \n \nContraseña: La clave secreta asociada al nombre de usuario del cliente. \n1.1.3 Procesamiento \nI. El sistema valida que el correo electrónico y la contraseña \ncorrespondan a un usuario cliente registrado. \nII. Se verifica que la combinación de usuario y contraseña sea \ncorrecta. \nIII. Se comprueba si el usuario tiene permisos necesarios para \nacceder a las funcionalidades de la aplicación. \n1.1.4 Salida \nAcceso concedido: Si las credenciales son correctas y el usuario tiene \nlos permisos necesarios, se le redirige a la pantalla principal de la \naplicación. \n \nError de autenticación: Si las credenciales son incorrectas o el usuario \nno tiene permisos para utilizar la aplicación cliente, se muestra un \nmensaje de error indicando el problema y se le solicita que intente \nnuevamente. \n \n65 \n\n1.2 Recuperar contraseña \n1.2.1 Descripción \nEl usuario cliente puede recuperar la contraseña en caso de haberla \nolvidado. \n1.2.2 Input \nCorreo electrónico: La dirección de correo electrónico asociada a la \ncuenta del usuario cliente. \n1.2.3 Procesamiento \nI. El sistema verifica que el correo electrónico ingresado esté \nasociado a una cuenta de usuario cliente existente. \nII. Si el correo es válido, el sistema genera un enlace de \nrestablecimiento de contraseña y lo envía al correo electrónico \nasociado. \nIII. El enlace contiene un token único y seguro que permite al \nusuario restablecer su contraseña dentro de un periodo limitado. \n1.2.4 Salida \nCorreo de recuperación enviado: Si el correo electrónico corresponde a \nun usuario cliente, se muestra un mensaje indicando que el correo de \nrecuperación ha sido enviado. \n \n1.3 Registro \n1.3.1 Descripción \nCon el fin de poder acceder a las funcionalidades de la aplicación móvil, \nel usuario cliente debe registrarse en la aplicación. Esto forma parte del \núltimo paso que realiza el cliente, luego de haberse puesto en contacto \ncon alguien del área de Gestión comercial, donde se tomaron todos los \ndatos del usuario y le han generado y enviado un código único, para su \nregistro en la aplicación. \n \n66 \n\n1.3.2 Input \nPrecondición: Se tuvo que haber realizado el registro del usuario por \nparte de Gestión comercial. Tiene que haberse generado el código de \nusuario \n \nCódigo de usuario único: Se debe ingresar el código cedido por parte \nde Universal al cliente \n \nContraseña: El usuario debe definir cuál será su contraseña que utilizará \npara entrar a la plataforma \n \nNombre completo: El usuario debe ingresar su nombre completo \n \nEmail: Cargado del mail que se ha indicado al personal de Gestión \nComercial \n \nNúmero de teléfono: Se carga un telefono de contacto \n1.3.3 Procesamiento \nI. El sistema verifica la integridad de los campos requeridos, \nasegurándose de que estén completos y posean el formato \nadecuado.  \nII. Posteriormente, se valida la exactitud del código de usuario, \nverificando su correspondencia con el correo electrónico \nregistrado. \nIII. En caso de que los datos sean correctos, se procede a almacenar \nen la base de datos los restantes campos introducidos. \n1.3.4 Salida \nUsuario registrado: Después de completar este proceso, el usuario \nobtiene acceso a todas las funcionalidades ofrecidas por la plataforma. \n \n2. Home \n2.1 Visualizar viajes activos y solicitados \n2.1.1 Descripción \nLos usuarios clientes que se encuentran a punto de iniciar un viaje \ntienen la capacidad de acceder y visualizar los detalles del viaje actual \n67 \n\nque están por emprender. Además, tienen la opción de visualizar \ninformación detallada sobre más de un viaje que hayan solicitado \npreviamente y están a espera de ser despachados. Esta funcionalidad \nproporciona a los usuarios una visión completa y detallada de sus viajes \npendientes, permitiéndoles planificar y gestionar sus itinerarios de \nmanera efectiva. \n2.1.2 Input \nPrecondiciones: El usuario debe tener un viaje en estado Despachado, \nActivo o Partida. \n2.1.3 Procesamiento \nI. Se filtran los viajes que tiene de estado Despachado, Activo y \nPartida  \nII. De los viajes filtrados, se buscan cuales coinciden con que el \nsolicitante o pasajero tengan de ID, el mismo que el usuario \nactivo \nIII. Se ordena desde el más próximo a viajar, hasta el que está más \nen el futuro \n1.1.4 Salida \nLista de los viajes: Se presenta una lista con todos los viajes activos y \nsolicitados, en donde se pueden encontrar mas detalles como fecha, \nhora, conductor asignado, servicio y adicionales que se hayan incluido \ncuando se solicitó el viaje \n2.3 Valorar Viaje \n2.3.1 Descripción \nEn esta funcionalidad, los usuarios tienen la posibilidad de calificar y \nvalorar y dejar reseñas sobre los viajes que han realizado utilizando la \naplicación móvil. Esto proporciona retroalimentación valiosa para el \nservicio y ayuda a otros usuarios a tomar decisiones informadas sobre \nsus viajes. \n2.3.2 Input \nPrecondiciones: El usuario debe haber iniciado sesión en la aplicación. \nSe requiere que el viaje esté en estado \"Finalizado\" y no tenga una \nreseña previamente cargada. \n \n68 \n\n2.3.3 Procesamiento \nI. Una vez cumplidas las precondiciones, el usuario puede acceder \na la sección de valoración de viajes. \nII. Luego, selecciona el viaje específico que desea valorar y procede \na registrar su opinión y calificación sobre el mismo. \n2.3.4 Salida \nDespués de completar el proceso de valoración, el viaje quedará \nasociado con la valorización cargada en el sistema. Esto permite a otros \nusuarios ver y considerar las opiniones sobre el servicio prestado. \n2.4 Chat con conductor \n2.4.1 Descripción \nEsta función permite a los usuarios establecer un chat con el conductor \ndel vehículo asignado para su viaje. El chat se activa automáticamente \n15 minutos antes de la hora programada para el viaje y está diseñado \npara facilitar la comunicación entre el cliente y el conductor en caso de \nnecesidad de coordinación, preguntas o cualquier otro tipo de consulta. \n2.4.2 Input \nPrecondiciones: El usuario debe tener un viaje programado dentro de \nlos próximos 15 minutos. El viaje debe estar en estado \"Partida”.El \nconductor asignado al viaje debe haber aceptado la solicitud y estar \ndisponible. \n \nChat: Mensajes entre el cliente y el conductor \n2.4..3 Procesamiento \nI. Cuando se cumplen las precondiciones, se habilita \nautomáticamente un chat entre el cliente y el conductor. \n \nII. Una vez que el conductor recoge al cliente y el viaje está en curso, \nel chat se cierra automáticamente y se elimina de la interfaz de \nusuario. Esto asegura la privacidad y seguridad del usuario \nmientras está en tránsito. \n2.4.4 Salida \nChat: Ambas partes pueden intercambiar mensajes en tiempo real para \ncoordinar detalles del encuentro, como la ubicación exacta de recogida, \n69 \n\ncualquier solicitud especial o cualquier otro asunto relacionado con el \nviaje. \n \n3. Solicitar Servicio \n3.1 Solicitar servicio \n3.1.1 Descripción \nLos usuarios clientes tienen la opción de solicitar un viaje a través de la \naplicación móvil. Esta función les brinda la comodidad de iniciar el \nproceso de reserva de manera ágil y eficiente, todo desde la comodidad \nde su dispositivo móvil. \n3.1.2 Input \nPrecondición: El usuario tiene que tener una cuenta activa.  \n \nTipo de servicio: Se selecciona un tipo de servicio en base a una lista de \nlos servicios que tiene asignados por contrato (Se detalla más en 3.2) \n \nPasajeros: Se presenta una lista de pasajeros agregados a la cuenta del \nsolicitante \n \nFecha y hora: Se completa con el día y el horario en el que se quiere \nrealizar el viaje. \n \nUbicación de origen: Dirección de la ubicación donde el conductor va a \nrecoger al cliente. Se puede acceder al historial de los viajes anteriores. \nTambién se puede geolocalizar la ubicación actual del cliente. \n \nUbicaciones de destino: Carga de la ubicación a la que se desea ir. Se \npueden cargar más de una. Se puede seleccionar la ubicación en base \nal historial. \n   \n3.1.3 Procesamiento \nI. Validación de los permisos del usuario activo para solicitar un \nviaje. \nII. Recopilación de toda la información necesaria para la solicitud. \n70 \n\nIII. Verificación de que todos los campos requeridos estén completos \ny contengan información válida. \n3.1.4 Salida \nViaje creado: Se procede a crear la entidad correspondiente al viaje \nsolicitado, la cual incluye todos los detalles relevantes proporcionados \npor el usuario. En este proceso, se asigna al viaje el estado inicial de \"A \ndespachar\", indicando que se encuentra en espera de ser asignado a un \nconductor por parte de un operador.  \n \n3.2 Lista de servicios \n3.2.1 Descripción \nCuando un usuario cliente accede a Universal, tiene la opción de \ncontratar una serie específica de tipos de servicios. En esta sección del \nsistema, el usuario puede visualizar únicamente los servicios que están \nasociados a su contrato. \n3.2.2 Input \nPrecondición: El usuario cliente tiene que tener en su contrato, una \nserie de servicios asociados \n \nOpción de servicio: Elección del tipo de servicio deseado para su \nutilización. \n3.2.3 Procesamiento \nI. En base al usuario activo, se busca que tipo de servicios tiene \nasociados \nII. Se enlistan los servicios contratados \n3.2.4 Salida \nLista con servicios contratados: Lista interactiva que muestra el \nnombre de cada uno de los servicios asociados al contrato del usuario \ncliente. Esta lista permite una fácil visualización y selección de los \nservicios disponibles. \n71 \n\n3.3 Elegir pasajeros  \n3.3.1 Descripción \nEl usuario cliente puede elegir quiénes lo acompañarán en el viaje, ya \nsea proporcionando sus nombres directamente o seleccionándolos de \nuna lista predeterminada. La primera opción le permite buscar \nindividualmente a cada pasajero, lo que facilita una selección detallada \ny personalizada según sus preferencias. Mientras tanto, la segunda \nopción simplifica el proceso al permitirle elegir a los pasajeros de una \nlista ya establecida, ideal para grupos recurrentes o para aquellos \nviajeros habituales que suelen acompañar en múltiples ocasiones.  \n3.3.2 Input \nPrecondición: El usuario tiene que tener por contrato la opción de \nagregar a más de un cliente \n \nNombre de pasajero: El usuario puede cargar de forma manual el \nnombre del pasajero que se utilizará para ser buscado en la base de \ndatos \n3.3.3 Procesamiento \nI. Se lleva a cabo una verificación para asegurar que el texto \ningresado por el usuario sea válido y esté libre de caracteres \nespeciales. \nII. La información proporcionada por el usuario se emplea para \nrealizar una búsqueda en la base de datos, con el fin de recuperar \naquellos perfiles que coinciden con los nombres ingresados. \nIII. Se muestran los pasajeros que ya existen en la cuenta del usuario \ny que cumplen con los nombres ingresados, facilitando así la \ngestión y selección de los participantes del viaje \n \n3.3.4 Salida \nLista de pasajeros: Se presenta un listado de los pasajeros \nseleccionados por el usuario. \n72 \n\n3.4 Crear pasajeros  \n3.4.1 Descripción \nEl usuario cliente tiene la posibilidad de cargar quiénes son las personas \nque realizarán el viaje, proporcionando sus nombres y detalles \npertinentes. En el caso de que alguna de estas personas no esté \npreviamente registrada en la base de datos, el sistema permite \nagregarla manualmente. Esta funcionalidad brinda flexibilidad y \npersonalización al usuario, asegurando que pueda incluir a todos los \nparticipantes del viaje, incluso aquellos que no estén predefinidos en el \nsistema.  \n3.4.2 Input \nPrecondición: El usuario tiene que tener por contrato la opción de \nagregar a más de un cliente. El pasajero que se quiere agregar al viaje, \nno existe en el sistema \n \nNombre de pasajero: El usuario puede cargar de forma manual el \nnombre del pasajero que se desea crear y que no existe en la base de \ndatos \n3.4.3 Procesamiento \nI. Se lleva a cabo una verificación para asegurar que el texto \ningresado por el usuario sea válido y esté libre de caracteres \nespeciales. \nII. La información proporcionada por el usuario se emplea para \nrealizar una búsqueda en la base de datos, con el fin de recuperar \naquellos perfiles que coinciden con los nombres ingresados. \nIII. Si no se encuentra ninguna coincidencia, se procede a cargar al \npasajero en la base de datos \nIV. El pasajero es agregado al viaje en creación \n \n3.4.4 Salida \nCreación del pasajero: Se crea un nuevo pasajero en base al nombre y \napellido ingresado, y se lo almacena en la base de datos \n \n73 \n\n3.5 Obtener ubicación de origen \n3.5.1 Descripción \nRegistro de la ubicación de recogida del usuario solicitante por parte del \nconductor, facilitado automáticamente a través de la geolocalización del \nteléfono del cliente. \n3.5.2 Input \nPrecondición: La aplicación debe tener acceso a la ubicación del \nteléfono \n3.5.3 Procesamiento \nI. Se verifica que la aplicación tenga acceso a la geolocalización del \nteléfono \nII. Se accede a las coordenadas donde se encuentra el usuario \nIII. Mediante las coordenadas, utilizando la API de Google Maps, se \nencuentra la calle y número  \n3.5.4 Salida \nUbicación de origen: Coordenadas, nombre y número de la calle que se \ntomará de punto de origen para el viaje en proceso de carga \n \n3.6 Historial de ubicación \n3.6.1 Descripción \nSe proporciona una lista detallada y completa que contiene todas las \nubicaciones que han sido utilizadas con anterioridad como puntos de \norigen y destino en viajes previos. Esta lista presenta una recopilación \nde todas las ubicaciones registradas en el sistema, permitiendo al \nusuario seleccionar entre una amplia cantidad de opciones basadas en \nsu historial de viajes anteriores. \n3.6.2 Input \nPrecondición: Tiene que existir al menos un viaje realizado con \nanterioridad \n \nUbicación de origen: Elección de la dirección de origen a ser agregada \na la reserva en proceso \n \n74 \n\nUbicación de destino: Elección de la dirección de destino a ser \nagregada a la reserva en proceso \n \n \n3.6.3 Procesamiento \nI. Se buscan todos los viajes que tienen como solicitante o pasajero, \nal usuario actual \nII. En base a esos viajes, se arma una lista con todos los orígenes y \ndestinos  \n3.6.4 Salida \nLista de ubicaciones: Se presenta al usuario una lista completa que \nrecoge todas las ubicaciones que han sido cargadas previamente por él \nmismo o en su nombre. Esta lista detallada proporciona información \nespecífica, incluyendo la provincia, ciudad, calle y número asociados a \ncada ubicación. \n \nUbicación de origen: El viaje que se encontraba en proceso de carga \nahora cuenta con un punto de origen establecido. \n \nUbicación de destino: El viaje que se encontraba en proceso de carga \nahora cuenta con un punto de destino establecido. \n \n3.7 Carga manual de domicilio de origen \n3.7.1 Descripción \nEl usuario tiene la capacidad de definir manualmente la ubicación \ndesde la cual el conductor iniciará el viaje para recogerlo. Esta función \nproporciona una flexibilidad adicional en la gestión de los viajes, \nespecialmente en situaciones donde la ubicación de recogida no puede \nser determinada automáticamente o cuando se requiere una \nespecificidad particular en la dirección de inicio del viaje. \n3.7.2 Input \nPrecondición: Es necesario que haya un viaje en proceso de carga. \n \nUbicación: El cliente debe ingresar el nombre de la calle, la altura, así \ncomo la ciudad y provincia correspondientes. \n75 \n\n3.7.3 Procesamiento \nI. Verificación de completitud y validación de los formatos de los \ncampos cargados \nII. Verificación de autenticidad de la ubicación cargada, utilizando la \nAPI de Google Maps, con el fin de constatar dicha dirección \nIII. Se incluyen ubicaciones sugeridas según la información \nproporcionada por el usuario. \n3.7.4 Salida \nUbicación de origen: El viaje que se encontraba en proceso de carga \nahora cuenta con un punto de origen establecido. \n \n3.8 Carga manual de domicilio de destino \n3.8.1 Descripción \nEl cliente tiene la capacidad de definir manualmente la ubicación a la \ncual el conductor deberá transportar al mismo. Esta función \nproporciona una flexibilidad adicional en la gestión de los viajes, \nespecialmente en situaciones donde la ubicación de recogida no puede \nser determinada automáticamente o cuando se requiere una \nespecificidad particular en la dirección de destino del viaje. \n3.8.2 Input \nPrecondición: Debe existir un viaje en proceso de carga y debe tener un \npunto de origen establecido \n \nDirección: El cliente debe ingresar el nombre de la calle, la altura, así \ncomo la ciudad y provincia correspondientes. \n3.8.3 Procesamiento \nI. Verificación de completitud y validación de los formatos de los \ncampos cargados \nII. Verificación de que la dirección de destino no coincida con la de \norigen \nIII. Verificación de autenticidad de la ubicación cargada, utilizando la \nAPI de Google Maps, con el fin de constatar dicha dirección \n76 \n\n3.8.4 Salida \nUbicación de origen: El viaje que se encontraba en proceso de carga \nahora cuenta con uno o más puntos de destino establecidos. \n3.9 Visualización del recorrido \n3.9.1 Descripción \nLos usuarios tienen acceso a ver los distintos caminos disponibles o \nrutas alternativas, basados en el punto de partida y los destinos \nelegidos. \n3.9.2 Input \nPrecondiciones: Debe existir un viaje en proceso de carga y tiene que \ntener cargados tanto el punto de origen como el de destino \n \nRuta elegida: Elección de cuál de las rutas posibles, desea realizar \n3.9.3 Procesamiento \nI. Se buscan las ubicaciones de origen y las de destino cargadas \ncon anterioridad \nII. Utilizando la API de Google Maps, se ubican en el mapa \nIII. Se buscan como máximo 3 rutas posibles para realizar el viaje \n3.9.4 Salida \nRutas posibles: Mapa donde se puede visualizar tanto los distintos \npuntos cargados como al menos un camino y sus alternativas, si es que \nposee. Estas diferentes opciones de ruta se presentan en una lista junto \ncon el tiempo estimado para completar cada recorrido. \n \nRuta elegida: El viaje en proceso de carga, ahora cuenta con la ruta \nelegida por el usuario \n3.10 Agregar observaciones \n3.10.1 Descripción \nLos usuarios tienen la opción de incluir comentarios relacionados con su \nviaje. Esta funcionalidad permite al usuario proporcionar instrucciones \nespecíficas u otras indicaciones que considere necesarias. \n77 \n\n3.10.2 Input \nPrecondiciones: Debe haber un viaje en proceso de carga y es \nnecesario que posea dia y fecha, pasajeros, tipo de servicio, punto de \norigen y destino cargados \n \nObservación: El usuario puede agregar texto sin restricciones. Este paso \nes opcional \n3.10.3 Procesamiento \nI. El texto ingresado se somete a un proceso de limpieza para \neliminar cualquier formato incorrecto que pueda contener, como \netiquetas de HTML, entre otros. \n3.10.4 Salida \nViaje con observación: Los comentarios agregados se adjuntan al viaje \ncreado. Estos comentarios estarán disponibles para que el operador los \nvisualice al momento de asignar una unidad. \n3.11 Resumen de viaje \n3.11.1 Descripción \nAl finalizar el formulario para solicitar un viaje, se presenta un resumen \ncon todos los datos cargado, con el fin de tener una previsualización y \nverificar antes de que un operario tome acción \n3.11.2 Input \nPrecondiciones: Es necesario haber cargado toda la información  \n \nRealizar reserva: Botón para confirmar que está de acuerdo en \nterminar la reserva \n3.11.3 Procesamiento \nI. Se valida que no falte ningún campo necesario para realizar una \nreserva \nII. Listado de todos los detalles que cargó el usuario \n3.11.4 Salida \nViaje confirmado: El usuario confirma que los detalles de la reserva son \ncorrectos. El viaje se crea y tiene de estado “A Despachar” \n78 \n\n \n4. Mis servicios \n4.1 Lista de viajes \n4.1.1 Descripción \nLos usuarios cuentan con la posibilidad de acceder y visualizar con \ndetalle los viajes que han sido completados con anterioridad, \npermitiendo así revisar cada aspecto y detalle de los servicios realizados. \n4.1.2 Input \nPrecondiciones: Es necesario que el usuario posee al menos un viaje ya \nfinalizado \n \nSelección de filtro: Se puede filtrar por fecha \n4.1.3 Procesamiento \nI. Se recolecta todos los viajes del usuario activo \nII. Filtro para presentar únicamente los que tengan estado Cerrado \n4.1.4 Salida \nLista de viajes finalizados: Se presenta una lista detallada con los viajes \nque se han realizado en el pasado y que tengan como estado “Cerrado”. \nEsto permite al usuario acceder a más información sobre sus viajes \nrealizados. \n \n5. Mi cuenta \n5.1 Actualizar Mis Datos \n5.1.1 Descripción \nLos usuarios tendrán la capacidad de personalizar su perfil dentro de la \naplicación móvil mediante la carga y visualización de una imagen que \nrepresente su identidad, Nombre y apellido, DNI, Correo electrónico y \nteléfono de contacto. Esta funcionalidad garantiza una experiencia de \nusuario más personalizada. \n79 \n\n5.1.2 Input \nPrecondición: El usuario debe tener una cuenta en la aplicación. \n \nNombre y apellido: El usuario ingresa el nuevo nombre y apellido que \ndesea que figure en la aplicación \n \nDNI: El usuario puede actualizar su número de DNI en caso de que haya \nsido cargado erróneamente \n \nCorreo electrónico: Solamente se puede visualizar. \n \nTeléfono: Se debe seleccionar el prefijo, en base a una lista y escribir el \nnúmero de teléfono \n \nFoto de perfil: Acceso a la cámara o biblioteca del teléfono \n5.1.3 Procesamiento \nI. Verificar que todos los campos estén completos y que el formato \nsea válido \nII. Comparar los valores de los campos existentes contra los que  \ncambiaron \nIII. Actualizar la base de datos con los nuevos valores \n5.1.4 Salida \nInformación actualizada: El perfil del usuario cuenta con la información \nactualizada del campo que el usuario haya realizado los cambios \n \n5.2 Agregar, Ver, Modificar y Eliminar Mis Lugares \n5.2.1 Descripción \nEl usuario tiene la capacidad de registrar, ver y eliminar múltiples \nubicaciones frecuentes, las cuales estarán disponibles para su selección \ndurante el proceso de reserva, ofreciendo así una mayor comodidad y \neficiencia en la planificación de sus viajes. \n5.2.2 Input \nPrecondición: El usuario debe haber iniciado sesión en la aplicación \npara acceder a esta funcionalidad. \n80 \n\n \nUbicación: Nombre, Calle y número de la ubicación o marcar en un \nmapa \n \n5.2.3 Procesamiento \nI. Verificar que los campos estén completos y tengan un formato \nválido \nII. Buscar y marcar la ubicación en el mapa \nIII. Guardar dicha ubicación en la base de datos, asociándolo al \nusuario \n5.2.4 Salida \nDirección frecuente: Dirección cargada, eliminada o modificada por el \nusuario, la cual podrá ser utilizada en la aplicación. Esto se presenta con \nun mensaje de confirmación \n \n \n5.3 Cambiar contraseña \n5.3.1 Descripción \nEl usuario puede cambiar su contraseña de ingreso. Para eso debe \ningresar su contraseña actual, la nueva contraseña y una confirmación \nde la contraseña para evitar errores. \n5.3.2 Input \nContraseña actual: El usuario ingresa su contraseña actual para validar \nsu identidad. \n \nNueva contraseña: El usuario ingresa la nueva contraseña que desea \nestablecer. \n \nConfirmación de la nueva contraseña: El usuario ingresa nuevamente \nla nueva contraseña para confirmar que no hay errores de tipeo. \n5.3.3 Procesamiento \nI. Verificar que el usuario está autenticado y tiene acceso para \ncambiar su contraseña. \n81 \n\nII. Validar que la contraseña actual ingresada por el usuario coincida \ncon la registrada en el sistema. \nIII. Comprobar que la nueva contraseña y su confirmación coinciden \npara evitar errores de tipeo. \nIV. Verificar que la nueva contraseña cumpla con las políticas de \nseguridad (longitud, complejidad, etc.). \nV. Actualizar la contraseña del usuario en la base de datos con la \nnueva contraseña proporcionada. \n5.4.4 Salida \nConfirmación de cambio de contraseña: Mensaje de éxito indicando \nque la contraseña se ha cambiado correctamente. \n5.4 Preferencias \n5.3.1 Descripción \nEl usuario tiene la capacidad de editar sus preferencias relacionadas con \nel viaje o el uso de la aplicación, lo que le permite ajustar y personalizar \nsu experiencia según sus necesidades y deseos específicos. \n5.3.2 Input \nCambio de preferencia: El usuario puede elegir entre opciones, según \ncual sea la preferencia a actualizar \n5.3.3 Procesamiento \nI. Asegurarse de que el usuario esté autenticado y tenga los \npermisos necesarios para modificar sus preferencias. \nII. Validar que el nuevo valor ingresado sea apropiado y válido para \nla preferencia que se desea modificar. \nIII. Garantizar que los cambios realizados se reflejan tanto en la \ninterfaz de la aplicación como en la base de datos, asegurando así \nla coherencia y consistencia de la información. \n5.4.4 Salida \nPreferencia actualizada: La preferencia que se modifica, se ve en la \naplicación con su nuevo valor \n \n82 \n\n5.5 Visualizar formas de pago \n5.5.1 Descripción \nLos usuarios tendrán acceso a una lista que muestra todas las formas de \npago asociadas a su cuenta dentro de la aplicación móvil. Esta \nfuncionalidad les permite administrar y controlar de manera eficiente \nsus métodos de pago. \n5.5.2 Input \nPrecondición: Se requiere que el usuario haya iniciado sesión en la \naplicación para acceder a esta función. El administrador le tuvo que \nhaber asignado que formas de pago puede utilizar el usuario. \n5.5.3 Procesamiento \nI. Se accederá a la base de datos del usuario para recuperar la \ninformación de todas las formas de pago asociadas a su cuenta.  \nII. Luego, presentará esta información al usuario de manera clara y \norganizada \n5.5.4 Salida \nLista de formas de pago: El usuario podrá visualizar fácilmente todas \nlas formas de pago asociadas a su cuenta en la aplicación móvil, lo que \nle brinda un control total sobre sus métodos de pago y transacciones. \n5.6 Seleccionar forma de pago \n5.6.1 Descripción \nLos usuarios tendrán la posibilidad de seleccionar una forma de pago \npara su cuenta dentro de la aplicación móvil. Esta funcionalidad les \nbrinda flexibilidad al administrar sus métodos de pago \n5.6.2 Input \nPrecondición: Se requiere que el usuario haya iniciado sesión en la \naplicación para acceder a esta función. El usuario debe contar con \nmétodos de pago habilitados por el administrador \n \nForma de pago: El usuario puede seleccionar uno de los métodos de \npagos proporcionados \n \n83 \n\n5.6.3 Procesamiento \nI. Búsqueda de las formas de pago asociadas a la cuenta del \nusuario activo \nII. Envío y presentación de los métodos de pago encontrados \n5.6.4 Salida \nActualización de forma de pago: Al seleccionar una forma de pago, \nesta se almacena como la forma de pago por defecto de la cuenta \nactiva \n \n5.7 Accesibilidad \n5.7.1 Descripción \nLa aplicación proporciona diversas opciones de configuración de \naccesibilidad, que permiten al usuario ajustarlas según sus necesidades \nindividuales, con el objetivo de mejorar su experiencia de uso y \ngarantizar un acceso más inclusivo y accesible a todas las \nfuncionalidades y contenido de la aplicación. \n5.7.2 Input \nPrecondición: Debe haber una cuenta de usuario activa \n \nOpción de accesibilidad: Selección del valor de alguna de las opciones \nde accesibilidad. \n5.7.3 Procesamiento \nI. Verificación de la validez de la opción de elegida \nII. Almacenamiento de la opción \n5.7.4 Salida \nAccesibilidad Actualizada: En base a la nueva opción se actualiza las \npreferencias de accesibilidad del usuario. Esta será accesible para ver \npor el administrador y el conductor a la hora de realizar los viajes \n84 \n\n \n5.8 Cerrar sesión \n5.8.1 Descripción \nLa función de cerrar sesión permite al usuario finalizar su sesión activa \nen la aplicación móvil. \n5.8.2 Input \nPrecondición: Debe haber una cuenta de usuario activa \n5.8.3 Procesamiento \nI. Cuando el usuario selecciona la opción de cerrar sesión en la \naplicación, se procede a cerrar todas las sesiones activas \nasociadas con su cuenta.  \nII. Eliminación de cualquier información de sesión almacenada \nlocalmente en el dispositivo y la invalidación de las credenciales \nde acceso. \n5.8.4 Salida \nSesión Cerrada: Una vez completado el proceso de cierre de sesión, el \nusuario es redirigido a la pantalla de inicio de sesión de la aplicación. \nEsto confirma que la sesión se ha cerrado con éxito y garantiza que \ncualquier actividad futura requerirá iniciar sesión nuevamente para \nacceder a la cuenta. \n \n6. Realizar viaje \n6.1 Visualizar estado \n6.1.1 Descripción \nLos usuarios tienen la capacidad de acceder y visualizar el estado actual \ndel viaje en curso. Pueden conocer la ubicación del conductor, si está \nretrasado y estimar el tiempo de llegada de su vehículo. \n6.1.2 Input \nPrecondición: El cliente tiene que tener un viaje en proceso \n \n85 \n\nUbicación del conductor: La aplicación de conducto estará \nconstantemente notificando la ubicación del mismo \n6.1.3 Procesamiento \nI. En primer lugar, se verifica que el viaje que se está visualizando \nesté activo.  \nII. Posteriormente, se determina la ubicación actual del conductor.  \nIII. Dependiendo de la situación, ya sea que el conductor esté \nretrasado, en camino, u otra condición, se le informa al cliente \nsobre su estado. \n \n6.1.4 Salida \nEstado del viaje: Como resultado, el usuario puede visualizar el estado \nactual del viaje y la ubicación del conductor, lo que proporciona una \nmayor tranquilidad y transparencia en el servicio solicitado. \n \n6.2 Datos del conductor \n6.2.1 Descripción \nLos clientes tienen la capacidad de acceder y visualizar una amplia \ngama de información sobre el conductor. Estos datos incluyen nombre \ny apellido, fotografía, cantidad de viajes realizados, tiempo desde que \nofrece servicio a Universal, detalles del vehículo (como marca y modelo, \ny patente), tipo de servicio ofrecido y su calificación. \n6.2.2 Input \nPrecondición: El cliente tiene que tener un viaje en proceso \n \nInformación del chofer: El chofer tuvo que haberse registrado en la \naplicación y cargado los datos necesarios \n6.2.3 Procesamiento \nI. Búsqueda de quién es el conductor asociado al viaje \nII. Se recolecta y envía la información necesaria para ser visualizada \npor el cliente \n \n86 \n\n6.2.4 Salida \nDetalles del conductor: Como resultado, el usuario puede visualizar el \nperfil del conductor que va a recogerlo \n \n6.3 Contacto a soporte \n6.3.1 Descripción \nLos clientes cuentan con un acceso directo en todo momento a la \ninformación de contacto del servicio de soporte de Universal \n6.3.2 Input \nPrecondición: El cliente tiene que tener un viaje en proceso \n6.3.3 Procesamiento \nI. Se verifica que el usuario se encuentre en un viaje en curso y \nluego se le envía la información de contacto del equipo de \nsoporte de servicio. \n \n6.3.4 Salida \nDetalles de contacto: Como resultado, el usuario puede visualizar la \ninformación de contacto del servicio de soporte \n \n6.3 Detalles finales del viaje \n6.3.1 Descripción \nDespués de que el conductor haya finalizado el viaje, el cliente puede \nver los cargos asociados al mismo, así como también los comprobantes \nde los servicios adicionales, si los hubiera \n6.3.2 Input \nPrecondición: El conducto tuvo que haber dado a “cerrar viaje” \n \nFirma de conformidad: El cliente puede cargar una firma de \nconformidad, con el fin de reconocer los gastos propiciados por \nUniversal y el conductor \n87 \n\n6.3.3 Procesamiento \nI. Se recopila toda la información relacionada con los gastos del \nviaje. \nII. Al cargar la firma, esta se adjunta como comprobante de los \ngastos registrados por el conductor.  \nIII. En caso de ser necesario, la firma puede eliminarse antes de \nenviarla. \nIV.  La firma se almacena junto al registro del viaje una vez finalizado. \n \n6.3.4 Salida \nDetalles finales del viaje: Como resultado, el usuario puede visualizar \nlos detalles de los gastos finales del viaje. En algunos casos se podrá \nrealizar la paga directamente y en otros deberán ser liquidados según la \nfrecuencia asignada por contrato \n \n6.4 Integración Mercado Pago \n6.4.1 Descripción \nPara habilitar la capacidad de los usuarios para realizar pagos a través \nde Mercado Pago o emplear una tarjeta precargada en la plataforma, es \nesencial llevar a cabo una integración completa del sistema con dicho \nproveedor. Esta integración garantizará una experiencia fluida y segura \npara los usuarios al realizar transacciones financieras dentro de la \nplataforma. \n6.4.2 Input \nPrecondición: Se requiere que el usuario haya iniciado sesión en la \naplicación para acceder a esta función. El usuario debe poseer una \ncuenta en Mercado Pago \n \nVinculación con Mercado Pago: El usuario debe vincular su cuenta de \nUniversal con Mercado Pago \n6.4.3 Procesamiento \nI. El usuario ingresa sus credenciales referidas a Mercado Pago, \nmediante la interfaz de dicho servicio \nII. Mercado Pago valida dicha información y le presenta la \ninformación necesaria para realizar el pago \n88 \n\nIII. El sistema de Universal genera un pago a realizarse mediante \nMercado Pago \n6.4.4 Salida \nPago de servicio: Se realiza el pago de un servicio mediante Mercado \nPago \n \n \n7. Notificaciones \n7.1 Visualizar Notificaciones \n7.1.1 Descripción \nLos usuarios tienen la capacidad de acceder y visualizar las \nnotificaciones que reciben dentro de la aplicación móvil. Esta \nfuncionalidad les permite estar al tanto de cualquier actualización, \nmensaje o evento importante relacionado con su cuenta o actividades \nen la plataforma. \n7.1.2 Input \nPrecondiciones: \nEl usuario debe haber iniciado sesión en la aplicación para acceder a \nesta función. \nLas notificaciones deben estar activadas y disponibles para el usuario en \nla aplicación. \n7.1.3 Procesamiento \nLa aplicación accede a la base de datos para recuperar las notificaciones \npendientes para el usuario activo. Luego, presenta estas notificaciones \nde manera clara y organizada en la interfaz de usuario para su \nvisualización. \n7.1.4 Salida \nComo resultado, el usuario puede ver y revisar todas las notificaciones \npendientes dentro de la aplicación móvil. Esto garantiza que estén \ninformados sobre cualquier evento o actualización relevante en tiempo \nreal. \n \n89 \n\n7.2 Notificaciones push \n7.2.1 Descripción \nEl usuario cliente tiene la opción de recibir notificaciones push en \ntiempo real en su dispositivo móvil. Estas notificaciones proporcionan \nactualizaciones instantáneas sobre el comienzo de algún viaje, cambios \nen los viajes existentes y cualquier otra información importante \nrelacionada con su cuenta de cliente. \n7.2.2 Input \nPrecondición: Alguno de los servicios de Universal, tuvo que haber \nenviado una notificación al usuario cliente. \n7.2.3 Procesamiento \nI. Al iniciar sesión, se genera y almacena un token que permite \nrecibir notificaciones.  \nII. Cuando se detecta un evento de notificación push, esta se envía \nde inmediato al dispositivo del conductor.  \nIII. Al hacer clic en la notificación, se redirige automáticamente a \nuna sección específica de la aplicación correspondiente al evento \nrecibido. \n7.2.4 Salida \nNotificación push: Como resultado, el cliente recibe notificaciones push \nen su dispositivo móvil según la configuración y los eventos definidos en \nla aplicación. Esto garantiza que esté siempre al tanto de la información \nrelevante en tiempo real. \n \n90 \n\nConductor \n1. Autenticación \n1.1 Iniciar Sesión \n1.1.1 Descripción \nEl usuario conductor debe iniciar sesión para acceder a las \nfuncionalidades de la aplicación. \n1.1.2 Input \nCorreo Electrónico: El identificador único del usuario conductor. \n \nContraseña: La clave secreta asociada al nombre de usuario del \nconductor. \n1.1.3 Procesamiento \nIV. El sistema valida que el correo electrónico y la contraseña \ncorrespondan a un usuario conductor registrado. \nV. Se verifica que la combinación de usuario y contraseña sea \ncorrecta. \nVI. Se comprueba si el usuario tiene permisos necesarios para \nacceder a las funcionalidades de la aplicación. \n1.1.4 Salida \nAcceso concedido: Si las credenciales son correctas y el usuario tiene \nlos permisos necesarios, se le redirige a la pantalla principal de la \naplicación. \n \nError de autenticación:  Si las credenciales son incorrectas o el usuario \nno tiene permisos para utilizar la aplicación cliente, se muestra un \nmensaje de error indicando el problema y se le solicita que intente \nnuevamente. \n91 \n\n1.2 Recuperar contraseña \n1.2.1 Descripción \nEl usuario conductor puede recuperar la contraseña en caso de haberla \nolvidado. \n1.2.2 Input \nCorreo electrónico: La dirección de correo electrónico asociada a la \ncuenta del usuario conductor. \n1.2.3 Procesamiento \nI. El sistema verifica que el correo electrónico ingresado esté \nasociado a una cuenta de usuario conductor existente. \nII. Si el correo es válido, el sistema genera un enlace de \nrestablecimiento de contraseña y lo envía al correo electrónico \nasociado. \nIII. El enlace contiene un token único y seguro que permite al \nusuario restablecer su contraseña dentro de un periodo limitado. \n1.2.4 Salida \nCorreo de recuperación enviado: Si el correo electrónico corresponde a \nun usuario conductor, se muestra un mensaje indicando que el correo \nde recuperación ha sido enviado. \n \n1.3 Registro \n1.3.1 Descripción \nLos usuarios tienen la capacidad de crear una cuenta dentro de la \naplicación de Conductores. A través de esta cuenta, podrán acceder a \ntodas las funcionalidades disponibles en la plataforma, lo que les \npermitirá aprovechar al máximo los servicios y características ofrecidos. \n1.3.2 Input \nPrecondiciones: \nAlgun administrador tuvo que haberle creado anteriormente un \nidentificador  \n \nNombre, apellido, email y teléfono \n \n92 \n\nAñadir vehículo \nMarca, modelo, patente, año, color, tipo de combustible, categoría, \nseguro \n \nAñadir DNI \nCargar foto de ambos lados. Se puede seleccionar de la biblioteca o \nsacar foto con el dispositivo móvil \n \nAñadir licencia de conducir \nCargar foto, fecha de vencimiento, y clase. Se puede seleccionar de la \nbiblioteca o sacar foto con el dispositivo móvil \n \nAñadir VTV \nCargar foto de comprobante de la VTV. Se puede seleccionar de la \nbiblioteca o sacar foto con el dispositivo móvil \n \nAñadir foto de perfil \nCargar toto del usuario. Se puede seleccionar de la biblioteca o sacar \nfoto con el dispositivo móvil \n \n \n1.3.3 Procesamiento \nI. Se verifica que ninguno de los campos estén vacíos y el formato \nsea válido \nII. Se almacena todo lo que el usuario cargó dentro de la base de \ndatos.  \n1.3.4 Salida \nCuenta creada: El usuario es creado en la aplicación. \n2. Home \n2.1 Visualizar Viajes a realizar \n2.1.1 Descripción \nEl usuario conductor debe tener la capacidad de visualizar los viajes \nasignados y programados en su aplicación móvil. Esta funcionalidad le \nproporciona al conductor una visión clara de los viajes que debe \ncompletar y la información relevante asociada con cada uno. \n93 \n\n2.1.2 Input \nPrecondición: El usuario debe haber iniciado sesión \n2.1.3 Procesamiento \nI. Se recolecta todos los viajes asociados al usuario conductor \nII. En base a los viajes encontrados, se filtran los que están sin \nrealizar y se ordena por fecha en orden ascendiente \nIII. Luego, presenta esta información de manera clara y organizada \nen la interfaz de usuario del conductor para su visualización. \n2.1.4 Salida \nLista de viajes a realizar: Como resultado, el conductor puede ver todos \nlos detalles de los viajes asignados y programados, lo que incluye la hora \nde inicio, la ubicación de recogida y entrega, y cualquier información \nadicional relevante. \n2.2 Agregar Vehículo Activo \n2.2.1 Descripción \nEl usuario conductor tiene la capacidad de agregar un vehículo activo a \nsu perfil en la aplicación móvil. Esto es necesario para que la plataforma \npueda asignar viajes al vehículo del conductor y garantizar una \nexperiencia de transporte fluida para los usuarios. \n2.2.2 Input \nPrecondición: Debe haber al menos una patente cargada a la cuenta \ndel usuario activo \n \nPatente del vehículo: El conductor carga el vehículo que va a utilizar. \n2.2.3 Procesamiento \nI. Cuando el conductor proporciona la patente del vehículo, la \naplicación móvil valida la información y la asocia correctamente \ncon el perfil del conductor.  \nII. Luego, se registra el vehículo como activo en la base de datos del \nsistema. \n94 \n\n2.2.4 Salida \nVehículo activo: Como resultado, el vehículo proporcionado por el \nconductor se registra con éxito como activo en su perfil. \n \n2.3 Remover Vehículo Activo \n2.3.1 Descripción \nEl usuario conductor tiene la capacidad de remover un vehículo activo \nde su perfil en la aplicación móvil. Esto puede ser necesario en caso de \nque el conductor desee retirar un vehículo de su disponibilidad o en \nsituaciones en las que el vehículo ya no está en servicio. \n2.3.2 Input \nPrecondición: Tiene que haber un vehículo activo \n \nRemover vehículo: Confirmación para remover el vehículo activo. \n \n2.3.3 Procesamiento \nI. Cuando el conductor confirma la eliminación del vehículo activo, \nla aplicación móvil cambia el estado del vehículo a inactivo en su \nperfil.  \nII. Esta información se vé reflejada para los administradores \n2.3.4 Salida \nVehículo inactivo: Como resultado, el vehículo activo se marca como \ninactivo en el perfil del conductor en la aplicación móvil. Aunque ya no \nestá activo, sigue siendo elegible para recibir asignaciones de viajes en \nla plataforma. \n95 \n\n \n3. Mensajes \n3.1 Ver Mensajes \n3.1.1 Descripción \nEl usuario conductor tiene la capacidad de ver los mensajes recibidos \nen la aplicación móvil. Esto le permite mantenerse informado sobre \ncualquier comunicación importante relacionada con sus viajes o su \ncuenta de conductor. \n3.1.2 Input \nPrecondición: Usuario con sesión iniciada \n3.1.3 Procesamiento \nI. La aplicación móvil del conductor accede a la base de datos para \nrecuperar los mensajes recibidos.  \nII. Luego, presenta estos mensajes de manera clara y organizada en \nla interfaz de usuario del conductor para su visualización. \n3.1.4 Salida \nLista de mensajes: Como resultado, el conductor puede ver todos los \nmensajes recibidos, lo que incluye comunicaciones sobre cambios en \nlos viajes, actualizaciones del sistema o cualquier otra información \nrelevante. \n3.2 Marcar como leído los Mensajes \n3.2.1 Descripción \nEl usuario conductor tiene la capacidad de leer los mensajes que ha \nrecibido en la aplicación móvil y automáticamente se marcarán como \nvisto. Esto le permite mantener un registro claro de los mensajes que ha \nvisto y los que aún están pendientes de revisión. \n3.2.2 Input \nPrecondición: Tiene que haber un mensaje sin ver \n \n96 \n\n3.2.3 Procesamiento \nI. Se presentan detalles de un mensaje que no fue visto con \nanterioridad. \nII. Envío automático de solicitud para marcar como visto dicho \nmensaje. \nIII. Actualización en la base de datos. \n3.2.4 Salida \nMensaje visto: Como resultado, el mensaje visualizado se marca como \nleído en la interfaz de usuario del conductor. Esto ayuda al conductor a \nmantenerse organizado y al tanto de la comunicación relevante. \n \n3.3 Notificaciones push \n3.3.1 Descripción \nEl usuario conductor tiene la opción de recibir notificaciones push en \ntiempo real en su dispositivo móvil. Estas notificaciones proporcionan \nactualizaciones instantáneas sobre nuevos viajes, cambios en los viajes \nexistentes y cualquier otra información importante relacionada con su \ncuenta de conductor. \n3.3.2 Input \nPrecondición: Alguno de los servicios de Universal, tuvo que haber \nenviado una notificación al usuario conductor. \n3.3.3 Procesamiento \nI. Al iniciar sesión, se genera y almacena un token que permite \nrecibir notificaciones.  \nII. Cuando se detecta un evento de notificación push, esta se envía \nde inmediato al dispositivo del conductor.  \nIII. Al hacer clic en la notificación, se redirige automáticamente a \nuna sección específica de la aplicación correspondiente al evento \nrecibido. \n3.3.4 Salida \nNotificación push: Como resultado, el conductor recibe notificaciones \npush en su dispositivo móvil según la configuración y los eventos \ndefinidos en la aplicación. Esto garantiza que esté siempre al tanto de la \ninformación relevante en tiempo real. \n97 \n\n \n \n4. Viaje \n4.1 Aceptar Viaje \n4.1.1 Descripción \nEl usuario conductor debe tener la capacidad de aceptar los viajes \nasignados en la aplicación móvil. Esto permite al conductor confirmar \nsu disponibilidad para realizar el viaje y comenzar la preparación \nnecesaria. \n4.1.2 Input \nPrecondición: El usuario tiene que tener un viaje asignado a él \n \nConfirmar viaje: Confirmación de aceptación del viaje. \n4.1.3 Procesamiento \nI. Al confirmar la aceptación, la aplicación registra la respuesta del \nconductor y procede a preparar el viaje para su inicio. \nII. Se actualiza la entidad del viaje, permitiendo al administrador ver \nque el conductor aceptó \nIII. El cliente puede ver quién es el conductor asignado \n4.1.4 Salida \nViaje aceptado: Como resultado, el viaje asignado se marca como \naceptado por el conductor en la plataforma, lo que indica su \ndisponibilidad para realizar el viaje. \n4.2 Rechazar Viaje \n4.2.1 Descripción \nEl usuario conductor debe tener la capacidad de rechazar los viajes \nasignados en la aplicación móvil. Esto permite al conductor confirmar \nque no va a realizar el viaje. \n4.2.2 Input \nPrecondición: El usuario tiene que tener un viaje asignado a él \n98 \n\n \nRechazar viaje: Confirmación del rechazo del viaje. \n4.2.3 Procesamiento \nI. Al confirmar el rechazo, la aplicación registra la respuesta del \nconductor \nII. Se notifica al administrador la decisión del conductor. \n4.2.4 Salida \nViaje rechazado: Como resultado, el viaje asignado se marca como \nrechazado en la plataforma. \n4.3 Ver Detalles del Viaje a realizar \n4.3.1 Descripción \nEl usuario conductor tiene la capacidad de ver los detalles completos de \nlos viajes asignados en la aplicación móvil. Esto le proporciona al \nconductor información importante sobre la ubicación de recogida, la \nubicación de entrega, la hora de inicio y cualquier otra instrucción \nrelevante. \n4.3.2 Input \nPrecondición: Tiene que haber un viaje asignado al usuario y aceptado. \n \n4.3.3 Procesamiento \nI. Cuando se muestra un viaje asignado al conductor, la aplicación \nmóvil accede a la base de datos para recuperar los detalles \ncompletos del viaje. \nII. Luego, presenta esta información de manera clara y organizada \nen la interfaz de usuario del conductor. \n4.3.4 Salida \nDetalles del viaje: El conductor puede ver todos los detalles del viaje \nasignado, lo que le permite prepararse adecuadamente para el mismo. \n \n99 \n\n4.4 Chat con el Pasajero \n4.4.1 Descripción \nEl usuario conductor puede iniciar un chat con el pasajero asignado \npara el viaje. Esta función se habilita automáticamente 15 minutos antes \ndel inicio del viaje para permitir la comunicación entre el conductor y el \npasajero en caso de necesidad de coordinación o aclaración de detalles. \n4.4.2 Input \nPrecondición: Debe haber un viaje activo y en camino. \n \nChat: Mensaje con el pasajero. \n4.4.3 Procesamiento \nI. La aplicación móvil habilita automáticamente el chat entre el \nconductor y el pasajero 15 minutos antes del inicio del viaje.  \nII. Ambas partes pueden intercambiar mensajes en tiempo real \npara coordinar detalles de encuentro, preguntas o cualquier otro \nasunto relacionado con el viaje. \nIII. Una vez pasados los 15 minutos, se elimina el chat \n4.4.4 Salida \nChat: Como resultado, el conductor y el pasajero pueden comunicarse \nde manera efectiva antes del inicio del viaje, lo que ayuda a garantizar \nuna experiencia de viaje fluida. \n4.5 Iniciar Viaje \n4.5.1 Descripción \nEl usuario conductor tiene la capacidad de iniciar el viaje una vez que \nestá listo para comenzar. Esto marca oficialmente el inicio del viaje y \nactiva el cronómetro de tiempo de viaje. \n4.5.2 Input \nPrecondiciones: Debe haber un viaje asignado al conductor con el \nestado de “Despachado” \n \nBotón iniciar viaje: Confirmación de inicio del viaje. \n100 \n\n4.5.3 Procesamiento \nI. Cuando el conductor está listo para comenzar el viaje, selecciona \nla opción para iniciar el viaje en la aplicación móvil.  \nII. La aplicación registra la hora de inicio del viaje y comienza a \nrastrear el tiempo de viaje. \nIII. Se le notifica al cliente que el conductor emprendió el camino al \npunto de origen \nIV. La ubicación del conductor empieza a trazarse y ser visible para el \nadministrador \n4.5.4 Salida \nViaje iniciado: Como resultado, el viaje se marca oficialmente como \niniciado en la plataforma, lo que indica que el conductor ha comenzado \na llevar al pasajero a su destino. \n4.6 Finalizar el Viaje Automáticamente \n4.6.1 Descripción \nEl viaje se finaliza automáticamente una vez que se alcanza el destino \nfinal del pasajero. Esto garantiza que el viaje se complete correctamente \ny se registre el tiempo y la finalización del mismo. \n4.6.2 Input \nPrecondición: Tiene que haber un viaje en camino al último destino \n \nUbicación del conductor: Al estar a una distancia cercana del destino, \nse cambia de manera automática el estado del viaje \n4.6.3 Procesamiento \nI. Cuando el vehículo llega al destino final del pasajero, la aplicación \nmóvil detecta automáticamente esta ubicación y finaliza el viaje \nen la plataforma.  \nII. Se registra la hora de finalización del viaje y se cierra \nautomáticamente. \n4.6.4 Salida \nViaje finalizado: Como resultado, el viaje se marca como completado en \nla plataforma y se registra la hora de finalización del mismo. \n101 \n\n4.7 Finalización del Viaje \n4.7.1 Descripción \nEl usuario conductor tiene la capacidad de finalizar manualmente el \nviaje en caso de necesidad, incluso si no se ha finalizado \nautomáticamente. Esto puede ser útil en situaciones excepcionales que \nrequieran intervención del conductor. \n4.7.2 Input \nPrecondición: Debe haber un viaje en camino \n \nBotón de cerrar viaje: Confirmación para finalizar manualmente el \nviaje. \n4.7.3 Procesamiento \nI. Cuando el conductor selecciona la opción para finalizar \nmanualmente el viaje en la aplicación móvil, la aplicación registra \nla hora de finalización del viaje y lo cierra en la plataforma. \nII. Se le notifica al cliente la finalización del viaje \n4.7.4 Salida \nViaje finalizado: Como resultado, el viaje se marca como completado \nen la plataforma, incluso si no se ha finalizado automáticamente, y se \nregistra la hora de finalización del mismo. \n \n4.8 Agregar gastos adicionales al Viaje \n4.8.1 Descripción \nEl usuario conductor tiene la capacidad de agregar gastos adicionales al \nviaje en caso de que el pasajero lo solicite o lo requiera. Esto puede \nincluir paradas adicionales, cambios en la ruta o cualquier otro servicio \nadicional ofrecido por el conductor. \n4.8.2 Input \nPrecondición: Debe haber un viaje finalizado \n \nGastos Adicionales: Carga manual de los gastos adicionales con un \nnombre y monto. Se debe adjuntar una imagen que respalde el monto \ncargado \n102 \n\n4.8.3 Procesamiento \nI. Cuando el conductor finaliza un viaje, se le presenta la opción de \nagregar gastos adicionales \nII. Se verifica que los campos cargados sean completos y válidos \nIII. Se actualiza la entidad del viaje \n \n4.8.4 Salida \nGastos adicionales: Como resultado, los servicios adicionales se \nagregan al viaje y se registran correctamente en la plataforma, lo que \ngarantiza que el conductor y el pasajero estén informados sobre \ncualquier cambio en el viaje. \n \nCierre de viaje: La entidad del viaje se actualiza al estado de “Cierre de \nconductor” \n \n4.9 Seguimiento en tiempo real \n4.9.1 Descripción \nCon el fin de que los administradores puedan realizar un seguimiento \nen tiempo real de la ubicación del conductor y del pasajero durante el \nviaje, es necesario obtener la geolocalización del dispositivo móvil. \n4.9.2 Input \nPrecondición: Debe haber un viaje en curso. El usuario debe haber \naceptado que el dispositivo haga seguimiento de su ubicación \n \nUbicación del dispositivo móvil:  La aplicación hará uso de la ubicación \ndel usuario mediante sus coordenadas \n \nVelocímetro del dispositivo móvil: La aplicación capta la velocidad a la \nque iba el conductor al momento de realizar el capturado de la \ninformación \n4.9.3 Procesamiento \nI. Al comenzar el viaje, la aplicación emite coordenadas de la \nubicación del dispositivo \nII. Por cada coordenada, se agrega la velocidad a la que se \nmovilizaba el conductor \n103 \n\nIII. Las coordenadas y velocidades son almacenadas en conjunto con \nla hora en la que se emitió  \n4.9.4 Salida \nTrazabilidad del conductor: Como resultado, se tiene un conjunto de \ncoordenadas que describen el camino, al mismo tiempo que la \nvelocidad a la que transitaba el conductor \n \n5. Liquidación \n5.1 Visualizar Liquidación \n5.1.1 Descripción \nEl usuario conductor debe tener la capacidad de visualizar la liquidación \nde servicios realizados en la aplicación móvil. Esto proporciona al \nconductor información detallada sobre los ingresos generados por los \nservicios prestados en un período de tiempo específico. \n5.1.2 Input \nPrecondición: El usuario debe contar con una cuenta válida.  \n5.1.3 Procesamiento \nI. La aplicación accede a la base de datos para recuperar los datos \nde liquidación asociados con el conductor.  \nII. Se obtiene una lista de servicios realizados y los ingresos \ngenerados por cada servicio en un período de tiempo específico.  \nIII. Se calcula el total de ingresos generados en el período de tiempo \nespecificado.  \nIV. La aplicación presenta esta información de manera clara y \norganizada en la interfaz de usuario del conductor para su \nvisualización. \n5.1.4 Salida \nLista de servicios liquidados: El conductor puede ver una lista \ndetallada de los servicios realizados, los ingresos generados por cada \nservicio y el total de ingresos en un período de tiempo específico. \n104 \n\n5.2 Servicios Sin Liquidar \n5.2.1 Descripción \nEl usuario conductor debe poder identificar los servicios que aún no han \nsido liquidados en la aplicación móvil. Esto le permite al conductor \nrealizar un seguimiento de los servicios pendientes de facturación y \nasegurarse de que todos los servicios sean correctamente registrados y \nliquidados. \n5.2.2 Input \nPrecondición: Debe haber al menos un servicio sin liquidar \n5.2.3 Procesamiento \nI. La aplicación accede a la base de datos para recuperar la lista de \nservicios que aún no han sido liquidados para el conductor. \nII. Se identifican los servicios pendientes de liquidación y se envían \nal usuario del conductor. \n5.2.4 Salida \nLista de servicios sin liquidar: El conductor puede ver una lista de los \nservicios que aún no han sido liquidados, lo que le permite tomar las \nmedidas necesarias para completar el proceso de liquidación. \n \n5.3 Filtrar y Ordenar Servicios Sin Liquidar \n5.3.1 Descripción \nEl usuario conductor debe tener la capacidad de filtrar y ordenar los \nservicios sin liquidar en la aplicación móvil. Esto le proporciona al \nconductor la flexibilidad para organizar la lista de servicios pendientes \nde acuerdo a diferentes criterios, como la fecha del servicio o el estado \nde liquidación. \n5.3.2 Input \nPrecondición: Debe haber al menos un servicio sin liquidar \n \nOpciones de filtro: Por fecha, por vehículo \n \nOpciones de ordenamiento: Por fecha, por vehículo, por monto \n105 \n\n5.3.3 Procesamiento \nI. La aplicación permite al conductor seleccionar opciones de filtro \ny criterios de ordenamiento desde la interfaz de usuario.  \nII. Se aplican los filtros seleccionados para mostrar solo los servicios \nsin liquidar que cumplen con los criterios especificados.  \nIII. Se ordenan los servicios sin liquidar según el criterio de \nordenamiento seleccionado por el conductor.  \nIV. La aplicación actualiza la lista de servicios sin liquidar en la \ninterfaz de usuario según los filtros y el ordenamiento aplicados. \n5.3.4 Salida \nLista de servicios filtrados u ordenados: El conductor puede aplicar \nfiltros y criterios de ordenamiento para visualizar los servicios sin liquidar \nde manera más efectiva, lo que facilita la gestión y seguimiento de los \nservicios pendientes. \n5.4 Detalles de liquidación \n5.4.1 Descripción \nEl conductor debe poder acceder y examinar los detalles específicos de \nuna liquidación en particular. Esto le permite comprender y analizar \nminuciosamente los aspectos relevantes de dicha liquidación. \n5.3.2 Input \nPrecondición: Debe existir una liquidación de la cual se va a ver el \ndetalle \n5.3.3 Procesamiento \nI. En base al ID de la liquidación de la cual el usuario quiere \nconocer más detalles, se valida que quien quiere acceder tiene \nlos permisos necesarios \nII. Una vez validado que la persona tiene los permisos necesarios, \ntransforma la información para ser enviada al cliente \n5.3.4 Salida \nDetalles de liquidación: El conductor puede aplicar filtros y criterios de \nordenamiento para visualizar los servicios sin liquidar de manera más \nefectiva, lo que facilita la gestión y seguimiento de los servicios \npendientes. \n \n106 \n\n6. Mi cuenta \n6.1 Actualizar Mis Datos \n6.1.1 Descripción \nLos usuarios tendrán la capacidad de personalizar su perfil dentro de la \naplicación móvil mediante la carga y visualización de una imagen que \nrepresente su identidad, Nombre y apellido, DNI, Correo electrónico y \nteléfono de contacto. Esta funcionalidad garantiza una experiencia de \nusuario más personalizada. \n6.1.2 Input \nPrecondición: El usuario debe tener una cuenta en la aplicación. \n \nNombre y apellido: El usuario ingresa el nuevo nombre y apellido que \ndesea que figure en la aplicación \n \nDNI: El usuario puede actualizar su número de DNI en caso de que haya \nsido cargado erróneamente \n \nCorreo electrónico: Solamente se puede visualizar. \n \nTeléfono: Se debe seleccionar el prefijo, en base a una lista y escribir el \nnúmero de teléfono \n \nFoto de perfil: Acceso a la cámara o biblioteca del teléfono \n6.1.3 Procesamiento \nI. Verificar que todos los campos estén completos y que el formato \nsea válido \nII. Comparar los valores de los campos existentes contra los que  \ncambiaron \nIII. Actualizar la base de datos con los nuevos valores \n6.1.4 Salida \nInformación actualizada: El perfil del usuario cuenta con la información \nactualizada del campo que el usuario haya realizado los cambios \n \n107 \n\n6.2 Agregar fecha e imagen de documentos solicitados \n6.2.1 Descripción \nEl usuario conductor debe poder visualizar y actualizar las distintas \ndocumentaciones solicitadas por Universal, como el curso de defensa, el \nexamen médico y el monotributo. Estas podrán ser modificables según \nel caso. \n6.2.2 Input \nImagen o archivo: El conductor tiene la posibilidad de cargar una foto \nde la biblioteca del dispositivo o utilizar la cámara para digitalizar la \ndocumentación solicitada. \n \nMás información: Según la documentación a cargar, pueden variar los \ncampos que se soliciten. \n \n6.2.3 Procesamiento \nI. Se busca en la base de datos la documentación requerida para el \nconductor.  \nII. Con base en la información necesaria, se envían tanto los \ndocumentos ya completados como los faltantes al conductor.  \nIII. Si el usuario desea cargar o actualizar la documentación, se le \nindica qué información se necesita para su almacenamiento.  \nIV. Posteriormente, se valida que los datos cargados sean válidos y se \nregistra la última fecha de modificación. \n6.2.4 Salida \nLista de documentos actualizada: Los datos y las imágenes de los \ndocumentos solicitados se registran correctamente en la base de datos \ny están disponibles para su visualización en el perfil del conductor. \n6.3 Visualizar Mis Vehículos \n6.3.1 Descripción \nEl usuario conductor debe tener la capacidad de visualizar los vehículos \nasociados a su cuenta en la aplicación móvil. Esto le permite mantener \nun registro de los vehículos registrados y gestionarlos según sea \nnecesario. \n108 \n\n6.3.2 Input \nPrecondición: El usuario debe tener al menos un vehículo asociado \n \n6.3.3 Procesamiento \nI. La aplicación accede a la base de datos para recuperar la lista de \nvehículos asociados a la cuenta del conductor. \nII. Luego, muestra esta información en la interfaz de usuario para su \nvisualización. \n6.3.4 Salida \nLista de vehículos: El conductor puede ver una lista de los vehículos \nregistrados en su cuenta, lo que le permite gestionarlos y mantener la \ninformación actualizada según sea necesario. \n \n6.4 Cambiar contraseña \n6.4.1 Descripción \nEl usuario puede cambiar su contraseña de ingreso. Para eso debe \ningresar su contraseña actual, la nueva contraseña y una confirmación \nde la contraseña para evitar errores. \n6.4.2 Input \nContraseña actual: El usuario ingresa su contraseña actual para validar \nsu identidad. \n \nNueva contraseña: El usuario ingresa la nueva contraseña que desea \nestablecer. \n \nConfirmación de la nueva contraseña: El usuario ingresa nuevamente \nla nueva contraseña para confirmar que no hay errores de tipeo. \n6.4.3 Procesamiento \nI. Verificar que el usuario está autenticado y tiene acceso para \ncambiar su contraseña. \nII. Validar que la contraseña actual ingresada por el usuario coincida \ncon la registrada en el sistema. \nIII. Comprobar que la nueva contraseña y su confirmación coinciden \npara evitar errores de tipeo. \n109 \n\nIV. Verificar que la nueva contraseña cumpla con las políticas de \nseguridad (longitud, complejidad, etc.). \nV. Actualizar la contraseña del usuario en la base de datos con la \nnueva contraseña proporcionada. \n6.4.4 Salida \nConfirmación de cambio de contraseña: Mensaje de éxito indicando \nque la contraseña se ha cambiado correctamente. \n \n6.5 Solicitar Alta de vehículo \n6.5.1 Descripción \nEl usuario conductor tiene la posibilidad de solicitar el registro de un \nnuevo vehículo para que un usuario administrador lo evalúe y apruebe. \nEsta función añade una capa adicional de flexibilidad y control sobre la \nflota vehicular del conductor. Al permitir que el conductor gestione la \nincorporación de vehículos, se fomenta un ambiente más ágil y \neficiente, donde las necesidades específicas del usuario pueden ser \natendidas de manera rápida y precisa. \n6.5.2 Input \nPrecondición: El usuario tiene que tener una cuenta activa. Los campos \nreferidos a Marca, Modelo, Color, Tipo de combustible, Categoría, \nSeguros y Atributos, tienen que haber sido creados en la sección de \nABM por un administrador. \n \nDatos del vehículo: El usuario cliente tiene que cargar Marca, Modelo, \nPatente, Año, color, Tipo de combustible, Categoría, Seguro y Atributos \n \n6.5.3 Procesamiento \nI. Verificar que los campos cargados por el usuario estén completos \ny sean válidos. \nII. La entidad creada es visible para el operador encargado de \nvalidarla. \nIII. La entidad creada es visible para el usuario cliente como \"Bajo \nrevisión\". \n110 \n\n6.5.4 Salida \nSolicitud de alta de vehículo: Se genera una solicitud para la creación \nde un nuevo vehículo, la cual será sometida a la validación por parte del \nequipo de administración. \n \n \nOtros Requerimientos \n1 Protección de datos personales \n1.1 Descripción \nEste proceso asegura la protección y privacidad de los datos personales \nde los usuarios conforme a las normativas legales aplicables. Incluye \nmedidas técnicas y organizativas para prevenir el acceso no autorizado, \nla divulgación, alteración o destrucción de datos personales. \n1.2 Input \nPrecondiciones: Datos personales recogidos a través del sistema \n(nombre, dirección, email, número de teléfono, etc.). \n \nRequerimientos de cumplimiento: Normativas específicas de \nprotección de datos que el sistema debe seguir. \n1.3 Procesamiento \nI. Evaluación de riesgos: Identificar y evaluar riesgos asociados con \nel procesamiento de datos personales. \n \nII. Implementación de medidas de seguridad: Aplicar controles \ntécnicos como cifrado, autenticación de dos factores, y auditorías \nde seguridad regularmente. \n \nIII. Políticas de privacidad y acceso: Establecer políticas claras sobre \nquién puede acceder a los datos personales y bajo qué \ncircunstancias. \n \nIV. Formación y concienciación: Capacitar a empleados y usuarios \nsobre la importancia de la protección de datos y las prácticas \nseguras. \n111 \n\n1.4 Salida \nDocumentación de cumplimiento: Informes y registros que \ndemuestran el cumplimiento de las normativas de protección de datos. \nNotificaciones de privacidad actualizadas: Documentos actualizados y \naccesibles que informan a los usuarios sobre cómo se manejan sus \ndatos personales. \n \nReportes de auditoría de seguridad: Resúmenes de las auditorías \nrealizadas y las medidas tomadas para asegurar la protección de datos. \n2 Migración de datos históricos \n2.1 Descripción \nEste proceso abarca el traslado de datos históricos desde el sistema \nantiguo de Uappinn al desarrollado por Sirius, con el objetivo de \nmantener la continuidad de la información y garantizar que el nuevo \nsistema tenga acceso completo a los datos necesarios para operaciones \nfuturas. La migración debe ser cuidadosa para asegurar la integridad, \nexactitud y accesibilidad de los datos en el nuevo entorno. En esta \nmigración se contempla únicamente la información perteneciente a la \nidentidad de los clientes y a los viajes que estén en curso o despachados \na la hora de hacer la migración, por lo que toda la información histórica, \nno se tendrá en cuenta para su migración al nuevo sistema a \nimplementar. \n2.2 Input \nPrecondiciones: Disponibilidad de datos históricos. \n \nFormato y estructura de datos de origen: Formatos variados de los \nsistemas antiguos que pueden requerir conversión o adaptación. \n2.3 Procesamiento \nI. Extracción de datos: Recolectar los datos de los backups del \nsistema antiguo. \n \nII. Limpieza de datos: Procesar los datos para corregir inexactitudes, \neliminar duplicados y prepararlos para la migración. \n \n112 \n\nIII. Transformación: Modificar los datos para cumplir con los \nrequisitos del nuevo sistema, incluyendo cambios de formato, \ncodificación y adaptación de estructuras de datos. \n \nIV. Carga en la nueva base de datos: Importar los datos limpios y \ntransformados al nuevo sistema. \n \nV. Verificación y validación: Realizar pruebas para asegurar que los \ndatos migrados son exactos y completos. Resolver cualquier \nproblema detectado. \n2.4 Salida \nDatos integrados en el nuevo sistema: Los datos históricos están \ncompletamente accesibles y operativos dentro del nuevo sistema, \npermitiendo la continuidad de las operaciones. \n3 Documentación de usuario \n3.1 Descripción \nImplica la creación y mantenimiento de manuales y guías que facilitan a \nlos usuarios finales el uso efectivo del sistema. La documentación de \nusuario incluye instrucciones paso a paso, explicaciones de las funciones \ny características del sistema, y soluciones a problemas comunes, todo \ndestinado a mejorar la experiencia del usuario y proporcionar apoyo \npara la autoayuda. \n3.2 Input \nPrecondiciones: Existencia de las aplicaciones cuyas funciones \nnecesitan ser documentadas. \n \nRequisitos de documentación: Información sobre las características, \nfuncionalidades y flujos de trabajo del sistema que necesitan ser \nexplicados. \n3.3 Procesamiento \nI. Recopilación de información: Obtener detalles completos sobre \nlas funcionalidades del sistema de los diseñadores y \ndesarrolladores. \n \n113 \n\nII. Elaboración de contenido: Escribir la documentación utilizando \nun lenguaje claro y accesible, incluyendo capturas de pantalla, \ndiagramas y ejemplos prácticos. \n \nIII. Revisión y edición: Revisar el contenido para asegurar su \nprecisión y facilidad de comprensión. Incorporar feedback de \nusuarios preliminares para mejorar la claridad y utilidad de los \ndocumentos. \n \nIV. Formateo y publicación: Formatear la documentación de acuerdo \ncon las normas establecidas y publicarla en formatos accesibles \npara los usuarios, como PDF, páginas web, o dentro de una \naplicación de ayuda. \n3.4 Salida \nManuales de usuario y guías: Documentos completos que \nproporcionan toda la información necesaria para que los usuarios \nutilicen el sistema eficientemente. \n4 Despliegue en plataformas digitales \n4.1 Descripción \nEste requerimiento implica la publicación y actualización de las \naplicaciones móviles en plataformas digitales específicas, como Apple \nApp Store y Google Play Store. El objetivo es asegurar que las \naplicaciones sean accesibles para los usuarios finales en dispositivos iOS \ny Android, cumpliendo con todas las directrices y requerimientos de \ncada plataforma para la aceptación y distribución de apps. \n4.2 Input \nPrecondiciones: Aplicación móvil desarrollada y probada que cumple \ncon las políticas y requisitos técnicos de Apple App Store y Google Play \nStore. \n \nDocumentación necesaria: Metadatos de la aplicación (descripción, \ncategorías, imágenes de pantalla, iconos), detalles de la cuenta del \ndesarrollador en cada tienda, y certificados de firma de aplicación. \nTérminos y condiciones de uso de la aplicación. \n114 \n\n4.3 Procesamiento \nI. Preparación de la aplicación: Compilar y firmar la aplicación con \ncertificados válidos para iOS y Android. \n \nII. Creación de listados de aplicaciones: Completar los perfiles de la \naplicación en ambas tiendas, incluyendo descripciones, palabras \nclave y capturas de pantalla \n \nIII. Subida de la aplicación: Cargar los archivos binarios de la \naplicación a las plataformas de distribución correspondientes \nmediante sus respectivos portales para desarrolladores. \n \nIV. Proceso de revisión: Supervisar el proceso de revisión de cada \nplataforma, que puede incluir la verificación de cumplimiento de \nlas políticas de contenido y funcionalidad. \n \nV. Gestión de lanzamiento: Programar la fecha de lanzamiento y \nconfigurar opciones adicionales como la disponibilidad \ngeográfica. \n4.4 Salida \nAplicaciones publicadas: Las aplicaciones están disponibles en la \nApple App Store y Google Play Store para su descarga por parte de los \nusuarios. \n \nEnlace de la aplicación: URL directas a las listas de la aplicación en \nambas tiendas para promoción y referencia. \n \n \n5 Respaldo y restauración de datos \n5.1 Descripción \nEste proceso es fundamental para garantizar la integridad y \ndisponibilidad de los datos en caso de un incidente que cause pérdida \nde datos, como fallos del sistema, ataques cibernéticos o desastres \nnaturales. Incluye la implementación de políticas y procedimientos de \nrespaldo regular y sistemático de datos, así como la capacidad de \nrestaurar esos datos de manera rápida y eficaz para minimizar el tiempo \nde inactividad y la pérdida de información. \n115 \n\n \n5.2 Input \nPrecondiciones: Existencia de datos críticos que necesitan ser \nprotegidos, incluyendo bases de datos, documentos, archivos de \nconfiguración, y registros de usuario. \n \nPolíticas de respaldo: Definiciones de qué datos se deben respaldar, \ncon qué frecuencia, y a qué ubicaciones. \n \n5.3 Procesamiento \nI. Planificación de respaldo: Establecer y documentar el \ncronograma de respaldos y los métodos, incluyendo respaldos \ncompletos, incrementales o diferenciales. \n \nII. Ejecución de respaldos: Realizar los respaldos según la \nplanificación, utilizando herramientas de software que \nautomatizan el proceso y aseguran la encriptación y seguridad de \nlos datos. \n \nIII. Monitorización y validación: Supervisar los procesos de respaldo \npara asegurar su completitud y validez, incluyendo pruebas \nregulares de los respaldos para verificar su integridad y la \nefectividad de la restauración. \n \nIV. Restauración: Implementar procedimientos para recuperar y \nrestaurar datos desde los respaldos cuando sea necesario, \nasegurando que los sistemas puedan volver a estar operativos \nrápidamente después de una pérdida de datos. \n \n5.4 Salida \nCopias de seguridad creadas: Archivos de respaldo almacenados de \nmanera segura y accesible. \n \nRegistros de respaldo: Informes detallados sobre los respaldos \nrealizados, incluyendo fechas, tipos y estados de los respaldos. \n \n \n \n116 \n\n \n \n117",
  "requirements": {
    "projectName": "Migración y Actualización del Sistema Uappinn a Sirius",
    "summary": "Este proyecto implica la migración de datos históricos y la actualización de las aplicaciones móviles de Uappinn a una nueva plataforma denominada Sirius. Se enfoca en mejorar la experiencia del usuario, asegurar la protección de datos personales, y facilitar la gestión de viajes, conductores y clientes mediante una interfaz más intuitiva y segura.",
    "goals": [
      "Migrar datos históricos relevantes al nuevo sistema Sirius",
      "Actualizar las aplicaciones móviles para clientes y conductores",
      "Implementar medidas de protección de datos personales conforme a normativas legales",
      "Facilitar la gestión y seguimiento de viajes, conductores y clientes",
      "Mejorar la experiencia de usuario con una interfaz más intuitiva y segura"
    ],
    "constraints": [
      "Preservar la integridad y seguridad de los datos durante la migración",
      "Cumplir con las políticas de publicación de aplicaciones en Apple App Store y Google Play Store",
      "Asegurar la compatibilidad de las nuevas aplicaciones con dispositivos iOS y Android",
      "Mantener la continuidad operativa durante la transición al nuevo sistema"
    ],
    "features": [
      "Migración de datos históricos de clientes y viajes en curso",
      "Actualización de aplicaciones móviles con nuevas funcionalidades y diseño mejorado",
      "Implementación de políticas de protección de datos personales",
      "Despliegue de las aplicaciones actualizadas en Apple App Store y Google Play Store",
      "Creación de documentación de usuario detallada para facilitar la transición al nuevo sistema",
      "Sistema de respaldo y restauración de datos para garantizar la seguridad de la información"
    ],
    "stakeholders": [
      "Clientes de Uappinn",
      "Conductores asociados a Uappinn",
      "Equipo de desarrollo de software",
      "Administradores de la plataforma",
      "Equipo de soporte técnico"
    ],
    "techHints": [
      "Plataformas iOS y Android para las aplicaciones móviles",
      "Herramientas de migración de datos",
      "Sistemas de gestión de bases de datos",
      "Herramientas de cifrado para la protección de datos",
      "API de Google Maps para servicios de geolocalización"
    ]
  },
  "clarifications": [
    "¿Cuál es el presupuesto del proyecto o restricción de costos? (ej: $X/mes para hosting, $Y presupuesto total)",
    "¿Cuál es el plazo o fecha límite objetivo para este proyecto? (ej: lanzamiento en 6 semanas, MVP en 3 meses)",
    "¿Cuál es la escala de usuarios o tráfico esperado? (ej: 100 usuarios, 10K usuarios activos diarios, 1M visitas/mes)"
  ],
  "answers": {
    "¿Cuál es el presupuesto del proyecto o restricción de costos? (ej: $X/mes para hosting, $Y presupuesto total)": "No especificado",
    "¿Cuál es el plazo o fecha límite objetivo para este proyecto? (ej: lanzamiento en 6 semanas, MVP en 3 meses)": "No especificado",
    "¿Cuál es la escala de usuarios o tráfico esperado? (ej: 100 usuarios, 10K usuarios activos diarios, 1M visitas/mes)": "No especificado"
  },
  "tickets": [
    {
      "id": "TICKET-001",
      "title": "Planificar la migración de datos históricos",
      "description": "Definir el alcance, estrategia y herramientas necesarias para la migración de datos históricos de clientes y viajes en curso al nuevo sistema Sirius. Es crucial para preservar la integridad y seguridad de los datos durante la transición.",
      "acceptanceCriteria": [
        "Se ha definido un plan de migración detallado",
        "Se han identificado y evaluado las herramientas de migración de datos",
        "Se ha establecido un protocolo de seguridad para la migración"
      ],
      "effortPoints": 5,
      "useCase": "Migración de datos históricos de clientes y viajes en curso",
      "priority": "P1",
      "labels": [
        "backend",
        "data-migration",
        "security"
      ],
      "dependencies": []
    },
    {
      "id": "TICKET-002",
      "title": "Implementar la migración de datos históricos",
      "description": "Realizar la migración de datos históricos de clientes y viajes en curso al nuevo sistema Sirius, siguiendo el plan establecido en TICKET-001. Este paso es fundamental para asegurar la continuidad operativa y la integridad de los datos.",
      "acceptanceCriteria": [
        "Given los datos históricos en el sistema Uappinn, When se ejecuta el proceso de migración, Then todos los datos se encuentran disponibles en el sistema Sirius",
        "No hay pérdida de datos durante la migración",
        "La integridad de los datos se mantiene post-migración"
      ],
      "effortPoints": 8,
      "useCase": "Migración de datos históricos de clientes y viajes en curso",
      "priority": "P1",
      "labels": [
        "backend",
        "data-migration"
      ],
      "dependencies": [
        "TICKET-001"
      ]
    },
    {
      "id": "TICKET-003",
      "title": "Actualizar diseño y funcionalidades de la aplicación móvil",
      "description": "Rediseñar y desarrollar nuevas funcionalidades para las aplicaciones móviles de clientes y conductores, mejorando la experiencia de usuario y asegurando la compatibilidad con dispositivos iOS y Android.",
      "acceptanceCriteria": [
        "Las aplicaciones móviles tienen un diseño renovado y mejorado",
        "Se han implementado nuevas funcionalidades solicitadas",
        "Las aplicaciones son compatibles con las últimas versiones de iOS y Android"
      ],
      "effortPoints": 13,
      "useCase": "Actualizar las aplicaciones móviles para clientes y conductores",
      "priority": "P1",
      "labels": [
        "frontend",
        "mobile",
        "iOS",
        "Android"
      ],
      "dependencies": []
    },
    {
      "id": "TICKET-004",
      "title": "Implementar políticas de protección de datos personales",
      "description": "Desarrollar e integrar medidas de protección de datos personales en el sistema Sirius y las aplicaciones móviles, conforme a las normativas legales vigentes.",
      "acceptanceCriteria": [
        "El sistema y las aplicaciones cumplen con las normativas de protección de datos",
        "Los usuarios pueden acceder, rectificar y eliminar sus datos personales",
        "Se implementan medidas de cifrado y seguridad para la protección de datos"
      ],
      "effortPoints": 8,
      "useCase": "Implementación de políticas de protección de datos personales",
      "priority": "P1",
      "labels": [
        "backend",
        "security",
        "compliance"
      ],
      "dependencies": []
    },
    {
      "id": "TICKET-005",
      "title": "Desplegar aplicaciones actualizadas en tiendas de aplicaciones",
      "description": "Preparar y subir las versiones actualizadas de las aplicaciones móviles de clientes y conductores a la Apple App Store y Google Play Store, asegurando cumplir con sus políticas de publicación.",
      "acceptanceCriteria": [
        "Las aplicaciones actualizadas están disponibles en la Apple App Store",
        "Las aplicaciones actualizadas están disponibles en Google Play Store",
        "Se cumple con todas las políticas de publicación de ambas tiendas"
      ],
      "effortPoints": 5,
      "useCase": "Despliegue de las aplicaciones actualizadas en Apple App Store y Google Play Store",
      "priority": "P2",
      "labels": [
        "deployment",
        "mobile",
        "compliance"
      ],
      "dependencies": [
        "TICKET-003"
      ]
    },
    {
      "id": "TICKET-006",
      "title": "Crear documentación de usuario para el nuevo sistema",
      "description": "Desarrollar documentación detallada y guías de usuario para facilitar la transición de los usuarios al nuevo sistema Sirius, cubriendo las nuevas funcionalidades y cambios en la interfaz.",
      "acceptanceCriteria": [
        "Se dispone de guías de usuario para clientes y conductores",
        "La documentación explica las nuevas funcionalidades y cambios en la interfaz",
        "La documentación está disponible en formatos accesibles y fáciles de entender"
      ],
      "effortPoints": 3,
      "useCase": "Creación de documentación de usuario detallada para facilitar la transición al nuevo sistema",
      "priority": "P2",
      "labels": [
        "documentation",
        "user-support"
      ],
      "dependencies": [
        "TICKET-003"
      ]
    },
    {
      "id": "TICKET-007",
      "title": "Implementar sistema de respaldo y restauración de datos",
      "description": "Desarrollar e integrar un sistema de respaldo y restauración para el nuevo sistema Sirius, garantizando la seguridad y disponibilidad de la información en caso de incidentes.",
      "acceptanceCriteria": [
        "El sistema Sirius cuenta con un mecanismo de respaldo automático de datos",
        "Se pueden restaurar los datos a un estado anterior en caso de necesidad",
        "Los respaldos se almacenan de forma segura y cumplen con las políticas de protección de datos"
      ],
      "effortPoints": 8,
      "useCase": "Sistema de respaldo y restauración de datos para garantizar la seguridad de la información",
      "priority": "P1",
      "labels": [
        "backend",
        "data-management",
        "security"
      ],
      "dependencies": [
        "TICKET-004"
      ]
    }
  ],
  "justification": {
    "pros": [
      "Facilita la gestión del proyecto al dividir el trabajo en tareas específicas y manejables.",
      "Mejora la estimación de esfuerzos y recursos necesarios para cada parte del proyecto.",
      "Permite un seguimiento detallado del progreso y facilita la identificación de dependencias entre tareas.",
      "Aumenta la flexibilidad para asignar prioridades y reasignar recursos según sea necesario."
    ],
    "cons": [
      "Puede resultar en una sobrecarga administrativa al gestionar un gran número de tickets.",
      "Requiere una planificación inicial detallada para asegurar que todos los aspectos del proyecto estén cubiertos.",
      "La interdependencia entre tickets puede complicar la reprogramación si surge la necesidad de ajustar el alcance o las prioridades."
    ],
    "alternatives": [
      "Organizar el trabajo en fases o sprints, agrupando tickets relacionados para simplificar la gestión.",
      "Utilizar un enfoque más ágil, creando tickets más generales al principio y detallándolos a medida que el proyecto avanza."
    ]
  },
  "cost": {
    "tokensIn": 3647,
    "tokensOut": 2060,
    "usd": 0.09827
  },
  "createdAt": "2025-11-12T01:22:20.228Z",
  "updatedAt": "2025-11-12T01:24:08.498Z"
}