{
  "id": "f8edfac3-d2b0-4596-98b1-dfea38c0555f",
  "rawText": "Propuesta de trabajo \n \n \nRecorrido del Turista \nV1.0 \n \n \n \n11/11/2025 \n \nwww.sirius.com.ar \nParque Empresarial Austral (Av. Sgto. Cayetano Beliera 3025, Pilar). Edificio M3. \nadministracion@sirius.com.ar\n \n \n \n\n \nÍndice \nÍndice..............................................................................................................................................1\n \nObjetivo...................................................................................................................................2 \nAlcance..........................................................................................................................................2\n \nEntregables................................................................................................................................10\n \nEquipo..........................................................................................................................................10\n \nDuración......................................................................................................................................10\n \nMetodología de trabajo...........................................................................................................11\n \nCostos Estimados del Proyecto............................................................................................11\n \nConsideraciones........................................................................................................................11\n \n  \n \nRecorrido del Turista   V1.0                                                              1 \n\n \nObjetivo \nEl objetivo es desarrollar una plataforma que brinde a los turistas, tanto nacionales como \nextranjeros, una experiencia de recorrido por la Ciudad de Buenos Aires más dinámica, \ndivertida y guiada. A través de la gamificación, se busca incentivar a las personas a seguir \nexplorando, no solo los principales puntos turísticos, sino también las ofertas gastronómicas \ny culturales que cada destino tiene para ofrecer. \nAlcance \nPlataforma de Turista \nLa plataforma contará con una aplicación móvil disponible para Android y iOS destinada a \nlos usuarios turistas. \n \nRegistro e Inicio de Sesión \nLos usuarios podrán registrarse ingresando un nombre de usuario, correo electrónico y \ncontraseña. Esta información permitirá identificarlos dentro del sistema y asignarles los \ndistintos premios y reconocimientos disponibles en la plataforma. \nAdemás, se incorporará la opción de inicio de sesión social mediante una cuenta de Google, \nuno de los métodos más utilizados actualmente. Esta funcionalidad reducirá la fricción en el \nproceso de registro y mejorará la experiencia de incorporación a la aplicación. \n \nSoporte Multilenguaje \nDado que la República Argentina, y en especial la Ciudad de Buenos Aires, es un importante \ndestino turístico internacional, la aplicación ofrecerá soporte multilenguaje, permitiendo \nalternar entre español e inglés. \n \n \nRecorrido del Turista   V1.0                                                              2 \n\n \n \n \nMapa Interactivo \nLos usuarios registrados podrán acceder a un mapa interactivo con todos los puntos \nturísticos precargados desde la plataforma de administración.  \nEl mapa permitirá filtrar ubicaciones por categoría (como parques, monumentos, museos o \nrestaurantes) brindando a los usuarios una referencia clara sobre los lugares que pueden \nvisitar. \n \n \nRecorrido del Turista   V1.0                                                              3 \n\n \n \n \nListado de recorridos \nLa plataforma ofrecerá al usuario una serie de recorridos predefinidos, cargados previamente \npor la administración. Al iniciar uno de estos recorridos, el usuario podrá visualizar los \ndistintos puntos turísticos que debe visitar para desbloquear la insignia asociada al recorrido \nseleccionado. \nLos recorridos podrán clasificarse según su temática, ciudad o incluso por el medio de \ntransporte utilizado, permitiendo una experiencia más personalizada y organizada. \n \nIniciar Recorrido \nEl usuario podrá seleccionar e iniciar cualquiera de los recorridos disponibles. \nAl hacerlo, la plataforma mostrará cuántos puntos turísticos conforman el recorrido y cuál es \nel primer punto al que debe dirigirse. \nEn la pantalla principal se presentará un mapa con un indicador de progreso, donde se \nvisualizarán todos los puntos turísticos a visitar. \n \nRecorrido del Turista   V1.0                                                              4 \n\n \nAdemás, el usuario podrá acceder a una lista detallada de puntos turísticos, y al seleccionar \nuno, obtendrá más información sobre el mismo. \nPara evitar que los usuarios realicen trampas, la aplicación utilizará su ubicación geográfica \nen tiempo real. \nCuando el usuario se encuentre dentro del área cercana al punto turístico, se habilitará la \nopción “Marcar como visitado”, que permitirá cargar una foto como comprobante. \nEsta acción otorgará puntos adicionales y permitirá avanzar en la experiencia del recorrido. \n \n \n \nDetalle de Ubicación \nAl seleccionar una ubicación en el mapa, el usuario accederá a información detallada sobre \nel lugar, su dirección y fotografías tomadas por otros visitantes. \nAlgunos sitios contarán con una estampa coleccionable, que se mostrará en gris si aún no \nfue obtenida y en color una vez desbloqueada. \nPara conseguirla, la plataforma le presentará en que recorridos se pueden obtener dicho \ncoleccionable. \n \nRecorrido del Turista   V1.0                                                              5 \n\n \n \n \n \nListado de Coleccionables \nLa aplicación incluirá un listado de coleccionables obtenidos y no obtenidos por cada \nusuario. \nEstos coleccionables representarán lugares icónicos de la Argentina mediante ilustraciones \nque podrán ser generadas por IA o creadas por artistas locales, fomentando así un círculo \nvirtuoso que promueve el arte y talento de la comunidad. \nEl diseño del listado evocará la estética de un pasaporte turístico o álbum coleccionable, \nfortaleciendo el sentido de pertenencia y la conexión emocional del usuario con la \nexperiencia de completar su colección. \nLos logros podrán clasificarse por zonas de la ciudad o por tipo (restaurante, museo, \nmonumento, comercio, etc.), facilitando la exploración de los intereses personales de cada \nusuario. \n \nRanking de Usuarios \n \nRecorrido del Turista   V1.0                                                              6 \n\n \nLa aplicación contará con un ranking mensual que mostrará a los usuarios con la mayor \ncantidad de puntos acumulados. \nLos rankings estarán divididos en distintas categorías, como: \n● \nUsuarios con más recorridos completados \n● \nUsuarios que completaron recorridos en menor tiempo \n● \nUsuarios con mayor cantidad de coleccionables obtenidos \n \nEsta funcionalidad tiene como objetivo reforzar la gamificación de la experiencia, \npromoviendo una competencia sana entre los participantes y fomentando el sentido de \ncomunidad dentro de la plataforma. \n \n \nPerfil del Usuario \nCada usuario contará con un perfil dentro de la aplicación donde podrá visualizar su \nprogreso, los puntos obtenidos, los coleccionables desbloqueados y los eventos en los que \nparticipó. Además, tendrá la posibilidad de editar información básica como su nombre e \nidioma preferido. \nDesde esta sección también podrá configurar su privacidad, eligiendo si desea mostrarse o \nno en el ranking de usuarios o compartir sus fotos con la comunidad. Esta funcionalidad \nbusca reforzar el sentido de identidad dentro de la plataforma y permitir una experiencia \nmás personalizada según las preferencias de cada turista. \n \nNotificaciones Push \nLa aplicación contará con un sistema de notificaciones push que mantendrá informados a \nlos usuarios sobre novedades relevantes, como recordatorios para completar actividades \npendientes. \nEstas notificaciones también podrán utilizarse para felicitar a los usuarios por logros \nobtenidos o para motivarlos a continuar participando en la plataforma. De esta forma, se \nbusca mantener un contacto constante con los turistas y fomentar su participación activa \nsin necesidad de que ingresen a la aplicación de manera manual. \n \nPlataforma de Administración \nSe desarrollará una plataforma web destinada al uso administrativo de la aplicación. \nDesde este entorno, los administradores podrán gestionar todas las entidades que \nconforman el sistema (como recorridos, puntos turísticos y usuarios), además de consultar \nmétricas e indicadores de rendimiento que faciliten la toma de decisiones estratégicas. \n \nRegistro e Inicio de Sesión \nLos usuarios podrán registrarse ingresando un nombre de usuario, correo electrónico y \ncontraseña. Esta información permitirá identificarlos dentro del sistema y asignarles los \ndistintos premios y reconocimientos disponibles en la plataforma. \n \nRecorrido del Turista   V1.0                                                              7 \n\n \nAdemás, se incorporará la opción de inicio de sesión social mediante una cuenta de Google, \nuno de los métodos más utilizados actualmente. \n \n \n \nGestión de Punto de Turismo \nLa funcionalidad “Gestión de Punto de Turismo” permitirá a los usuarios administradores \ncrear, eliminar o modificar un punto de interés dentro de la plataforma. \nAl registrar un punto turístico, el administrador deberá completar información clave como el \nnombre del sitio, una descripción detallada que destaque su relevancia o atractivo, y la \nubicación geográfica exacta, la cual se definirá mediante coordenadas o selección en un \nmapa interactivo. \nAdicionalmente, podrá asignarse un coleccionable asociado a dicho punto, lo que incentiva \nla visita de los usuarios a través de recompensas dentro del sistema de gamificación. \n \nGestión de Recorridos \nLa funcionalidad permitirá a los usuarios administradores realizar la creación, edición y \neliminación de recorridos dentro de la plataforma. \nAl dar de alta un recorrido, el administrador podrá definir su nombre, descripción, categoría \ntemática, ciudad o región, y los puntos turísticos que lo componen. Cada recorrido podrá \nincluir además una imagen representativa y un nivel de dificultad. \n \nRecorrido del Turista   V1.0                                                              8 \n\n \nLa opción de modificación permitirá actualizar la información existente, agregar o quitar \npuntos turísticos, o ajustar parámetros como el orden de visita o la temática del recorrido. \nPor otro lado, la opción de baja permitirá eliminar recorridos que ya no se encuentren \nvigentes, garantizando que la plataforma mantenga un catálogo actualizado y relevante. \n \nGestión de usuarios \nLa funcionalidad permitirá a los usuarios administradores realizar la creación, edición y \neliminación de cuentas de usuario dentro de la plataforma. \n \nVer estado de los puntos de turismo \nLa funcionalidad “Ver estado de los puntos de turismo” permitirá a los usuarios \nadministradores acceder a un panel de control con información detallada sobre cada punto \nturístico registrado en la plataforma. \nDesde esta vista, se podrán consultar métricas de interacción y desempeño, como la \ncantidad de usuarios que visitaron el punto, cuántos lo marcaron como completado, la \npuntuación promedio obtenida y la frecuencia de visitas dentro de un período determinado. \nAdemás, se podrán visualizar las fotografías subidas por los usuarios como comprobantes de \nvisita, lo que permitirá validar la actividad y evaluar la calidad de la experiencia en ese lugar. \nEsta funcionalidad tiene como propósito ofrecer una visión integral y actualizada del estado \nde cada punto turístico, facilitando la toma de decisiones respecto al mantenimiento, \npromoción o actualización de contenidos dentro de la plataforma. \n \nMétricas de la aplicación \nLa funcionalidad “Métricas de la aplicación” permitirá a los usuarios administradores \nacceder a un panel analítico con los principales indicadores de rendimiento (KPIs) de la \nplataforma. \nDesde esta sección, se podrá visualizar información clave sobre el uso general de la \naplicación, incluyendo métricas como: \n \n● \nCantidad total de usuarios activos en un período determinado. \n● \nNúmero de recorridos iniciados y completados. \n● \nCantidad de fotos o comprobantes subidos por los usuarios. \n● \nPromedio de tiempo de finalización de los recorridos. \n● \nRanking de ciudades o regiones con mayor actividad. \n \nEl sistema permitirá filtrar y segmentar los datos por fechas, tipo de recorrido, ciudad o \ncategoría, ofreciendo una visión detallada del comportamiento de los usuarios y la \nevolución de la plataforma. \n \nRecorrido del Turista   V1.0                                                              9 \n\n \n \nEntregables \nA continuación el listado de entregables del proyecto : \n● \nPlataforma móvil para turista (Android y IOS) \n● \nPlataforma web para administradores \n● \nManual de uso \n \nEquipo \n \nEl equipo propuesto por Sirius para llevar a cabo el proyecto y brindar el servicio \ncorrespondiente consiste en: \n \n \n \n \n \nDuración \nLa duración del proyecto estimado en base al alcance propuesto es de 2 meses y medio a 3 \nmeses desde la fecha de inicio. El tiempo comenzará a considerarse una vez que el cliente \npresente la lógica que el sistema deberá seguir. \n \nPara poder cumplir con los tiempos acordados, se espera una alta participación del lado del \ncliente para las validaciones del trabajo desarrollado.  \n \nRecorrido del Turista   V1.0                                                              10 \nROL RECURSOS  \nProject Management (PT) \n1 \nDesarrollador Frontend (FT) \n1 \nDesarrollador Backend (PT) \n1 \nQA (PT) \n1 \nDiseñador UX/UI (PT) \n1 \n\n \nMetodología de trabajo \nPara gestionar el proyecto, proponemos utilizar metodologías ágiles con sprints semanales \nque incluyen demostraciones del trabajo y validación del progreso. En estas sesiones de \nrevisión, se requiere la presencia del equipo Sirius y del cliente. \n \n \n \nCostos Estimados del Proyecto \nPara el desarrollo de este proyecto, contemplamos los siguientes costos. \n \nDETALLE HORAS ESTIMADAS  COSTO TOTAL \nDesarrollo del proyecto \n995 USD 39.800* \n \n*No incluye I.V.A. \n \nConsideraciones \n● La modificación del alcance mencionado en la propuesta podría afectar los plazos y \ncostos estimados. \n● La fecha de inicio del proyecto se coordinará entre las partes. \n● Los costos por infraestructura o licencias necesarias no se incluyen en el presupuesto de \neste documento, sino que corren por cuenta del cliente. \n● El costo estimado de este presupuesto tiene como referencia la cotización del dólar \nestadounidense divisa tipo vendedor publicado en la web del BNA el día de la fecha, por \nlo que está sujeto a las posibles variaciones incrementales en dicha cotización. \n \nRecorrido del Turista   V1.0                                                              11",
  "requirements": {
    "projectName": "Recorrido del Turista",
    "summary": "El objetivo es desarrollar una plataforma que brinde a los turistas una experiencia de recorrido por la Ciudad de Buenos Aires más dinámica y divertida, utilizando la gamificación para incentivar la exploración de puntos turísticos y ofertas gastronómicas y culturales.",
    "goals": [
      "Desarrollar una aplicación móvil para turistas en Android y iOS",
      "Incentivar la exploración de la Ciudad de Buenos Aires a través de la gamificación",
      "Ofrecer una experiencia personalizada y organizada a los usuarios"
    ],
    "constraints": [
      "El proyecto debe ser completado en un plazo de 2.5 a 3 meses",
      "Alta participación del cliente para validaciones del trabajo desarrollado",
      "Presupuesto limitado a 39.800 USD sin incluir I.V.A."
    ],
    "features": [
      "Registro e inicio de sesión de usuario",
      "Inicio de sesión social mediante cuenta de Google",
      "Soporte multilenguaje (español e inglés)",
      "Mapa interactivo con puntos turísticos",
      "Listado de recorridos predefinidos",
      "Iniciar recorrido con indicador de progreso",
      "Detalle de ubicación con información y fotografías",
      "Listado de coleccionables obtenidos y no obtenidos",
      "Ranking de usuarios con mayor cantidad de puntos",
      "Perfil de usuario con progreso y logros",
      "Notificaciones push para mantener a los usuarios informados",
      "Plataforma web para administradores",
      "Gestión de puntos turísticos y recorridos",
      "Gestión de cuentas de usuario",
      "Panel de control con métricas de interacción y rendimiento"
    ],
    "stakeholders": [
      "Turistas nacionales e internacionales",
      "Administradores de la plataforma",
      "Artistas locales y creadores de contenido"
    ],
    "techHints": [
      "Aplicación móvil para Android y iOS",
      "Plataforma web administrativa"
    ],
    "scope": "El proyecto incluye el desarrollo de una plataforma móvil para turistas y una plataforma web para administradores, pero no incluye los costos por infraestructura o licencias necesarias."
  },
  "clarifications": [
    "What is the project budget or cost constraint? (e.g., $X/month for hosting, $Y total budget)",
    "What is the target timeline or deadline for this project? (e.g., launch in 6 weeks, MVP in 3 months)",
    "What is the expected user scale or traffic? (e.g., 100 users, 10K daily active users, 1M page views/month)"
  ],
  "answers": {},
  "tickets": [
    {
      "id": "TICKET-001",
      "title": "Set up project repository and environments",
      "description": "Create a unified repository for both the mobile application and the web platform, and set up development, testing, and production environments to ensure a smooth workflow and continuous integration/deployment.",
      "acceptanceCriteria": [
        "Given the project requirements, When a developer pushes code, Then the code is automatically deployed to the correct environment"
      ],
      "effortPoints": 3,
      "useCase": "Initial project setup",
      "priority": "P1",
      "labels": [
        "infrastructure",
        "CI/CD"
      ],
      "dependencies": []
    },
    {
      "id": "TICKET-002",
      "title": "Implement user registration and login",
      "description": "Develop the user registration and login functionality to allow users to create accounts and access the platform. This includes storing user data securely and providing a seamless login experience.",
      "acceptanceCriteria": [
        "Given user inputs, When a user registers, Then a new user account is created",
        "Given valid credentials, When a user attempts to log in, Then access is granted"
      ],
      "effortPoints": 5,
      "useCase": "Registro e inicio de sesión de usuario",
      "priority": "P1",
      "labels": [
        "backend",
        "authentication"
      ],
      "dependencies": [
        "TICKET-001"
      ]
    },
    {
      "id": "TICKET-003",
      "title": "Implement social login with Google",
      "description": "Integrate Google's OAuth for social login to streamline the login process and improve user experience by allowing users to sign in with their Google accounts.",
      "acceptanceCriteria": [
        "Given a user chooses to log in with Google, When they authenticate via Google, Then their account is created or logged into"
      ],
      "effortPoints": 3,
      "useCase": "Inicio de sesión social mediante cuenta de Google",
      "priority": "P1",
      "labels": [
        "backend",
        "authentication",
        "socialLogin"
      ],
      "dependencies": [
        "TICKET-002"
      ]
    },
    {
      "id": "TICKET-004",
      "title": "Add multilanguage support",
      "description": "Implement multilanguage support for Spanish and English, allowing users to choose their preferred language for the UI and content, enhancing the user experience for a broader audience.",
      "acceptanceCriteria": [
        "Given the application is launched, When a user selects a language, Then the application displays content in the chosen language"
      ],
      "effortPoints": 5,
      "useCase": "Soporte multilenguaje",
      "priority": "P1",
      "labels": [
        "frontend",
        "i18n"
      ],
      "dependencies": [
        "TICKET-001"
      ]
    },
    {
      "id": "TICKET-005",
      "title": "Develop interactive map feature",
      "description": "Create an interactive map that displays tourist points of interest. Users should be able to view details about each location by tapping on map pins.",
      "acceptanceCriteria": [
        "Given the map is opened, When a user taps on a point of interest, Then display details about the location"
      ],
      "effortPoints": 8,
      "useCase": "Mapa interactivo con puntos turísticos",
      "priority": "P1",
      "labels": [
        "frontend",
        "map"
      ],
      "dependencies": [
        "TICKET-001"
      ]
    },
    {
      "id": "TICKET-006",
      "title": "Implement predefined tours listing",
      "description": "Develop a feature that allows users to browse through a list of predefined tours, showcasing various tourist attractions and routes within the city.",
      "acceptanceCriteria": [
        "Given the user accesses the tours section, When they browse the list, Then they see predefined tours available"
      ],
      "effortPoints": 5,
      "useCase": "Listado de recorridos predefinidos",
      "priority": "P2",
      "labels": [
        "frontend",
        "tours"
      ],
      "dependencies": [
        "TICKET-001"
      ]
    },
    {
      "id": "TICKET-007",
      "title": "Implement tour progress tracking",
      "description": "Enable users to start a tour and track their progress through it. This involves updating the user interface to reflect completed and pending stops within the tour.",
      "acceptanceCriteria": [
        "Given a user starts a tour, When they visit a point of interest, Then the system updates their progress"
      ],
      "effortPoints": 5,
      "useCase": "Iniciar recorrido con indicador de progreso",
      "priority": "P2",
      "labels": [
        "frontend",
        "progressTracking"
      ],
      "dependencies": [
        "TICKET-006"
      ]
    },
    {
      "id": "TICKET-008",
      "title": "Implement location detail view",
      "description": "Create a detailed view for each tourist location, including information and photographs. This view should be accessible from the interactive map and the tours listing.",
      "acceptanceCriteria": [
        "Given a user selects a location, When the detail view is opened, Then show information and photos of the location"
      ],
      "effortPoints": 3,
      "useCase": "Detalle de ubicación con información y fotografías",
      "priority": "P2",
      "labels": [
        "frontend",
        "locationDetails"
      ],
      "dependencies": [
        "TICKET-005",
        "TICKET-006"
      ]
    },
    {
      "id": "TICKET-009",
      "title": "Create collectibles listing feature",
      "description": "Develop a feature that lists collectibles (digital rewards) that users can obtain by visiting certain locations. The list should differentiate between collected and uncollected items.",
      "acceptanceCriteria": [
        "Given a user views their collectibles, When they have visited certain locations, Then show collected items and remaining collectibles"
      ],
      "effortPoints": 5,
      "useCase": "Listado de coleccionables obtenidos y no obtenidos",
      "priority": "P2",
      "labels": [
        "frontend",
        "collectibles"
      ],
      "dependencies": [
        "TICKET-007"
      ]
    },
    {
      "id": "TICKET-010",
      "title": "Implement user ranking system",
      "description": "Create a ranking system that displays users with the most points. Points are earned by completing tours and collecting items. This feature encourages competition and engagement.",
      "acceptanceCriteria": [
        "Given the ranking page is accessed, When the user views the rankings, Then display users in order of points earned"
      ],
      "effortPoints": 5,
      "useCase": "Ranking de usuarios",
      "priority": "P2",
      "labels": [
        "backend",
        "ranking"
      ],
      "dependencies": [
        "TICKET-009"
      ]
    },
    {
      "id": "TICKET-011",
      "title": "Develop user profile with progress and achievements",
      "description": "Build a user profile page that displays the user's progress in tours, collectibles obtained, and other achievements. This personalizes the experience and motivates continued engagement.",
      "acceptanceCriteria": [
        "Given a user views their profile, When the profile is loaded, Then display their progress and achievements"
      ],
      "effortPoints": 5,
      "useCase": "Perfil de usuario con progreso y logros",
      "priority": "P2",
      "labels": [
        "frontend",
        "userProfile"
      ],
      "dependencies": [
        "TICKET-009",
        "TICKET-010"
      ]
    },
    {
      "id": "TICKET-012",
      "title": "Implement push notifications",
      "description": "Develop a system for sending push notifications to users to keep them engaged with the app. Notifications can include reminders, updates, and personalized suggestions.",
      "acceptanceCriteria": [
        "Given a user has the app installed, When there is new content or reminders, Then the user receives a push notification"
      ],
      "effortPoints": 5,
      "useCase": "Notificaciones push",
      "priority": "P2",
      "labels": [
        "backend",
        "notifications"
      ],
      "dependencies": [
        "TICKET-001"
      ]
    },
    {
      "id": "TICKET-013",
      "title": "Build administrative web platform",
      "description": "Create a web platform for administrators to manage tourist points, tours, and user accounts. This includes a dashboard for monitoring interaction metrics and performance.",
      "acceptanceCriteria": [
        "Given an admin logs into the platform, When they navigate the dashboard, Then they can manage points, tours, and user accounts"
      ],
      "effortPoints": 8,
      "useCase": "Plataforma web para administradores",
      "priority": "P1",
      "labels": [
        "web",
        "admin"
      ],
      "dependencies": [
        "TICKET-001"
      ]
    }
  ],
  "justification": {
    "pros": [
      "Breaking down the project into smaller, manageable tickets ensures focused and efficient development efforts.",
      "Prioritizing tickets allows for a clear understanding of what needs to be done first, ensuring critical features are developed and tested early.",
      "Dependencies between tickets help in planning the development workflow, preventing bottlenecks and ensuring a logical progression of feature development.",
      "Assigning effort points to tickets helps in sprint planning and resource allocation, ensuring a balanced workload among the development team."
    ],
    "cons": [
      "The initial overhead of breaking down features into detailed tickets can be time-consuming.",
      "Dependencies might lead to delays if any critical ticket faces unexpected challenges.",
      "Estimating effort points accurately can be challenging without a clear understanding of potential technical hurdles."
    ],
    "alternatives": [
      "Using an agile methodology with epics and user stories could provide a more flexible framework, allowing for adjustments based on sprint reviews.",
      "Kanban could be used for a more fluid task management approach, focusing on continuous delivery without predefined sprints."
    ]
  },
  "cost": {
    "tokensIn": 0,
    "tokensOut": 0,
    "usd": 0
  },
  "createdAt": "2025-11-11T17:54:06.356Z",
  "updatedAt": "2025-11-11T17:54:06.356Z"
}